{
  "1970322": {
    "overal_rating": [
      "Score*",
      "3.035",
      "2.263",
      "2.315",
      "2.325",
      "2.212",
      "1.800"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.278",
      "2.444",
      "2.500",
      "2.511",
      "2.389",
      "1.944"
    ],
    "participant": "zonlee1",
    "game_title": "\"Boss\" Fight",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 18,
    "comments_received": 15,
    "comments_raw": [
      "Z Only One! Thank you for putting it on the page, I'll pronounce it correctly on all future streams. Had fun playing on stream and left feedback during the playthrough. I like the setup and the concept. Good balancing of the shield by taking away movement. Still a fun game if you weren't able to put in everything you'd hoped. Great job.",
      "Fun game! Movement felt smooth, and I really liked the shield ability and that it made you stop moving; that gave it a good tradeoff for using it, in addition to the limited duration of it. I do wish the boss had at least one more attack for a little bit of variety, but otherwise very solid and enjoyable!",
      "Nice voice acting! Not super difficult, but no so easy that I could stand still and win. Some feedback on being being hit and hitting the boss would go a long way. The shield was a great addition and came in clutch when I got over confident! Nice work!",
      "That's a nice start, I hope you get to continue working on this! I didn't have too much trouble beating the boss but I found it a bit disorienting, maybe adding some detail to the ground would make it easier to see in which direction things are moving.",
      "beat the boss! i liked the voice acting in the beginning, nice job",
      "The memes!",
      "The animations are cool, the voice acting is fun. Also the different bullet patterns were nice. The games feels a little prototype-y though. Also, the shield didn't seem to work sometimes, even when I had charge left.",
      "",
      "Great Voice acting :D",
      "nice submisison! I wish the legs and arms weren't almost the same shade of grey as the background, just to see them flail around <3",
      "Well done ! The running animation was funny, and I liked the voice over at the start. Also thanks for the shield, I am usually really bad at this sort of game so it was handy x)",
      "funny running animations haha, simple and easy to play, maybe needs a little more variety in attack patterns",
      "We both had very similar ideas for shooting and shielding haha.  Really loved how the music and voiceovers got the boss fight vibes going!",
      "Nice run and gun mechanics for the boss fight.",
      "Really love the music and the voice overs.  Did so much to make it feel like a boss fight.  The circular pattern didn't leave a ton of room to get through.  Maybe just a touch more room there.  Movement and aiming felt pretty good, though.  Good job."
    ],
    "comments_posted": 2,
    "created_at": "2023-03-14 22:43:05",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970322",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zonlee1",
      "member_since": "28 January 2021",
      "posts": "12",
      "topics": "2",
      "followers": "1",
      "following": null
    }
  },
  "1968411": {
    "overal_rating": [
      "Score*",
      "4.864",
      "4.236",
      "4.318",
      "4.136",
      "4.227",
      "3.636"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.864",
      "4.236",
      "4.318",
      "4.136",
      "4.227",
      "3.636"
    ],
    "participant": "simoncb",
    "game_title": "A Duck On Wheels Part 3: Duck Race 3000",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 17,
    "comments_raw": [
      "I overtook and won the mouse in the last centimeters xD, cool game!",
      "Nice! This was a fun little racing boss battle with some really fun mechanics. I liked the bubbles, as they could help you gain a lot of vertical height to get on those upper pathways without as many cogs. I also liked that you could jump on the rat. Not really much I would change here, but some music would be nice.",
      "Very impressive! Awesome mechanics to watch out for on the race: the balloons to bounce off of properly, the gears that the rat throws out, everything works together very well. I had a blast!",
      "Had a blast closing out yesterday's stream with this one. I wanted to go out on a high note and I knew ADOW (what the cool kids call A Duck on Wheels) wouldn't disappoint. I left feedback throughout, but another top notch entry. Love this series.",
      "Another duck on wheels amazing submission! Really impressed how you took the boss level in a race game and actually made it fair. Stomping on the rat at the start gave me a boost and then trying to get the upper pathways. Tried to play it on stream but it lagged.",
      "Very clever all around, from the way you balance the race, the off-screen indicators, and the well implemented checkpoints. I would have personally loved some way to challenge myself even further, like speed boosts that make me faster but make it harder to react to danger. All in all this is a very well executed and unique twist on a boss fight.",
      "Loved the bounce mechanic, and I loved how it was more of a race and dodging stuff than a combat focus. Always looking forward to playing Duck on Wheels each round, and this did not disappoint!! :)",
      "Super cool as usual. The style is great and The new bouncing mechanic was super satisfying",
      "Really fun to play! Loved the boss design and the art style as a whole. Great work!",
      "It was such a joy to play! And that art style clearly stands out. Fun game :)",
      "Bouncing on balloons as a duck on wheels isn't something I would have expected before GDKO, but I'm glad it exists!",
      "Loved this one, the race was well done and fun with a lot of game play options and paths.",
      "I appreciate the updated clean art style, it gives a fresh look to the game. However, I do miss the crazy and fun stock images from the past games. I found it challenging to see everything during the race, and I'm planning to go back and take a closer look to make sure I did miss anything. Overall, great job on the game!",
      "Your games are always so much fun and your boss in this one is awesome!",
      "It's amazing what you've done with the Duck on Wheels series.  My wife and I both look forward to playing this one every round.  And this round didn't disappoint!  About the only thing really lacking for me was some epic boss battle music.  But since that wasn't one of the criteria, it's top marks from me.  Great work!",
      "very nice! simple but fun mechanics with the blowing up balloons. I liked that the boss wouldn't get too far away ahead if I was doing badly.. but when I was doing well I didn't like that he could catch up (but that's just a competitive thing haha) Great stuff!",
      "love it! so glad we get a third installment to the duck on wheels games! love the boss fight but there was one part near the end which was basically a leap of faith as you couldn't see the spikes below you and that caused me to lose the first three times but i did manage to win on the third :D"
    ],
    "comments_posted": 9,
    "created_at": "2023-03-13 17:13:18",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1968411",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/simoncb",
      "member_since": "08 April 2015",
      "posts": "80",
      "topics": "1",
      "followers": "8",
      "following": "8"
    }
  },
  "1970402": {
    "overal_rating": [
      "Score*",
      "2.976",
      "2.976",
      "3.025",
      "2.489",
      "2.889",
      "2.976"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.050",
      "3.050",
      "3.100",
      "2.550",
      "2.960",
      "3.050"
    ],
    "participant": "spoonsweet",
    "game_title": "Acid Sewers",
    "platforms": [
      "windows"
    ],
    "rating_count": 20,
    "comments_received": 15,
    "comments_raw": [
      "I now have a fear of cats",
      "A shame that the game got a bit shaky during the upload process, however the animations and spriting were amazing, you'll never let me down in that regard.",
      "",
      "Awesome art as always. I liked the  way the pitch of the meows showed you where the laser beam will hit.",
      "Enjoyed playing this on stream. I'm really glad I was able to get it to work so I could share feedback there. Art as always is amazing. I think the sfx were all good, but the balance of the audio levels could be improved. The telegraph for the sewer beam was excellent, but once I was out of sight of the green kitty, I was just running based on instinct. Another great entry, spoonsweet.",
      "I just want to create pixel art as impressive as yours! especially adorable kittens and their sounds.I understand that you were pressed for time and probably would have included more hints if you could have. However, after playing the game a for f",
      "Very beautiful visuals, as always! I hadn't noticed until I read the comments that the meow pitch told you where the laser would spawn, but that's a nice touch! I think maybe another small clue would help for those that don't notice it like myself, because it otherwise felt a bit harsh when I got caught by it seemingly randomly.",
      "The art and animations are lovely! Sounds were a bit loud, but nothing adjusting my volume couldn't fix. Really good work!",
      "Took me a few to get what was going on.  Completely missed the gear the first few times.  Had to read the comments to figure it out.  Once I did, no issues with gameplay.",
      "Noooo spoonsweet did you accidentally submit your (DEBUG) version :\") Cool pitch mechanic though, well executed with the elevator slowly making the cat out of frame, and amazing art as always.",
      "great art! so good that I took the cog as a background element the first five times I saw it. Maybe that's on me though. Did manage to make it to the top - would have been nice to see Drain Cat again while we're climbing the elevator?",
      "really cool! like the idea and the great art! also liked how you could tell where the laser would spawn based on the meow pitch!",
      "The idea for the game is great and it's visually stunning. I think it was hard to know where the lightning bolts were going to come from and they were very fast. I think it might have been better if the boss was climbing on the walls spitting acid as you go up the elevator. I managed to get to the end though. I did find a bug on the download version where I fell through the floors at either ends but I'm going to ignore that as the online version worked perfectly.",
      "Art and sound are fantastic! I got to the top of the elevator thing and then couldn't do anything. The two cats were really cool though.",
      "Hey! i love the art! So good! The music and sounds weren't balanced well so either too loud or quiet. Also... How do you beat the boss? haha i can't seem to do anything but run away, or am i missing something?"
    ],
    "comments_posted": 28,
    "created_at": "2023-03-14 23:50:55",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970402",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "942",
      "topics": "5",
      "followers": "153",
      "following": "68"
    }
  },
  "1970339": {
    "overal_rating": [
      "Score*",
      "2.636",
      "2.900",
      "3.045",
      "3.455",
      "2.591",
      "2.773"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.636",
      "2.900",
      "3.045",
      "3.455",
      "2.591",
      "2.773"
    ],
    "participant": "keltfire",
    "game_title": "Ad Infinitum",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 13,
    "comments_raw": [
      "I really like the slowdown mechanic. Its done tastfully",
      "Very clever take on \"Would you come back to this again and again\"! I would have loved to have done something similar but I didn't have the time :\") I have 2 suggestions that have yet to be mentioned:",
      "Love your art style, and this is such a unique concept! At one point I lagged a bit and got stuck in the wall somehow? I don't really know, but it was super fun!",
      "I really enjoyed the changing dialogue as you looped through beating Chaos! The music was good and the controls felt smooth. My one criticism would be that the boss almost never sits still. Which makes slowing time to dodge projectiles feel bad, because you need to slow time to get close to Chaos. Maybe a longer wind up animation on Chaos before he attacks or a longer cooldown after the attacks would help remedy this.",
      "I enjoyed the dialogue changes, and the story fitting the mechanics. The slowing down time thing is also really nicely done. I also liked the music, and how it gets more intense as the fight goes on. However, I think the game is definitely really hard, mainly because it's difficult to get any hits on the boss. I think the main problem with the bosses difficulty is that the only time he stops shooting stuff is right after hes moved. This makes it feel a little luck-based on whether he'll move somewhere right next to you and let you get a hit, or move just far away enough so he'll start shooting again when you approach him. I would make it so he shoots, waits a second to let the player get some hits in, and then moves and repeats the cycle. Even though it was too hard for me, I do see a lot of potential in the game. The story is really interesting, and I would love to see it expanded.",
      "Tried it on stream, clipped off the screen really badly. my computer lagged of course so that is an issue.",
      "The storyline and how you use it as a replayability feature is just awesome.  Took me a bit to get used to the mechanics and attacks.  But once I did, I didn't mind it.  Love the dialogue system and how it's different each time.  Would be curious to hear how you did it.",
      "What is the secret!? I have to know. I beat him six times this morning and it still repeated, so then I figured I would beat him without using slow motion at all. I restarted and beat him the first time without using any ad infinitum and it still started me over again. I'm stumped!",
      "cool time mechanics and like i said in the stream, i love how the dialogue changes. hades like.",
      "Oof. I am not good at this, but it's fun trying. I think its great even if I'm terrible at it. The dialog is great and the mechanics are as well. I'll be back to try again later.",
      "Tricky boss fight, but always a fan of a good time mechanic!",
      "Slowing time was really fun, and I really liked the animation for it ! I couldn't defeat the boss as well :( but I really liked the time mecanic, it was really cool ! Well done !",
      "I couldn't defeat the boss but I damaged him good and it was fun dodging his various attacks. I also enjoyed using the time ability and the dialogue with the boss was great. If you were to further develop the game, I think it would be cool if you could slow down time and then pick up the two types of projectiles and use them against the boss"
    ],
    "comments_posted": 28,
    "created_at": "2023-03-14 23:08:21",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970339",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/keltfire",
      "member_since": "13 June 2020",
      "posts": "312",
      "topics": null,
      "followers": "12",
      "following": "3"
    }
  },
  "1967375": {
    "overal_rating": [
      "Score*",
      "3.416",
      "3.416",
      "2.684",
      "3.611",
      "3.172",
      "2.733"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "3.500",
      "2.750",
      "3.700",
      "3.250",
      "2.800"
    ],
    "participant": "solisu",
    "game_title": "BadAds",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 15,
    "comments_raw": [
      "This is actually what my computer looks like",
      "The charm is wild, I genuinely laughed playing this. Would love to see this expanded into a full virtual OS with different sites!",
      "Good game. The ads are really funny, the game play is quick and hectic. I think the boss should have a bit less health though. Had to get out the autoclicker for this one.",
      "I like to think I beat it on hard mode because my extra wide monitor meant ads popped up well outside of the in-game monitor boundary. Pro gamer here. I had a blast with this one on stream. I like how much you left for the player to discover. A nice reward for beating the game would be to go through the image library for the ads. I wanted to see and read them all, but I also didn't want to lose! Great entry.",
      "Very clever idea! I managed to beat it after a couple attempts, had to bring back up my osu skills from way back when I played it. I thought the lag was annoying but in a good way, I could tell it was purposeful with the relentlessness of the ads. Loved it!",
      "Really cool idea. I got close, but it was a bit to hard for me. Reading the comments, I see now that the lag was intentional. That's a really interesting idea! Nice work!",
      "i streamed your game!",
      "OMG BAD BOSS NEVER LETS ME WATCH THE VIDEO PC CRASHES PIRACY BAD!",
      "This was super fun, I struggled a bit at first, got close to completing it, but didn't manage to in the end! Had a bit of lag when all the popups came up, got to a point where I couldn't click any pop-ups at all unfortunately. Great job though, and I love the art style as well!",
      "Super cool idea! I love all the popups and having to click on the video to damage the boss, But in the end it was a bit too difficult, I couldnt beat it after many tries. But it was still a pretty cool game!",
      "Couldn't beat it as well but the idea was nice and really funny xD Well done !",
      "fun idea! I couldn't beat it, I'm assuming I just have to turn off all the popups and keep pressing play.",
      "This was a very different take on a boss fight and I thought it was great!  The music choice was also excellent.",
      "Really interesting concept.  The use of the eyes was a really cool touch.  Did get quite challenging near the end.  Haven't managed to beat it just yet.  Gonna have to try my hand at it again once I rank everything.  Nice work!",
      "I couldn't make it, too many pop ups. This was fun and challenging."
    ],
    "comments_posted": 13,
    "created_at": "2023-03-14 20:40:27",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1967375",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/solisu",
      "member_since": "14 March 2019",
      "posts": "31",
      "topics": null,
      "followers": "18",
      "following": "24"
    }
  },
  "1970198": {
    "overal_rating": [
      "Score*",
      "3.703",
      "2.983",
      "2.891",
      "2.315",
      "2.726",
      "2.726"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.222",
      "3.122",
      "2.500",
      "2.944",
      "2.944"
    ],
    "participant": "spadeship",
    "game_title": "Below dark waters",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 13,
    "comments_raw": [
      "This is really well made, you expressed a lot with such a low resolution (which I am aware is not easy to do).",
      "I had fun with this on stream. I think the movement felt fluid and intuitive. I like the dual use of movement also being my method of attacking. I think the game is a little easy for folks who want to camp out at the very top or bottom of the screen, but it's good to make the game beatable for anybody. Great work.",
      "Simple but well executed! Took me a little bit to figure out what I had to do to damage the boss, as I thought the noise indicated I was getting damaged at first, but I got it in the end! I do wish the boss had a second phase or something similar to that, even if it was something like increased frequency of attacks, to keep me a bit more on edge.",
      "Simple, but really fun! I really like the the dynamic speed based on cursor distance, that just felt good. Nice work!",
      "Very compact and straight forward boss battle, genius usage of the submarine to deal damage. the pixels of purple blood were also satisfying to see to get feedback for when damaging the boss. A battle of attrition!",
      "I enjoyed playing this fun little game. The blood effect from cutting into the boss was a nice touch and provided good feedback during gameplay. I suggest adding a bit more variety to the boss's attack patterns as it could greatly enhance the overall experience. Overall, good job on the game!",
      "The pixel-perfect art is pretty good, as well as the control system. The atmosphere is also really nice, it was a little simple though.",
      "really fun actually to drag my submarine around! easy boss fight but enjoyable nonetheless!",
      "Fun idea ! It was a bit hard at first to understand where the hitbox of the fish stopped and the hitbox of the blade started but I once I got it I cut that octopus to victory ! Also I really liked the blue ink coming out when I dealt damage, that was a nice touch. Well done!",
      "I think it's an interesting way to fight a boss and I like the artwork",
      "Took me a second to realize that the health bar was for the boss and I could attack once it stopped!  Once I got used to the pace of it it was pretty fun.  More variety from the boss could have been nice but what you had was solid.",
      "Cool concept.  Wouldn't have thought of using the blade as a weapon.  With no music, it was lacking a little bit that made it feel \"boss-ish\".  But that isn't really the focus of this round, so no worries there.  All around, a good entry.  Nice job.",
      "The movement took a little getting used to, it provided a fun challenge. Only problem I have is that it felt a little short, another phase or two would have been awesome."
    ],
    "comments_posted": 15,
    "created_at": "2023-03-14 21:11:58",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970198",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spadeship",
      "member_since": "13 March 2022",
      "posts": "264",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "1968664": {
    "overal_rating": [
      "Score*",
      "3.952",
      "4.286",
      "4.124",
      "4.000",
      "4.190",
      "4.190"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.952",
      "4.286",
      "4.124",
      "4.000",
      "4.190",
      "4.190"
    ],
    "participant": "crayonmelon",
    "game_title": "Boss Rush",
    "platforms": [
      "android",
      "web"
    ],
    "rating_count": 21,
    "comments_received": 15,
    "comments_raw": [
      "Brilliant! I love warioware, good stuff.",
      "Very unique entry, I'm a fan of this kind of humor and I had a lot of fun with the minigames. It took me a while to get the timing of the brick minigame, my best score in hard mode was 54. Also thanks for not putting a jumpscare at the end of maze :)",
      "Had a great time with this on stream Love the concept, styling and overall vibe. You got me with that brick twist at the end!! Love your entries. They are really refreshing when playing through marathon jam games. Great work.",
      "your games always feel like a fever dream lol. but this was great! i loved all the mini-games and only had a problem with the maze but after i figured out what you actually needed to do it was easy to beat all 25 and get to the final thing but idk if there is anything after doing it for a while because i just died after getting to 27 lol",
      "Really creative and aesthetic! Loved everything about it! I was livid after I thought I had won the first time, had to go back and beat it again out of spite. Great work!",
      "Very stylized. I like it a lot. Not only is it fun, but it's also quite fun! I honestly don't have any suggestions for this game, because everything in it is really well done and deliberate. Good job.",
      "Very fun wario-ware style minigames. Your art style is really unique and interesting too, well done!",
      "WATER BOT-",
      "very unique! Got style! Got painful graphics! Got memey man! Shows really good technical skills this :) great job!",
      "Maybe my favorite game in the whole GDKO. Not enough stars to rate this.",
      "THIS IS SO GOLD ! I love it so much ! So creative, the aesthetic is so perfect, like 2000/90s internet vibes but make it meme (idk) I think it was just perfect. (also awesome mini games and gameplay of course) Really well done !",
      "Took me a second to get into the rhythm of it but it's a really fun boss fight concept! Maze kept kicking my butt haha.  Great collection of minigames!",
      "I got a score of 12. It's got a lot of fun little mini games and I like the way it's presented with the boss giving the emails",
      "Loved the Wario Ware style gaming it was really fun. I couldn't beat it yet, but I will be back when I'm done playing and rating all the games.",
      "You always come up with some really surreal scenarios.  My mind doesn't work that way, so I think it's pretty cool!  Visually, it felt a little too all over the place.  Maybe a touch of consistency in visual style across the minigames might help with that.  It was almost a little too jarring at times.  But since this round isn't focused on that, not an issue here.  Nice work!"
    ],
    "comments_posted": 15,
    "created_at": "2023-03-14 22:37:54",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1968664",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crayonmelon",
      "member_since": "22 May 2019",
      "posts": "190",
      "topics": "1",
      "followers": "61",
      "following": "13"
    }
  },
  "1964350": {
    "overal_rating": [
      "Score*",
      "4.295",
      "4.255",
      "4.205",
      "4.305",
      "4.406",
      "4.305"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.516",
      "4.474",
      "4.421",
      "4.526",
      "4.632",
      "4.526"
    ],
    "participant": "loten",
    "game_title": "Cosmic Raiders",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 17,
    "comments_raw": [
      "Unique entry! The fight was not too cruel and not too easy. I liked it a lot!",
      "Love this! I haven't really played many games like this, but this is phenomenal! The boss fight felt really fun, and a good challenge. Literally enjoyed this so much!!! :)",
      "The depth here is crazy. I love how many cards there are, it really helps make the runs feel unique. The boss battle itself is also really good. I like how it combines a lot of the things about the other ships and mashes them all together into one big enemy. (or three, technically) My one complaint is I wish there was some way to heal yourself.",
      "Really fantastic entry here! I definitely see the inspiration from both Slay the Spire and FTL, you've really built off of the ideas of those games so well. I'm curious how you got the balance to feel so good in such a short amount of time, a game like this does not seem easy to balance properly.",
      "You blew my mind with this one Loten! congratulations on such an amazing and polished game, you truly pay homage to the great games you list as inspiration!",
      "This is wonderful! I love Slay the Spire, and this felt just as fun to play! Really enjoyed checking out all the cards and trying different builds. The boss is balanced and was a nice challenge. Great work!",
      "Had a great time with this on stream and came back today to finish the boss! I don't know why I didn't hit continue on stream and have a second run at the boss. I think I just assumed I had to start over. Love the balance, the different card interactions and the surprise with the boss at the end. It's crazy, because this round was all about making a boss fight, but I was so engrossed in the game I forgot all about it, so it came as a surprising delight! Excellent work.",
      "I've tried (and failed) to make my own asymmetric deck-builder before, so I am very impressed by your implementation. One quick suggestion is to preview the enemy's intention like they do in Slay the Spire, as I think it adds a lot more strategy and depth to the gameplay. Other than that, great game with great synergies, had me play through twice to try out the different fun decks.",
      "WHATTTTTTT!!!! This is amazing! i love deck builder games (never played a digital version of one though) and this was so well made! All the variety and synergy needed in a deckbuilder! Brilliant entry!",
      "Really simple & quick to pick up, but also a lot of fun. I was really glad I didn't have to start at the very beginning when I lost to the boss the one time",
      "It has strategy, but not too much. It is challenging, but not too much. Made me think, but not too much. Your game has a perfect balance of everything and is definitely a solid entry, great job!",
      "Really well done ! it was so challenging but satisfying, you really made me think about every one of my action x) And I really appreciate the fact that if you die, you don't have to restart everything, and you get a chance to get a better deck. Great job really impressive!",
      "I'm not usually a card game player (aside from Pokemon TCG with my kids).  But after watching GhostBit play it on stream, I had to try it out.  Really well done.  Good amount of strategy, but not too difficult.  Great job!",
      "HOW! i made a card game as well, but yours.... my lord.... you did everything i scrapped. and you balanced your cards, in which i did not do... i bow to you as the supreme card game for round 3!",
      "Amazing! Everything is done so well, had a really great time playing it",
      "Great deck building space battle game. I enjoyed the whole thing from choosing which cards to select and then using them in battle. Very well done.",
      "I'm a sucker for rogue-like deck building games and this one did not disappoint!  SO GOOD.  Two rounds in a row you get five stars across the board from me haha.  Would absolutely play more of this."
    ],
    "comments_posted": 15,
    "created_at": "2023-03-14 23:41:28",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1964350",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "169",
      "topics": null,
      "followers": "16",
      "following": "6"
    }
  },
  "1949059": {
    "overal_rating": [
      "Score*",
      "4.522",
      "4.261",
      "4.522",
      "4.226",
      "3.696",
      "4.130"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.522",
      "4.261",
      "4.522",
      "4.226",
      "3.696",
      "4.130"
    ],
    "participant": "sijilum",
    "game_title": "Crafts and Combat Again",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 19,
    "comments_raw": [
      "Great entry! Somehow managed to do this.",
      "Awesome art style, great feel to the movement and attacks, and the boss' attacks were very interesting and varied! The only thing I wish that was there was some sort of jump attack, I seem to remember something like that in your round 1 entry and wish it was still there. Overall though, very solid and super fun!",
      "Love the variance in attacks! I wish there was more indication of the boss's health, apart from just the page splitting up. Apart from that, no complaints, this was super fun!",
      "This was great fun didn't manage to play in the previous rounds but I had heard many good things about this! Great work on revisiting it! An overall solid boss fight! nice work with the little details such as the drop and roll! really enjoyed punching and dashing people as well! Congratulations!",
      "Really polished game, fun gameplay and a cool concept, and a fair 5 Stars rating. Didn't get the chance to play this during round one, but I'm glad I did it now.",
      "Take all the stars I have. I hope you could tell on stream how much I loved this entry. Small critiques, would like variation in the player attacks. Even though the had dropping doesnâ\u0080\u0099t hurt the player, think it would still be cool to telegraph the drop. And would love a health bar or indication of how far I am in the fight (though I suppose the page splitting up does that in a way). Excellent work.",
      "Very original boss fight with a good variety of attacks. I agree that having a way to tell where you are in the fight would be great, it could be a health bar or just some visual changes on the hand (I was thinking about chopping the fingers one by one but maybe that's a bit too brutal haha)",
      "Super creative! I love all the was the hands attacked and the way the paper split up and pieces were taken out. plus the gameplay was polished, challenging but super fun",
      "Attack patterns are awesome! Love this game",
      "Amazing fight! I really liked the different attack patterns and animations. Great work!",
      "I really liked the simple art and varied attack patterns. A health bar for the boss would have been helpful. Otherwise, an absolute fun fight!",
      "This is an excellent implementation of a boss fight. It was fun, balanced, and polished. My only critique is that I ran into 2 bugs: the quarter of the paper returned but was still treated as if it was removed, and it is possible to trigger a loss while in the win animation. That being said the rest of the game was so good that I shall overlook that. 5 stars!",
      "Good Job!",
      "I feel like this game (and series you've done) really shows that simple with style goes a longer way than something really complex.  You go a really long ways with simple stick figures, and the hand boss is really solid in a way that gives good Master Hand vibes.  Tough fight but fair, with all the attacks being avoidable.  Also the point where the board gets cracked by the hand is just so dope.  I'd agree with other people that a health bar for the boss would help, cause it's hard to not know how close you are to winning.",
      "Looks like I missed out on your round 1 game. I must say that the art style, setting, and gameplay are amazing. The boss you chose for this style of game is incredibly creative and fitting. Although I found the controls a little unconventional at first, I was able to adapt to them quickly. Overall, you did a great job!",
      "I've been really wanting to play this since hearing about it on the Discord server.  Really solid entry.  Definitely felt like a boss fight.  On the 4 panel part near the end, some of the enemies got stuck and I could pretty much avoid them if I didn't jump.  I'd also like to see a health bar for the boss.  Was never really sure where I was in the fight.  Past that, though, no issues that I noticed.  Nice work!",
      "Such a fun boss fight and I really like the variety of attacks the hand can do and the way it increases in difficulty too",
      "Great boss battle, the bash mechanics were great. I loved fighting against the hands.",
      "great boss! love the animation and the attack patterns! but that attack where the hand spawned enemies gave me soooo much trouble lol ( i did end up beating the boss second try tho :D )"
    ],
    "comments_posted": 7,
    "created_at": "2023-03-10 22:44:36",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1949059",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "119",
      "topics": null,
      "followers": "37",
      "following": "10"
    }
  },
  "1959700": {
    "overal_rating": [
      "Score*",
      "3.095",
      "3.257",
      "2.905",
      "3.667",
      "3.286",
      "3.333"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.095",
      "3.257",
      "2.905",
      "3.667",
      "3.286",
      "3.333"
    ],
    "participant": "n3wtworldorder",
    "game_title": "Fingies",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 13,
    "comments_raw": [
      "fingor",
      "Had fun with this on stream. Just replayed it to see if I could get the sprint to work a little better when not streaming and it did seem smoother, but I also noticed I could clip into the boss' nose and take out the boogers from the inside! I felt like a super power gamer!! Great entry, and I love the writing and voice acting in the beginning and end. Well done.",
      "I absolutely loved the narrator voice, the guy running the test. Very funny and entertaining! I think the baseline you have with combat and the boss was good, but a bit too easy in my opinion. With maybe another layer to the boss I think you'd have a really solid game on your hands! (oops I mean fingies)",
      "Really great game! I enjoyed the boss having weak points that need to be targeted, it added a lot to the overall experience! The voice acting was solid as well! Great work!",
      "Finger gun animation was awesome. I think the shooting mechanics were really good as well. The design for the boss is quite unique. His attacks were a bit lackluster, but I think the game was still pretty fun anyways.",
      "He'nose he is big and disgusting!",
      "Overall really solid game! The game art is really nice and The 3d models for the hand and nose were cool. The only thing was that even with the sprint the movement felt kind of sluggish and slow but still the game was super fun!",
      "wowww that was most strange mechanics i have ever seen, I had fun. At first I thought The Nose doesnt move, but my panic level increased as soon as I noticed he is closer to me hahah, great job!",
      "I never thought I'd be fighting a nose. A really unique boss fight and satisfying to kill. If I were to suggest one thing to improve it would be to make the boss solid as the player can walk inside",
      "Funny concept and a great boss fight. Only thing I feel is missing is like another phase of the boss, but I barely killed this one as is, so maybe not.",
      "Cool idea.  Has some potential here.  The boss did a fair amount of damage if you got hit with the laser.  Managed to avoid it if I was close enough and went fast enough with the turn.  But if you're at any kind of distance, it's almost brutally unfair.  Would also like to have some boss fight music with it.  But since that isn't the focus this round, not a priority.  Nice job all around!",
      "hilarious commentary (yes I stayed to listen to it all). Game has fun potential, I wish there was a way to avoid getting hit by the laser. My finger (fittingly was hurting by the end of the game haha). Good job on a cool idea and great character voicing lol",
      "Finger gun feels so satisfying!"
    ],
    "comments_posted": 0,
    "created_at": "2023-03-14 20:00:10",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1959700",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/n3wtworldorder",
      "member_since": "08 December 2020",
      "posts": "22",
      "topics": null,
      "followers": "5",
      "following": "2"
    }
  },
  "1964452": {
    "overal_rating": [
      "Score*",
      "3.190",
      "3.619",
      "3.857",
      "3.467",
      "3.048",
      "3.619"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.190",
      "3.619",
      "3.857",
      "3.467",
      "3.048",
      "3.619"
    ],
    "participant": "dev-pirates",
    "game_title": "Full Retro Panic",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 18,
    "comments_raw": [
      "Really cool, I loved all the different styles, all we need now is an N64 style phase! aha!In all seriousness this was a really good showing, the spritework on the final phase is legendary.Edit: One last thing I forgot to mention, I'd love a bit more warning on the attacks!",
      "Great Mechanics and Art, good job!",
      "Thanks for sticking around for the stream! You could have put your game name in chat and I would have jumped to it, but appreciate you watching. I think you got all my feedback, but just wanted to reiterate how cool this entry was and how things could progress and regress depending on health. Such a great concept and well executed! Great work.",
      "Really cool art style, and framing the boss fight around the changing art! As others have said though, definitely some bugs and balance issues, the big one being getting trapped in the ceiling from being caught above the fist when it's rising up. Those can be fixed through playtesting and future updates though, overall it was a fun experience, well done!",
      "Love the art style! This was pretty fun, but there were a few glitches, like that car and the wall thing. I'm not sure if this was just a me thing, but I couldn't really tell if that bar thing was meant to be the player health or the boss health, and I couldn't tell, from reading the other feedback I think that was just a me thing LMAO. Loved playing this, it was super fun!",
      "I absolutely adore the art! AMAZING WORK! especially how you manage to implement the colour changes to be meaningful to the gameplay mechanics. Congratulations also on having such a forgiving health system. Mr Skelly bones is by far my favourite, but I also appreciate the whole skeleton theme. I had so much fun with this one during stream:https://www.youtube.com/watch?v=cSUIomK5BB0",
      "Overall, love the direction this is going.  As people have mentioned (and you are already aware of), there were a few small balance issues.  I, too, had issues getting stuck between the walls and the car (and once, B4's hands).  And last 2 bosses felt a little unbalanced for a game jam.  If we had the whole game to get used to the hitbox, might be a little different.  But like I said, overall this is really well done.  Tying the visuals to health and progression was cool and it was a great amount of polish.  NIce job.",
      "Jesus this was awesome! the way the style of the art indicted the health of both the player and the boss was not only super well drawn but also really creative and well implemented! Plus the gameplay was challenging but fun. at the last 2 phases the difficulty was a bit too hard and it took me while to complete",
      "The art is really good. Like, really good. I think the concept is also pretty intriguing. However, some of the bosses feel unfair. I think adding checkpoints between them could help a lot, so you could learn their attacks better. The first boss was pretty good. The skull car has an awesome design. However, you can get stuck between the wall and the car and basically just lose instantly, and it also doesn't have much telegraphing on it's attacks. The third phase was also pretty good, although the lasers made some hits impossible to avoid. However, on the 4th phase, I'm not quite sure how to dodge the hands, since the skull also hurts you, and there don't seem to be any spaces that you can fit through. Also, the player sometimes disappears for a bit when they take damage, which made it a bit confusing on where you are and caused me to lose a lot. While I personally found it too hard, I think if you decide to expand on this in a feature round, and fix up some of the issues, it could definitely be a really solid entry.",
      "Excellent and unique concept of linking the evolution of graphics to health and progress. There are honestly quite a few game design choices that I disagree with here, but I can definitely appreciate the effort that has gone into implementing such a concept with so much content. Looking forward to your next game!",
      "Nice art direction and idea! It was annoying if i got stuck between the wall and a fist or the vehicle as it would be constant ticking down of health until i died, and the collision with the head causing damage was a little frustrating as there was not a lot of room in the box, but those are minor things because the game and concept are super duper good! great job!",
      "Great entry! I just adore how environment keep changing!!! Nicely done",
      "Really great idea!",
      "The way the art improves and the different attacks of the bosses are awesome",
      "I don't know how you came up with this idea and how you managed to get all of this ready for the jam. But It's clear that a lot of effort and love came with this and that is something that should be praised a lot. I know it might be a lot to ask, but seeing a full game with this concept would be amazing, just saying... Keep it up and congratulations!",
      "Just beat it after 4-5 tries! Really great job with all the different artwork! That must have taken a lot of time! All the bosses felt fair and balanced, and the health regen played a big role in that. I had a few instances where I felt the hit boxes of the player or the bosses could have been a tad big smaller, and a bug where I got stuck in the ceiling after jumping on the fists of the skull bosses first phase. Other than that, great work!",
      "Having the player and boss upgrade/downgrade the art quality was a really cool idea!  It was a tough fight but in a way that has me wanting to come back to fight it again!",
      "Great design and execution! The more you die, the more you learn about the boss. I'm currently in the third phase and hoping to finish it within the voting period lol!"
    ],
    "comments_posted": 28,
    "created_at": "2023-03-13 04:28:36",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1964452",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "574",
      "topics": "1",
      "followers": "12",
      "following": "13"
    }
  },
  "1969724": {
    "overal_rating": [
      "Score*",
      "2.263",
      "2.109",
      "2.212",
      "2.263",
      "2.160",
      "2.201"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.444",
      "2.278",
      "2.389",
      "2.444",
      "2.333",
      "2.378"
    ],
    "participant": "midorimonki",
    "game_title": "GRIIM",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 11,
    "comments_raw": [
      "Had a great time with this on stream. And a bit off topic, but golly are your thumbnail always so impressive! Getting into a flow of attacking and parrying properly felt great. I wasn't sure I saw all the game had to offer though, I would hit a certain point with the bosses where they only had a little bit of health left, but then just disappeared. Love this world and this character. I think you're onto something very special. Great work.",
      "The world and aesthetic is awesome, I still love your 2D in a 3D space style! The combat has a good start, but I think it needs something more. I like the attack/parry system, but as others have said some more audio feedback would be good, maybe coupled with some different attack patterns from enemies.",
      "I really like the movement/damage combo attack! The aesthetic is pleasing and the setting in interesting. Hopefully you continue working on this, I'd love to see how it all shapes up! Nice work!",
      "Great to see old characters in the game world be expanded the pups the flowers the leader of the pups, the heart being frozen etc. in the beginning there was sound for the wind but then it sort of disappeared. Also as other people commented sound effects for action feedback would be nice to understand what was going on. Still a beautiful world!",
      "The visuals are definitely there.  I still absolutely love your art style.  And the touch of adding blood to the snow.  So cool!",
      "I think you have the aesthetics nailed down. The combat system is a bit confusing at first, but pretty fun and satisfying once you get the hang of things.",
      "Interesting mechanics of snow and pretty design, good job!",
      "I think what you've made so far is great and you've got the ideas and technical stuff in there. Once it gets finished it will be awesome",
      "I'm sure you had plenty things you wanted to get to before you ran out of time, but the concept and setting were good, and launching enemies away when they were defeated was very satisfying!",
      "This was a good continuation from the last two games. It was tough and there wasn't much feedback on taking or giving damage. Bummer that you couldn't complete it, but I'd still like to see more so hopefully you make it to the next round... or keep working on it.",
      "Loved that it was a mix of your last two games.  It was a bit difficult and not much feedback if I was hitting or parrying correctly. I like the idea behind it and would love to see more of this character as I loved them in your first submission"
    ],
    "comments_posted": 0,
    "created_at": "2023-03-14 15:35:30",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1969724",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/midorimonki",
      "member_since": "02 December 2020",
      "posts": "88",
      "topics": null,
      "followers": "18",
      "following": "5"
    }
  },
  "1970272": {
    "overal_rating": [
      "Score*",
      "4.418",
      "4.227",
      "4.545",
      "4.636",
      "4.500",
      "4.182"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.418",
      "4.227",
      "4.545",
      "4.636",
      "4.500",
      "4.182"
    ],
    "participant": "unburntstudios",
    "game_title": "Gladiator Beats",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 22,
    "comments_received": 18,
    "comments_raw": [
      "interesting and cool mechanics. Pixel graphics are also very cool!",
      "Awesome game! It was awesome to beat the boss with the beat lol!!",
      "A really fun game with a load of awesome animations. Honestly one of my favorites from the jam and definitely a top 3 contender. It felt incredibly satisfying to pull off the combos, and hit the boss to the beat. I think the adaptive music was also a really nice choice here. Quite good.",
      "Really fantastic game! As said on stream I especially enjoy the combo system, and think there's a lot of room to grow here. The only thing is I wish there was a bit more of a challenge, particularly with a player health bar or something, as it didn't fully feel like there was a lot of pressure other than to get the highest score. I understand why you didn't go for this though, for the sake of the jam, and really enjoyed it nonetheless!",
      "An impressive rhythm game with great sound effects and pixel art animations. Great work on this one! Thank you for making it accessible for noobs like me. had a lot of fun during stream:https://www.youtube.com/watch?v=cSUIomK5BB046:27  (also thanks for dropping by!)",
      "This took a lot of time to master, but it payed of. But thats just me sucking at rythm. The concept is great and sure leaves a lot of room for growth. If for whatever reason you keep developing this idea, let us know, I see GOTY potential here!",
      "Started off by getting -370, then got 3250ish, then got 11870 (all on easy mode lol)! This game was super fun, probably one of my favourites that I've played so far! I had a bit of trouble with the combos at first, but once I got some practice it was all good, the combos were probably my favourite part! Great job :)",
      "",
      "Hey … so, I was just messing around on my stream. I jumped back in this is my real score. ð\u009f\u0098\u0089",
      "I love this one so much ! So many good things to say ! First, let's start with the basic, I am very bad at video games so the fact that I couldn't die here ? PERFECT because I was really bad, but the fantastic thing is that I still had so much fun. And that's what makes a great game to me (still having fun even if you are bad) You choose to make the point of the game the score not the \"staying alive\" and that's awesome. It was just so good, the juice, the readibility, the art, the music really well done and impressive !",
      "I am a fan of rhythm games and this game did not disappoint. It felt like a side-scrolling version of Crypt of the Necro Dancer. Although it took me a little while to get used to the controls, once I did, I found the game quite enjoyable. Well done.",
      "This is a really cool idea and implemented really well. Having style points instead of health is really neat and certainly increases replayability",
      "What an excellent concept built to fit this round so well. I'm glad you added the style points as it really drives the game and gives it so much replayability. Your game is actually so good, it made me play it again and realise that the attacks last a bit too long, which caused me to get hit sometimes even though I have already stepped out of the danger zone hahaha. Still a perfect 5 stars from me!",
      "oh my god, this game is amazing! I love how legit everything feels! it is so satisfying once you start stringing together combos and getting a lot of style points! I managed to get 2665 style points on normal and 9854 on hard!",
      "I've been stoked for this since you started dropping parts of it in the discord, and it did not disappoint.  I would love to play a full game of this.  I did have a hard time keeping track of how I was doing, though.  I wasn't sure if I could take damage or not.  It seems like the score is the main driving motivator?  I tend to not be very high score inspired, so I think player death risk or completing a combo deals massive damage would have been more motivating for me.  Still loved this game!",
      "8760!  Really unique idea combining rhythm based games and an platformer boss.  Not sure I've ever seen that.  But I love rhythm games and REALLY enjoyed this combination.  The one suggestion I have would be to 'teach' the combos a little more.  Watching Ghostbit on stream, I saw him struggle with it a little.  And on my first playthrough, I did a little, too.  But once I figured it out, the mechanic felt really good.  Was cool to see how to boss animation I saw you struggle with on stream end up.  It's just awesome.  Solid entry all around.",
      "Super fun concept! Controls felt great and the enemy and boss design were solid. Vaguely reminds me of Crypt of the Necrodancer. Great work!",
      "Very fun beat game. The boss and enemy spawns were fun to fight against along with the beat. Very well done."
    ],
    "comments_posted": 25,
    "created_at": "2023-03-14 23:28:37",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970272",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/unburntstudios",
      "member_since": "27 February 2021",
      "posts": "223",
      "topics": null,
      "followers": "8",
      "following": "2"
    }
  },
  "1970246": {
    "overal_rating": [
      "Score*",
      "2.586",
      "2.245",
      "2.976",
      "2.430",
      "2.245",
      "2.098"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.650",
      "2.300",
      "3.050",
      "2.490",
      "2.300",
      "2.150"
    ],
    "participant": "just-a-mooshroom",
    "game_title": "HONKER (unfinished)  - GDKO Round 3 2023",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 16,
    "comments_raw": [
      "I personally prefer hurling insults at my boss directly, but hey. Honk.",
      "Even in an unfinished state, I had a good time with this on stream. I like the idea and how you've been able to deliver unique experiences throughout GDKO.",
      "Unfortunate that you didn't get to finish, I can see the potential here! It was still fun to play and read all the HONKS. Nice work!",
      "goose ð\u009f\u0091\u008d",
      "HONK!",
      "10/10 honk",
      "what you got so far is pretty good, shame you couldnt finish it",
      "I like the starting place you have set up here! It is a shame you didn't have time to finish, because I would have loved to see how you took this further. I like the overall concept and the core gameplay still feels pretty fun, even though it's unfinished!",
      "Spamming insults reminded me of the Dont Strave characters instruments as speech! Congratulations for submitting! The only issue I noticed was when standing next to the walls your insults would be absorbed by them.",
      "I think your idea is really fun and unique. It's great that you decided to take an abstract approach to a boss fight, especially since most games in this round have traditional bosses. When you first mentioned this idea on Discord, I assumed it would take place in your trapped phone world. Given your sense of humor, I would have loved to see where you would have taken it.",
      "Unfortunate you couldnt finish your game, Still it was fun to play!!! Good job",
      "Pretty good game overall. The idea is pretty fun and while I'm sorry you weren't able to finish it it is still a pretty cool concept.",
      "This was a lot fun :)",
      "Too bad you couldn't finish it, I think it has a lot of potential. It was fun to play so the core loop is pretty good.",
      "For not being finished, your core loop is still there (minus the taking damage part).  The audio definitely helped make it feel like a boss fight.  Would be curious to see this if you had the chance to implement the rest of what you wanted.  And if you don't mind my asking, what app is it based off of?  I may have to check it out.",
      "I know it wasn't finished but the concept of using words as weapons was really interesting!  And the honk sounds were always fun haha"
    ],
    "comments_posted": 20,
    "created_at": "2023-03-14 21:53:39",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970246",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/just-a-mooshroom",
      "member_since": "31 August 2022",
      "posts": "165",
      "topics": null,
      "followers": "7",
      "following": "20"
    }
  },
  "1959597": {
    "overal_rating": [
      "Score*",
      "3.091",
      "3.500",
      "3.236",
      "2.864",
      "3.182",
      "3.545"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.091",
      "3.500",
      "3.236",
      "2.864",
      "3.182",
      "3.545"
    ],
    "participant": "game-dav",
    "game_title": "Heart Attack - GDKO 2023 - Round 3",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 16,
    "comments_raw": [
      "Had a great time with this on stream. Love the varied phases and attack patterns. Sure you know by now, but the W key only gave a little jump and the space bar gave the full jump. Great concept and well executed. Great work.",
      "Solid fight! Good variety of boss attacks and good balance of difficulty: not too easy but not too hard. Only points of feedback from me would mostly be quality of life, mainly with the jump. I couldn't do a full jump with the W key but could with spacebar, not sure if that was intentional or not but I think it should be made clearer how to do a full jump.",
      "pretty fun! loved the first and second bosses' attack patterns but i really liked the second phase of the first one an how it changed the platforming!",
      "great game! I streamed your game!",
      "Great sprites thematically placed, nice combination of shooting at the target while the environment is the one damaging you it was a nice cognitive shift when playing the game.",
      "Overall the aesthetic of this game is great, the sound aspect specially shines! Overall a solid entry and an great job done!",
      "This is super fun, and the music makes it quite calming which is nice. Love the different attacks! I never actually managed to complete it, but I got pretty close once, I think the boss had 5 health left. I kept getting hit by the attacks, I got a bit better at dodging with some practice. Great job!! :)",
      "Really fun. I liked the variance in attacks, which is one of the things I think makes for a good bossfight. A lot of the attacks also just looked pretty cool, like the one where the heart pieces come together in phase 2. I liked how the eye kept changing places so you had to track where to shoot him in the first phase, and I almost wish there was something like that kept for the second phase. Also, the W key doesn't really work as a jump key, I think that may be a bug.",
      "That was really fun to play!!! :D",
      "I think you should have specified that W and Space are two different jumps.  I was using W and found it impossible to dodge several attacks until I realized there was another jump height.  It was very fun though once I figured that out.",
      "Really fun! The attacks were nicely telegraphed and the movement felt smooth. The only issue I had was falling off of the bottom moving platforms respawns you where the old upper platforms used to be, which causes you to fall, usually right back into the stomach acid. The heart was much easier for me. Other than that, nice work!",
      "Really cool idea ! The different patterns are really fun and it was really challenging to have to aim while dodging, that was really smart !",
      "It was really awesome seeing you progress with this as the round went on!  You had a lot of little touches that really went a long way to make it a solid boss fight.  I'd maybe give the boss a little less health?  You had cool stages to the fight, but when I made a mistake and died having to start over started to feel repetitive.  That's also advice I realized I also have to give myself next time after how my entry this round turned out haha.  Good work!",
      "Was looking forward to this since getting to play test.  I like the changes since then.  The challenge level is good.  Indicators were good.  The bow on the heart was a little rough, though.  But all around, a cool concept.  Nice work.",
      "I like it a lot. The game is a lot of fun and provides a good challenge, maybe a little too difficult in the last half but it's still really good fun and it'll keep me coming back again for sure",
      "Challenging boss fight with a lot's of different patterns. Great entry!"
    ],
    "comments_posted": 10,
    "created_at": "2023-03-14 22:42:32",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1959597",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/game-dav",
      "member_since": "23 January 2021",
      "posts": "934",
      "topics": "19",
      "followers": "25",
      "following": "14"
    }
  },
  "1970400": {
    "overal_rating": [
      "Score*",
      "4.182",
      "3.236",
      "3.182",
      "2.773",
      "2.955",
      "3.091"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.182",
      "3.236",
      "3.182",
      "2.773",
      "2.955",
      "3.091"
    ],
    "participant": "bluegamemc",
    "game_title": "Late to Work",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 17,
    "comments_raw": [
      "Respect the choice for a limited Gameboy colour palette, not easy to express so much with so little colour and pixels, but you did! Lots of characters in this one, I always like breaking tables in games.",
      "You nailed the gameboy aesthetic! I love the beginning cutscene. The boss is pretty fun too, I like all the breakable stuff you can shoot at. 2 things though: The hitboxes were a little too big, and the limited colors made the bosses bullets a bit too hard to see sometimes.",
      "Had fun with this on stream. You killed me with the opening scene. Loved the twist. Great way to start out and the desk explosions were so satisfying and I also appreciated their utility for gameplay. Great stuff.",
      "Fun entry, I like the intro cutscene a lot, very funny but also relatable. Combat was simple but fun! My only complaint would be that the hitboxes felt a little big on the boss' projectiles; I felt like I was dodging them sometimes but they would still hit me.",
      "Great humor and use of a limited palette! Really enjoyed my time playing! Nice work!",
      "Really liked the humorous intro :D",
      "Love this game, had a great time playing it! I had a bit of trouble seeing the bullets, but because of the limited colour palette, I don't think you could have really done anything about that.",
      "Is there something you want to say to your boss bluegamemc ? xD",
      "now bob should show more respect",
      "funny intro and easy to control, loved the exploding desks",
      "I had a great time playing this quick little boss fight. The destructible desks really added to the fun. However, I found the text that appeared after beating the boss to be too fast and was unable to read all of it. Nonetheless, it was a great experience overall.",
      "10/10 Relatable",
      "nice game juicy gameplay! loved the art and the boss but my only feedback is that the bullets are hard to see and half of my deaths were due to bullets blending in with the background but i do understand since you were using a gameboy palette",
      "The sound and visuals worked great together.  Desk destruction 10/10.  I'd recommend maybe an arrow pointing to the boss if he's offscreen?  It felt easy to run away and lose track of him.",
      "I really liked the hilarious  conversation and the boss fight. And also, it's really useful to have low quality settings lol!",
      "I like the destruction of the desks, it looks so cool. I got to the second boss and it was a fair and fun fight",
      "This was a fun boss fight and I loved the GB graphics."
    ],
    "comments_posted": 2,
    "created_at": "2023-03-14 23:54:38",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970400",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bluegamemc",
      "member_since": "23 January 2022",
      "posts": "154",
      "topics": "7",
      "followers": "1",
      "following": null
    }
  },
  "1970337": {
    "overal_rating": [
      "Score*",
      "4.636",
      "4.343",
      "4.636",
      "4.440",
      "4.489",
      "4.099"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.750",
      "4.450",
      "4.750",
      "4.550",
      "4.600",
      "4.200"
    ],
    "participant": "jebouin",
    "game_title": "Lightspeed Hideout",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 19,
    "comments_raw": [
      "I spend ONE HOUR to bit the bosses in a Normal mode, I can not imagine how to bit in Expert Mode, Well Done! For me this game is in TOP-3 for sure",
      "this game is amazing! i love all the bosses and after I beat the game on normal I tried hard mode and then somehow killed all the bosses first try lol and then only to die to the FRIGGIN PLATFORMING SECTION RIGHT AT THE END lol",
      "Had to come back and post my own hard mode victory after seeing Endmark's. Seriously well done, I've got a short attention span and not many games will get me to come back like this one did!",
      "Done!",
      "Everything here is so well made. The UI is good, the transitions look awesome, and the color changing you unlock is a nice touch. The pixel art is also fantastic. I think this is definitely taking top spot.  Just awesome.",
      "Another fantastic entry! I don't know how but you release incredible game after incredible game, just super polished all-around and lots of dynamic mechanics.",
      "Glad you had an infinite life mode, I'm not the best at boss fights so I enjoyed just having the chance to explore the mechanics. The art was incredible as always! :)",
      "Solid gameplay, a nice boss battle with a lot of twists. Amazing level of polish, as in all your games they are next level and stand out. what really surprise me were the twists as well as the endless lives option for people who just wanted to see what the game offered, get having the options for normal or hard unlocking the extra stuff. I'm not quite sure what impressed me more: the two asteroids Taking part of the level with them, the black hole (how did you make this actually it looked pixel art but that transition was wow! A shader?) but also the Tetris battle was really nice.",
      "As always, I am in awe of your skills.  This is a fantastic entry.",
      "Amazing job, nothing else to say. Take all my stars.",
      "Incredible! Super juicy and wonderfully polished! Loved the bonus for beating the game on higher difficulties. Amazing work!",
      "Very impressive and well done, simple mechanics and a very engaging boss fight!",
      "my lord.... i am speechless.... such a good game, the game design... the difficulty... 5/5 stars! oh BTW i stream your game! i posted it on itch! check it out",
      "For anyone getting the game crashed/freezed, allow the page to store cookies and then reload:",
      "Sadly, the game keeps crashing for me. I tried both Firefox and Chrome.",
      "Very well done game, it was a lot of fun, I had to quit for now on the hardest difficulty, but I will try again once I'm done playing and rating all the other games.",
      "I am astonished by how good this all is. Loved everything about it!",
      "it keeps freezing for me :(",
      "An incredibly detailed and impressive entry as always!  Blown away by the variety of the different stages."
    ],
    "comments_posted": 7,
    "created_at": "2023-03-14 23:59:12",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970337",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jebouin",
      "member_since": "20 December 2013",
      "posts": "116",
      "topics": null,
      "followers": "138",
      "following": "22"
    }
  },
  "1956327": {
    "overal_rating": [
      "Score*",
      "4.800",
      "4.200",
      "4.112",
      "3.960",
      "4.160",
      "3.440"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.800",
      "4.200",
      "4.112",
      "3.960",
      "4.160",
      "3.440"
    ],
    "participant": "puree-adventure",
    "game_title": "Max Fight The System",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 19,
    "comments_raw": [
      "Tremendous ð\u009f¤\u009d",
      "All around *****.Love it. Love the mixed mediums for the art style. Love the overarching storyline and juxtaposition of nature and natural textures against machinery. I chuckled at the boss not wanting to be recycled.I had a great time on stream with this, even if the last puzzle stumped me for a bit. Maybe with more time you could consider including a hint system instead of putting it in the itch page text. But that's a small gripe.",
      "Wonderful art and animations! Very unique presentation and great music. I had to use the hint for the last puzzle, but I really enjoyed my time playing! Great work!",
      "I love your unique art style, and creative take on a boss fight! The puzzles were really fun and challenging, but not too much, you found a good balance. The only thing that caught me up at first was I didn't know I could move the metal pieces until I read the description below. Overall, I very much enjoyed it!",
      "The art style was so great and unique! The puzzles were a good level of difficulty for me and they were super fun. Great job :)",
      "Really like this puzzle game as most people comment the art style is indeed unique, great usage of the little wobbly lines on the edges. A solid system! I was especially appreciative about the shapes the initial puzzle had and how you had to put flowers in between this was a genius mechanic reinforcing the narrative. Fantastic work, love the little story!",
      "The artstyle, if you plan on doing something similar in the future I'll buy it",
      "Your puzzles are very enjoyable and keep me engaged. The art styles used in the game are interesting and pleasing.",
      "The collage artstyle really sets this apart from other entries. Also, the puzzle mechanics are fun and work pretty well. Only thing I'd change is pointing out that you click on the pieces to rotate them.",
      "Love your art style and your unique take on a boss fight. As a seasoned puzzle game player and designer, I found the puzzles to be more tedious than challenging, but I feel that with a bit more intentional puzzle design, this game has a lot of potential.",
      "Nice to see a puzzle game after playing all these boss fights! As others have pointed out I also had trouble distinguishing the pieces from the background since they both had the same amount of noise and similar colors. The difficulty felt right to me, I didn't use the hint though I had to remove every piece from the last puzzle to find a solution so maybe I just got lucky haha",
      "this game was great! loved each of the puzzles but had a tough time with the last one but i am so glad you left a hint for it in the description lol",
      "Oh my. I love this one! The art style and humour and writing is amazing! The puzzles were fun and engaging to figure out, Professor Layton-esque. The art and story elements combined remind me a little of Broken Age too, which is great! amazing job!",
      "The boss gives you brain damage lol. One suggestion would be that the puzzle pieces sometimes blend in with the background and were difficult to see. Other than that the art, music, puzzles and story are perfect. I liked it a lot <3",
      "I managed to complete the game. The last one was tough but it's a lot of fun and I like the artwork and story, whole game feels really polished",
      "Really fun take on a boss fight!  Liked the puzzles.  My main comments would be that maybe some effects or sounds in the puzzle portion to give more of a fight feel could be nice",
      "This is great!",
      "Haven't play Professor Layton yet, but if it's like this, I may have to pick it up.  Unique gameplay.  Felt a little more puzzlish than it did boss-ish, but I could see story-wise how that may be common in that style of game.  Really liked the music.   A good entry.",
      "Fun puzzle game with a great story. Excellent job."
    ],
    "comments_posted": 11,
    "created_at": "2023-03-14 21:11:58",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1956327",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/puree-adventure",
      "member_since": "10 May 2021",
      "posts": "242",
      "topics": null,
      "followers": "128",
      "following": "37"
    }
  },
  "1969851": {
    "overal_rating": [
      "Score*",
      "4.343",
      "3.855",
      "4.294",
      "4.089",
      "4.196",
      "3.757"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.450",
      "3.950",
      "4.400",
      "4.190",
      "4.300",
      "3.850"
    ],
    "participant": "endmarkgames",
    "game_title": "Mops and Bot",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 15,
    "comments_raw": [
      "there is just so much content here.  So much character, big fan of this one",
      "Great entry as always! The variety of attacks were awesome and they fit together perfectly. It's great to see a cuphead inspiration in action.",
      "There's a massive amount of polish here. So many effects! I love the plethora of different attacks Curt has. I found it pretty hard, but I'm glad you included an \"assist mode.\" I think it would feel more fair if the lasers were more widely spaced out, as some of the gaps you had to squeeze through to fit in the laser areas were pretty small, and when combined with the other attacks, like the bullet wall, and the dropper guy, it could sometimes be unavoidable to take damage. I still really liked it though.",
      "Amazing amount of polish and development for only two weeks! The patterns, controls, sound design, animation. It was all really well done! Incredible work! (Thank you for the easy mode, I needed it.)",
      "Had a great time playing this, and was pretty glad there was an easy mode lol. Love the pixel art!! :)",
      "Great seeing your pixel art improved to such scale! the effects were blowing up the boss had such a great retro feel. took me awhile to notice the â\u0080\u009ceasy modeâ\u0080\u009d by changing the weapons and armaments. I had watched the trailer before this so I was prepared hehe.",
      "Another top notch entry, Endmark.  Everything looked good, felt good, sounded good.  The level of polish you have on there is fantastic.  I'm always impressed by how much you can do in just 2 weeks.  (Plus your willingness to share and help others.  Really appreciate all your advice, btw!)",
      "After playing and dyeing 4-5 times, it became easier to understand the mechanics and control the character. As always I am impressed by the design and boss attack pattern! great entry!",
      "I must say, I am impressed with the level of polish in your game. The menus, pop-ups, screen transitions, and all the other details come together really well, giving the game a great look and feel. I always find myself envious of your ability to make everything look so polished. I usually end up adding these elements last minute when I have some extra time. Can you share your secret?",
      "That was a really, really well put together boss fight.  Really hard though!  Ended up abusing infinite shields to get to the end haha.  This is kinda nitpicky but I'd almost telegraph the lasers a little later?  Maybe that's just my instinct to dodge immediately when I see the line about to start",
      "A really great game and I like how you can set your own difficulty with what you choose to equip",
      "awesome entry! love all the unique attacks but never managed to make it past the second faze lol. my only problem was it was a bit hard to tell how much health i had because there were a lot of icons and there was not that much feedback when you got hit, half the time I thought i was playing great and then would just die lolalso i got the rare bug lol , otherwise great submission!",
      "Lot's of fun. Difficult but that's what it says on the box :)",
      "Fun boss fight with a lot of dodging going on. High marks all around.",
      "Real nice submission! I like the humour and name changing and concept! I wish you could dash through things to not take damage but then maybe that would make the game too easy. Wonderfully finished off with brilliant details all the way through"
    ],
    "comments_posted": 30,
    "created_at": "2023-03-14 22:53:27",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1969851",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/endmarkgames",
      "member_since": "09 July 2020",
      "posts": "768",
      "topics": "2",
      "followers": "30",
      "following": "17"
    }
  },
  "1969102": {
    "overal_rating": [
      "Score*",
      "4.476",
      "3.571",
      "3.190",
      "3.714",
      "3.095",
      "3.381"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.476",
      "3.571",
      "3.190",
      "3.714",
      "3.095",
      "3.381"
    ],
    "participant": "h4zm4tt",
    "game_title": "My Last 3 Brain Cells",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 18,
    "comments_raw": [
      "The fluidity here was awesome. I really like how satisfying it felt to glide on the rails and bounce off the springs. I think this boss was really fun to fight. Good job!",
      "Great time on stream with this one. Left most of my feedback there. It was an action-packed and fluid boss fight. I liked the build up to it and the option to skip straight to the fight for people returning. I would lock the reticle to a set distance from the player character when using a mouse like you do with the gamepad, and maybe reconsider some of the button mapping, but overall, great entry!",
      "Really nice entry! The movement sliding along each bar felt very cool and intense. I also like the addition of the deflection shield, that adds another layer of gameplay that adds to the overall experience quite a bit.",
      "Great to see you expanding the game universe!",
      "This was a lot of fun!  It was an awful lot all at once though.  Took some time to get used to just the movement and shooting.  To have the lava, blades, and the switching mechanic all at the start was a bit much.  As a suggestion, maybe have \"phases\" for the boss fights and introduce new elements as the health goes down?  Just my opinion, of course.  Audio and visuals were spot on as usual.  And I love that Red is using Blue as the gun.  Nice job.",
      "Very well done, I especially liked the way it almost felt like a rhythm game with all the sound effects harmoniously synchronized.",
      "Dang its so cool to see the progress from round one! there's so much polish and nice touches like the cutscene in the beginning and the music syncing with the sound effects. plus all the art is on point and the gameplay is great while a little but confusing at the start.",
      "Loved the cut scenes ! And the sounds being in sync with the music, that's really cool ! Like a few people already said, it was a lot to get used to and I didn't really know what was happening at first x) Maybe you could add a little item somewhere that indicate what the boss is going to do next ? gravity or shooting. Also the player is moving to fast, even in slowmo I could never see where I was going and ended up in the lava at every jump (but I am not really good at video game in general so maybe it's just me x)) But at the end even if it was really challenging it was still really fun ! And I love that you are working on the same game since the begining ! Can't wait to see what is going to happen next ! Good job !",
      "Nice to see how you progress each round! :) Good job",
      "Challenging fight! But I got hold of it after a few tries. And the cutscene was great too!",
      "Really good boss but pretty challenging though. theres a lot to manage all at once from the very beginning.",
      "Really love how the gameplay is synced to the music. The health bars are pretty well balanced in that both the boss and I were around the same health throughout.  As a suggestion, I think it might be helpful to introduce new mechanics (such as sawblades, bullets, and the gravity switch) one by one to prevent overwhelming the player at the start. A great boss fight overall!",
      "Really fun cutscene that sets up the boss encounter nicely. I had no difficulties beating it on my first play though and enjoyed a second run after I actually read the description and found out there was a deflector shield, which was super useful. The little floor saws hit me more times than the boss, but I supposed that's just a skill issue on my part. Great work!",
      "Wow, a tough boss battle, but was very fun. I forgot about the shield the first few deaths, I definitely needed that to win. I had to get moderately good at all the abilities.",
      "I realized I missed clarifying in the details, but shooting happens in time to music so it works a lot better if you hold left mouse button!  Same goes for the deflector shield.  Hold it down in short bursts.  It's clearly a lot harder than I expected, but this should help!",
      "The story is a really nice way to build up to the boss battle and the movement of the player is really good too. It's also super cool that your character has a gun",
      "I couldn't beat it (but that's not a problem as I gave up too easily haha). I really love the storytelling and effects of the guys transformation! Unique idea for a level too! Was impossible to dodge his super fast attacks for me, but over all a really good submission!",
      "really nice! the boss concept is awesome and executed pretty well! but i did not manage to beat it sadly i tried it like 30 times but it is just really hard! I like that you added controller support because that made the game easier but still really hard lol (bet endmark can beat this in under 3 tries though)"
    ],
    "comments_posted": 27,
    "created_at": "2023-03-14 03:50:31",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1969102",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "224",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "1969289": {
    "overal_rating": [
      "Score*",
      "4.609",
      "3.870",
      "4.304",
      "4.435",
      "4.226",
      "3.913"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.609",
      "3.870",
      "4.304",
      "4.435",
      "4.226",
      "3.913"
    ],
    "participant": "nutt3d",
    "game_title": "Shotgun Exorcist",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 23,
    "comments_received": 20,
    "comments_raw": [
      "THESE PIXEL CHEEKS HAVE BURNED MY EYES.",
      "I really like the boss animation. And the attack patterns are also great. One time the boss got struck in the black zone and returned back within a few seconds. But that was not a major problem anyways. I liked the cutscene and the artstyle a lot :)",
      "Had a bit of trouble with the shooting controls as a trackpad user, but I loved the game! The art style is great as usual, and I loved the little storyline at the beginning! Would like to see this as a full game one day!!",
      "I love it! The opening cutscene is awesome. I really liked the way you did the tutorial as well. As for the gameplay itself, the shooting and moving feel quite satisfying. The bosses attacks were well telegraphed and fun to dodge. I think a dodge roll would be nice though.",
      "Superb booty bounce on the left and right movement. That's all it takes for five stars from me!",
      "As others have said, very awesome opening cutscene! I never played Binding of Isaac but I definitely got that vibe from the intro and artstyle as well. The bossfight itself was very fun, shooting felt extremely satisfying! I think my only point of feedback is that a lot of the attacks felt like they shouldn't have been hitting me, but must have been just at the tail-end. I also wish I could have moved under the boss when he jumps up while chasing me. Those small points aside though, I still thoroughly enjoyed it, well done!",
      "No kidding about pixel butts!As people have mentioned, amazing Binding of Isaac vibes, fantastic pixel art and that intro was genius! off to go subscribe to your stuff!",
      "That opening scene really got me ready explore the depths of her basement ready to kill ghosts. Definitely has some strong Binding of Isaacs vibes with the art style.",
      "Jesus this game was amazing! The opening cutscene was very well made and The art in general was so good! plus the gameplay was insanely good and the shotgun felt super good with all the effects.",
      "I loved the art and the cutscene at the beginning was really cool. For some reason I thought I needed to aim before each shot and it took me a while to realize I could just hold the button and deal a lot more damage. After figuring this out I had fun beating the game, nice work!",
      "I told this last time and I am telling this now, this is TOP 1 for me.",
      "Your character is awesome and I love the whole presentation of the game and it plays really nicely",
      "Amazing visuals as always, would really love to see this as a full game. Got hyped seeing the thumbnail and here's hoping it will one day be realised! 5 stars from me!",
      "Well done!",
      "Visually this game is beautiful, amazing work. The boss itself is also really well done, good job!",
      "Loved the artwork and story. Great game all around, would love to see more!",
      "Definitely love the BoI style.  Also had issues with the bouncing when too close.  But that aside, no complaints.  Very good entry.  Nice work!",
      "That cutscene is one of the greatest things I have experienced in all of GDKO 2023.  Excellent boss fight, too!  Icy mentioned this, too, but there seemed to be times I was stuck getting bounced on multiple times if let him get too close, but it still felt like a fair fight!",
      "LOVE the art style!!!! BOI is a great inspiration. I found it difficult to get away from the bouncing towards me attacks, I wish there was a dash. and not too big a fan of the standing still while shooting, although I can see that being necessary to add the challenge! Overall amazing job! So clean and precise gameplay.",
      "that was great! it felt like biding of Issac and i love the art style! the boss attacks were fun to learn and dodge as well! but after i died the first time and knew what to do it was really easy to kill them"
    ],
    "comments_posted": 28,
    "created_at": "2023-03-14 08:44:55",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1969289",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nutt3d",
      "member_since": "07 August 2022",
      "posts": "606",
      "topics": null,
      "followers": "51",
      "following": "3"
    }
  },
  "1970170": {
    "overal_rating": [
      "Score*",
      "3.080",
      "3.120",
      "2.680",
      "3.104",
      "3.200",
      "3.440"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.080",
      "3.120",
      "2.680",
      "3.104",
      "3.200",
      "3.440"
    ],
    "participant": "rsdnrs",
    "game_title": "Split",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 15,
    "comments_raw": [
      "This dubious creature has led me to danger and then got me to commit murder. 10/10",
      "This was amazing! Really love the improvements you made to the game.",
      "Love how you brought back some of the previous mechanics, so I felt prepared for the boss. I said this on stream, but I think it was really smart to include another character instead of just giving hell kitten extra abilities. Made for a fun dynamic. Great pixel art and a great entry.",
      "love it!!! the boss design was amazing and i loved the kitten swapping but why did you have to do that with the story T_T",
      "The idea is very cool, having two characters to swap between! I liked the story behind it too, and your tutorial area was very well done and helpful. The boss fight itself was a little hard to get the hang of at first, but once I noticed the monitors behind the boss told me what attack was coming it made a lot more sense!",
      "Really enjoyed this, and the concept was really cool like others have said, of the two characters! Love the pixel art and animations as well! :)",
      "Great to see you carrying out where last round left off, sorry you had to watch the crazy camera movements on stream (but thank you for dropping by!) You saw when I had some issues but thank you for the hints :D",
      "Having the two characters with different uses for the abilities was pretty cool.  Voice acting and story was good.  I would recommend being more consistent across the board when you can.  Parts of the pixel art felt drawn (boss), but others (like the cats) felt more \"intentionally placed\".  In the tutorial, we were given the abilities, but it seemed like in the boss fight we could jump WAY higher and run faster.  A little consistency would make it feel just a little...tighter?  Not really sure the right word there.  Loved your music choice.  That guitar version of JT's Cry Me A River at the end was really nice!  Nice job.",
      "This was a pretty cool game! The voice acting and story were really good and The idea of switching between the cats and using the different abilities was cool",
      "I think this game is really well done in certain aspects but is a bit lacking in others. The TV screens in the back of the fight, for example, are really well done. Also, most of the art is really good with a nice color pallete. Especially all the backgrounds. However, there's a lot of inconsistent pixel scaling.  I also liked the bosses meat boy-ish design, however he didn't really fit into the artstyle of the other sprites. I liked the story & voice acting and the ending was quite sad. As for the gameplay, the controls are kind of janky, and the animations don't always play properly. The hand's hitboxes are also a little too big. Overall, good game, but still needs a bit of polishing in some areas.",
      "Really loved the background showing the attack telegraphs! Also really story and voice acting! Great job!",
      "such an emotional story! Great idea with the two characters! I thought the attacks weren't telegraphed at first then I payed attention to the background lol.",
      "It's really cool controlling both of the cats to fight and run from the boss and the story and tutorial is nicely done",
      "I really liked having two characters!  The music gave it a really intense feel, too.  A few thoughts, it seemed like the black cat could outpace the camera, and it was still possible to switch during the fight and lose control of the on screen character.  Wasn't hard to just not do that but I tried it once out of curiosity and got a little lost.",
      "Wow, another great chapter of this story. I feel like I can try to get a less sad ending, so I'll be back when I'm done playing and rating games."
    ],
    "comments_posted": 22,
    "created_at": "2023-03-14 22:30:44",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970170",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rsdnrs",
      "member_since": "04 October 2021",
      "posts": "91",
      "topics": null,
      "followers": "2",
      "following": "3"
    }
  },
  "1968357": {
    "overal_rating": [
      "Score*",
      "3.220",
      "3.611",
      "3.123",
      "3.494",
      "3.806",
      "3.708"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.300",
      "3.700",
      "3.200",
      "3.580",
      "3.900",
      "3.800"
    ],
    "participant": "ghostbitstudios",
    "game_title": "SweetLand Boss Rush",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 19,
    "comments_raw": [
      "Well done making a card game for the jam! There's a lot of work behind the scenes for something like that so it's a great feat. I think there were a number of balance issues though, namely being able to infinitely heal up, and the healing value being the same as blocking value for block cards, I never saw a point in using block cards at all. I do like the system you have in place for discarding cards for more energy though, and as always, your art is superb!",
      "Making a card game is crazy! This was a blast to play and strategize through. I really enjoyed all the art and animations as well! Great work!",
      "Got to play a bit of it during the stream, thanks for the Beekeeper hosting! Really enjoyed the second phase of the bosses. They can be very unforgiving.",
      "That is the most well balanced game I have seen so far)) Picking random cards will never guarantee a win)",
      "Boss art was boss. Super impressed with where you took this from earlier rounds. Nice to see more fully realized card mechanics.",
      "I liked the art. I think the bosses felt more or less the same, as they just dealt damage and not much else. Its pretty clear the focus was put more on what the player can do. However, I found the card mechanics quite fun to play with, and the variance in cards helps add to that. I think if you want to continue this, my advice would be to make the player be able to save cards across turns, so you could do things like save good cards for another turn, and also have enemies interact with the cards (ex. poison apple guy poisoning some of your cards so they cost health to use) which I think could help expand the system even further. But still, the game is awesome! Great job.",
      "Good job implementing this! I've tried and coding a card game like yours before and I understand how much of a challenge it is, so I am very glad you managed to pull it off. I would love to see you expand on this by adding in more synergistic and interesting cards and attacks.",
      "Such a great improvement from Round 2, the controls feel much smoother! Had a great time playing this, to be honest, I wish it went on for longer lol. This may have just been a me thing but if I held down on enter for a tiny bit too long when attacking then it automatically entered in the bar thing. didn't hugely affect my gameplay though. Really enjoyed playing this, and looking forward to seeing how this game progresses in the future!",
      "Really fun boss battles and especially liking the summons. The card system is set up really nicely, easy to understand and I like how you have to juggle defence and attacks. There is one little thing I did notice, the shield doesn't always recover 4 points when the player's shield is 0 after a boss has done 6 or 8 damage to it. Overall it's really good!",
      "Played before and after the update, really helped the balancing. overall great game!",
      "I must say, this was one of the more engaging games for me in GDKO so far. As a fan of card games, I found it quite interesting. It was impressive to see that you implemented two things in your game that I cut out from mine. When you mentioned having summons of other players' characters, I felt a bit jealous. I really wanted to incorporate fun cards that represented other games from GDKO as well, but unfortunately, I ran out of time.",
      "I know you weren't really happy with the card mechanic in the previous round.  But man, you have done awesome with this!  Not typically a card game player, but between you and Loten I might have to try a few more of them.  Would like to see a few more variety of cards in there.  But I thought the summons from other GDKO games was an awesome touch.  All around, great work.  Really proud of how much work you've put!",
      "Great card mechanics in this game. The boss battles were fun and felt intense. And the story was great as well.",
      "Love the implementation (I want to make my own deck building game at some point so this is right up my street) Horrific sounds as I've said before (in a good way haha). A bit too easy and repetitive to win, just discard all cards except healing and shields, then use a big hitter summon when you have enough energy. Great game and art! good job!",
      "I love card deck games and this one is amazing! i loved trying to keep my health and points high enough to survive. Nice job!",
      "This turned out great!  The art, music, and gameplay all worked together super well.  Almost made me forget I was rating an entry and just had fun playing a great game!",
      "great update to the combat from the last round! loved the attacks and summons from gdko 2022 and loved how I had to play strategically to be able to live through attacks and have enough spell points (?) for next turn :D",
      "A lot of summons weren't working with bosses, ended up dying. I'll check back when it's fixed! ;)",
      "Some very good stuff. So fun."
    ],
    "comments_posted": 8,
    "created_at": "2023-03-13 16:14:59",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1968357",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ghostbitstudios",
      "member_since": "30 June 2019",
      "posts": "721",
      "topics": "13",
      "followers": "44",
      "following": "48"
    }
  },
  "1970407": {
    "overal_rating": [
      "Score*",
      "3.292",
      "3.600",
      "3.086",
      "3.024",
      "2.623",
      "2.520"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.556",
      "3.889",
      "3.333",
      "3.267",
      "2.833",
      "2.722"
    ],
    "participant": "kingjaw",
    "game_title": "The Artificer",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 13,
    "comments_raw": [
      "Your art is incredible. I just love it. There were so many great things about the game, but I really liked the attention and care in the dialogue scenes. The character popping up and having a more detailed portrait was so nice. I left feedback throughout my play on stream. I only really have one nitpick, and it's more about preference for controls. I just suck at games when I have to use arrow keys for movement and my left hand for actions. I think adding a WASD for movement and right side of the keyboards for actions would be appreciated by folks like me. Outside of that, such an epic series of fights with unique and interesting bosses along the way. One of the top entries.",
      "The beginning platforming felt really good! Really enjoyed the speed of the game at that point. The boss at the end was pretty frustrating though. Not being able to see the projectiles made it feel like it was just random luck if you survived or not. Other than that, I really enjoyed it. Nice work!",
      "The art and music looks cool. I was always on the verge of going insane. But the checkpoints saved me HA HA!",
      "Really fun mechanics, I managed to fully beat it after a lot of attempts! Funnily enough, I think the dash would feel better if it was a shorter distance, as that would give a little more control over the movement of it. As others have mentioned too, the last fight is especially tough because you can't see the projectiles coming right away until it's sometimes too late. The overall feel of the game though is fantastic, and that's what is most important! Moving, attacking, etc. all feel great!",
      "Tried this on stream very nice art, great to see the clock towers! (but it lagged too much for me.)",
      "I had a lot of fun with the runner phase, but once i got to the boss fight, despite trying a lot i couldn't make it. But overall I had fun playing it so good job there!",
      "I really like the pixel art style and color palette for this game. I would love for some controller support, as Iâ\u0080\u0099m terrible with keyboard controls for a platformer. Overall great entry for this round.",
      "Platforming is amazing, but the controls are horrifically janky (but idk that might just be me)",
      "Art was great!  Movement was great!  Fire rate felt a little slow but that's kind of a personal preference more than anything haha.  Solid entry!",
      "This was a fun game, very challenging at the end where I think I only made it through by luck.",
      "This was a lot of fun!  Felt really cohesive.  Did find a pretty big bug.  On the 2nd platforming phase (the bat), you could go to the left at the beginning, fall off, and just go to the right indefinitely to pass it.  Might need a death pit there to stop people like me.  Mwahaha!  Seriously though, really great entry all around on this.  Would love to see you continue this (even outside of GDKO).  Nice job!",
      "I can't seem to run the game :( must be a problem with my browser :/",
      "Really like this game, it's a lot of fun. I also managed to get to the end which was quite a challenge particularly towards the end. I appreciate the checkpoints, it helped a lot. Your boss is awesome!"
    ],
    "comments_posted": 27,
    "created_at": "2023-03-15 00:30:31",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970407",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/kingjaw",
      "member_since": "14 August 2020",
      "posts": "441",
      "topics": "4",
      "followers": "39",
      "following": "4"
    }
  },
  "1946378": {
    "overal_rating": [
      "Score*",
      "3.727",
      "3.955",
      "4.000",
      "3.955",
      "4.136",
      "3.955"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.727",
      "3.955",
      "4.000",
      "3.955",
      "4.136",
      "3.955"
    ],
    "participant": "brainfartstudio",
    "game_title": "Thoraxis",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 19,
    "comments_raw": [
      "Brilliant entry! Vampire survivors meets boss fight! I'd love to see more from this, new weapons and other goodies to really add to that game feel!",
      "That was fun, I liked how intense it can get after a few rounds! Unfortunately the game also froze for me after maybe 20 or 30 rounds (I kept choosing the fire rate increase bonus).",
      "Game was not free from bugs ð\u009f\u0091\u008e",
      "I really liked this one. I always love games that let me change my stats, I put everything into movement speed until it was uncontrollable.",
      "I really liked this one. I always love games that let me change my stats, I put everything into movement speed until it was uncontrollable.",
      "Great work, Mitchell! All your planning paid off and this was a really robust entry. I left feedback on stream, but I'm sure it's all things you've thought of before (more boosts/punishments would be nice, another movement option could be cool). Great work.",
      "This is a really nice vampire survivor-esque game. The art looks good for the most part, other than the ui, and even though there is really heavy pixel scaling here I'll give it a pass since it doesn't really detract too much from the look of the game. As for the gameplay, I liked how you not only choose your power-ups but also your power-downs. It adds a lot of depth to the builds you can make. The bosses themselves are all unique. I like that they all have their own music themes. One small nitpick though, when you have a ton of the spread shot upgrade, it fires to the right of your mouse cursor and isn't centered. Really good entry though.",
      "Wooo. New boss in town!!",
      "Really solid all-around! I like what you have so far with the upgrade/debuff system and think it has a lot of room to grow. The bosses themselves also each feel unique but not so staggeringly different that it's disorienting, which is a great balance.",
      "A great boss fight with upgrade/penalty elements! of course I would wish the character would move to the direction of the cursor but still really enjoyed the muzzle flash nice idea with the minions I would have thought the big pixelized bosses would bother me but that was not the case. the background really adds a lot to the whole atmosphere great work!",
      "I was very proud of my 4625 points until I saw the comments and I got demolished by everyone. It would be great to have a scoreboard just with GDKO submitters and make a friendly competition. Sometimes the music glitches and stops (My theory is that it happens when I get hit when the music is about to start but IDK), but for the most part this is a perfect entry and totally replayable. I definetely will come back and improve that score.",
      "Great animation of bosses and design looks pretty pretty hehe, Good job!!!",
      "My final score was 8345, not sure if that is good or not. I really enjoyed playing this, and I loved the duality of upgrades and penalties,  making you think a lot before picking. Sometimes the music randomly stopped, but for me it was mainly bug free!",
      "",
      "The variety of bosses and the upgrades makes it engaging and fun. The music and artwork were also great. Awesome game <3",
      "Fantastic game, the different bosses were great and I like all of the extra enemies to deal with. Having to choose the upgrades and penalties is really clever and I like it all very much",
      "Cool boss fights and great artwork and sound. The upgrades and downgrades helped keep hooked.",
      "Really fun! I love me some infinite scaling endless game modes! The bosses felt balanced and the mini map is a great addition! When all the penalties start to add up, it gets incredibly hectic! Great work!",
      "This game really captured the rogue-like magic in really good ways.  First round I thought \"oh this is really easy\" but soon I found myself strategizing on which powerups to get and getting really intense with it.  Also excellent use of music and minimap."
    ],
    "comments_posted": 27,
    "created_at": "2023-03-13 06:33:09",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1946378",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "306",
      "topics": "2",
      "followers": "35",
      "following": "26"
    }
  },
  "1970125": {
    "overal_rating": [
      "Score*",
      "4.286",
      "4.190",
      "3.857",
      "3.476",
      "3.943",
      "3.905"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.286",
      "4.190",
      "3.857",
      "3.476",
      "3.943",
      "3.905"
    ],
    "participant": "lio-lim",
    "game_title": "Usurp",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 14,
    "comments_raw": [
      "This game made me feel emotions",
      "HOW DID YOU MAKE THAT IN ONE DAY?? Beautiful game as always, art style is great, and the atmosphere is very nice. I wish there was more of an indication of the boss's health though. The attacks patterns were very unique, I quite liked them all!",
      "I played on stream and I'm really impressed by what you put together in such a crunch. You nailed the vibe and all the attack patterns felt fair. Maybe a little quick on the vertical attacks, but there was plenty of health for the player. I'm not sure I could have beaten it without remapping inputs to a gamepad though. Great work.Argh, darn you, Keltfire! I will have to return to try and beat your time!",
      "Mechanics felt awesome, and as always your art style is absolutely gorgeous! My first attempt I beat the boss in 2 minutes but that didn't feel good enough, so I tried again and managed to beat him in 1:34! Lots of really nice touches with polish, including being invincible during the dash, walking over the boss doesn't damage you just his attacks, etc. All around very impressive!",
      "Congratulations on submitting!",
      "Took me sometime to figure out how to start the boss fight.  Kept looking for something to interact with.  Had to come back here and read ICY's post before finding the link.  But I got it!",
      "ONE DAY ? That is way to good for one day ! Love it, you did the pause to indicate what the next attack was going to be and you did the big juice when we hit the boss, that felt so good ! Really great job, this is probably my favorite !",
      "Adorable design",
      "Really impressive for just one day! Boss telegraphs are fair and the different attacks look and sound wonderful. Great work!",
      "Great boss fight, very unique feeling with the artwork, music, and sounds.",
      "I managed to get half the life off the boss and it was a really fun experience with awesome movement and attacks. I think making the prove yourself button flash would help with starting the game and adding pressing enter or space too. Really great visuals and gameplay and that you made it in one day is incredible",
      "Great boss! very impressive for only a day",
      "Art style is great!  Also really good job making a fight that's tough but fair.  The attack telegraphs are all super smooth.  Controls are taking me a little time to adjust to, but they seem pretty standard for a lot of games in GDKO.  Excellent job!",
      "Art style is AMAZING! I wish I did this sort of style for my game. Just before I carry on with rating and playing... How do I start  the boss fight? haha"
    ],
    "comments_posted": 14,
    "created_at": "2023-03-14 20:34:52",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1970125",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "345",
      "following": "28"
    }
  },
  "1877910": {
    "overal_rating": [
      "Score*",
      "4.364",
      "3.727",
      "4.227",
      "4.045",
      "3.864",
      "4.045"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.364",
      "3.727",
      "4.227",
      "4.045",
      "3.864",
      "4.045"
    ],
    "participant": "spacespy",
    "game_title": "Veggie Boy Vs Meat Man",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 20,
    "comments_raw": [
      "This is insanely polished",
      "really fun! i played it like 50 times but only managed to get a b lol, my only feedback is to show indicators for when things are going to happen, like a small \"!\" shows up a second before he slams down and a small signal that tells you when he was going to stop flashing in the phase you can attack him because half the time i would jump on him 1 second after he stopped flashing lol. but other than that great entry!",
      "I got an S! simple, fun and polished, very well done! I like how the boss changes movement after being hit each time, keeps me on my toes.",
      "The game feels great to play! The sound, animations and UI animations are all top notch! Reminded me of fighting Bowser, just bop him on the head. Simple and effective. Great work!",
      "Veggie boy best boy! thanks for dropping by the stream it was great fun unlocking invincibility mode just for noob-old-me hehe",
      "The art here is just all around awesome. The phase changing animations are really good. I think more telegraphing on the boss would be nice, because he kind of just slams down unexpectedly, which didn't feel too fair. Other than that, the mechanics and platforming were really good. So overall, awesome game.",
      "Love this entry, this concept and character. I hope thereâ\u0080\u0099s more to come. And I want more boss fights! Iâ\u0080\u0099m sad you didnâ\u0080\u0099t add a + to my S, but I wonâ\u0080\u0099t hold that against you in the judging!",
      "This was super fun, loved seeing the difference from round 1!! The animations were great, personally I felt like the fast colour-changing background was a bit hard to look at but it wasn't a big deal. Loved the gameplay, great job! Didn't manage to get S rank unfortunately, barely survived it LOL",
      "Yeah, veggie Booooyyyyyyyyy.",
      "Such an awesome game! the art and effects were spectacular, especially that effect for changing phases. Plus the gameplay is very fun and challenging.",
      "I had fun figuring out a way to avoid the attacks and the game felt very polished. My only complaint is that the hitbox of the boss seems to be quite small, at first I thought I wasn't taking any damage by going through it on the way up and was a bit confused when I did. Also I did it,S rank!",
      "I remember this game in round 1, it made huge progress!)) also I like  colors and design! good job",
      "The game feels great to play! The bounce and attack felt powerful. Great work!",
      "I managed to beat meat man on my second try with a D. It's really good, love the visuals and the way that you have to bounce up to get him is done well especially with the different movements he has",
      "Very fun :)",
      "Regarding your posts on Discord, I must say that this is an outstanding entry. The game feel and polish are excellent, and I am impressed with what you have achieved in such a short time. I can only imagine what you could have accomplished if you had more time. I am looking forward to seeing more from Meat World.",
      "I know you mentioned you were just using squash and stretch but this still really came together crazy well visually.  The bounce mechanic was great, too!  Only thing I'd suggest is maybe allowing the attack to work at any time because the bounce availability already limited it and the window to attack while it was flashing seemed a little narrow.",
      "Flunked out the first try, but got a B on the second. It was a fun boss fight.",
      "Final rank: F.  But with the ranking system, I'm definitely coming back for more once I'm finished ranking others.  Everything felt really tight and polished.  The timing on the wave was about my only complaint.  Likely just my timing though.  Gonna test it when I come back to it.  Solid entry all around, and a worthy opponent for Ghostbit!",
      "C rank... Great sfx and clear gameplay! Love the art style and controls were tight!"
    ],
    "comments_posted": 7,
    "created_at": "2023-03-14 18:38:48",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1877910",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spacespy",
      "member_since": "06 June 2020",
      "posts": "479",
      "topics": "7",
      "followers": "129",
      "following": "141"
    }
  },
  "1968536": {
    "overal_rating": [
      "Score*",
      "4.343",
      "3.904",
      "3.708",
      "3.689",
      "3.318",
      "3.172"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.450",
      "4.000",
      "3.800",
      "3.780",
      "3.400",
      "3.250"
    ],
    "participant": "gamefavorites",
    "game_title": "one-eyed Pete vs The Kraken",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 18,
    "comments_raw": [
      "One-Eyed Pete returns again! I love the misdirection in the beginning. Had a great time playing on stream. It took me a bit to remember the cannonball gave me a double jump, but I think that's a brilliant dual-use of the mechanic. Great work. My only suggestion would be to give a rating at the end. You could base it off of how much health was left and how many coins the player collected, then it gives more incentive to repeat a play.",
      "I STREAMED YOUR GAME!https://www.twitch.tv/videos/1769376612TIMESTAMP - 26:00",
      "Very clever use of mechanics from your previous rounds, the use of the cannonball double-jump also as an attack especially! I really liked the surprise after defeating that initial octopus too, such an intense moment that really got me in the mood for a boss fight!",
      "I'm so happy I went into this one blind seeing the comments would have ruined the surprise. Also even more happier that you continued with the same universe. The mechanic using the cannonball's was amazing after being hit by them through all these other rounds. Delighted to have played this on stream:https://www.youtube.com/watch?v=cSUIomK5BB01:00:40",
      "Not even the Sixth Sense film prepared me for the plot twist that would take place in the moment I managed to hit that tiny octopus. Great Job! I had a lot of fun playing this",
      "The twist of the boss actually being giant was really cool. I think having the bosses eyes look at you was a nice addition as well. My main complaint is that it seems luck can screw you over sometimes, when all the cannonballs bounce off into the water.",
      "Loved the boss reveal! I'm not that great at boss fights, so I struggled quite a bit with this, especially hitting the boss with the cannonball in the first part. I did enjoy it though, and I've loved seeing the progression of the game through the rounds!",
      "One of the things I was hoping to achieve was a really cool boss reveal, but unfortunately I didn't quite hit the mark. However, I must say that your boss reveal was absolutely amazing and he was incredibly intimidating. I'm actually quite jealous! Overall, I had a lot of fun playing and even had to come back for a second time in order to defeat the boss.",
      "Really fun twist at the start, and really intuitive and clever way to damage the boss as well. I feel that the cannonballs are too slow, especially after rebounding, causing them to linger very long on the screen and cause some near impossible patterns (though I might just be bad haha). Didn't manage to finish it, but it was a great fight nonetheless.",
      "That was awesome! I really enjoyed playing and was able to win with all coins! Great JobLittle feedback: First time it was fun how kraken appears, but after 4-5 deaths it seemed little slow! Anyway this is one of the best entries i have seen so far!",
      "I like the variety in attacks for the boss! I wish you could grab canonballs out the air as I wasn't very good at avoiding them haha, nice continuation with the canonball jump though!",
      "I really enjoy the humor in this game! Each instalment so far has had something that made me laugh. The boss fight was very well done, and I look forward to what comes next for Pete. Great work!",
      "Great work! The fight was fun and the kraken's entry was epic!",
      "I had a lot of fun with this :)",
      "Another well done chapter in this saga, can't wait to see the next one. Took me a lot of dead Pete's but I managed to get get the kraken. Fun and well done.",
      "Took me a few tries to figure out how to damage the Kraken.  But man, the animation of him appearing was just awesome.  Love to see how this is progressing each round.  Nice work.",
      "Super fun boss fight, and the part where the giant kraken head pops up is straight up iconic!  Loved this.",
      "nice job! the boss was really fun and after a couple tries i beat it hitless and got all the coins :D"
    ],
    "comments_posted": 25,
    "created_at": "2023-03-13 19:34:50",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1968536",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "820",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "1966348": {
    "overal_rating": [
      "Score*",
      "4.261",
      "3.652",
      "4.174",
      "3.913",
      "3.739",
      "3.739"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.261",
      "3.652",
      "4.174",
      "3.913",
      "3.739",
      "3.739"
    ],
    "participant": "malek-elsady",
    "game_title": "underpowered",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 18,
    "comments_raw": [
      "IVE GOT A GUN. ITS BIG.",
      "That was awesome!!! For me, 4th boss was the strongest one)I found mini feature) If you hold the time when you collect 4th piece, shotgun makes more damage))",
      "This was very fun! Good variation of bosses, I was even able to one-cycle the first and second boss by spamming spacebar with both hands which actually felt awesome. Very good level of difficulty too, it wasn't too hard but it still posed a solid challenge.",
      "This is a really good entry. I liked the hectic bullet patterns of the bosses, where they would start off pretty easy, and get challenging real fast. I think my favorite was the 4th boss, I really liked the push/pull mechanics, and I think it used them very well. I also really love the final boss and how it kind of ties back with the main mechanics of the game. I think the gun-making and mashing space rapidly to get as much damage in as possible is satisfying, but I do think it could be made even more satisfying. For example, if the player became invincible and had bullets bounce off of them while they have the gun, maybe even a music change. I also think it'd be nice if the scraps would spawn instantly after you pick one up, (although you'd have to give the bosses more health), so there's less waiting around and more go-pick-that-thing-up action. But, those are just some small things I noticed. Great work!",
      "Really nice tutorial, really clear mechanics, GIGANTIC GUN!",
      "More characters spinning in the corner please! More! More!!! Really impressive boss rush with varied bosses and a great break room. I think you should put some sort of penalty in place for abusing slow motion in the beginning of the fight. Other than that, I loved it.",
      "Loved this! Again the WASD bug, but it wasn't a big deal. I loved the music you chose, and I love the slow down mechanic, made it a lot easier for me lol",
      "wow. this game has everything i like in a bullet hell game, hard but not unfair fights, interesting boss mechanics, more than 10 seconds of gameplay, its perfect!",
      "Kind of sad not seeing another part in the mouse, the cheese and the disembodied arm, but at the same time had a lot of fun with this one. Really liked the color palette of the game and the fact that diverges from the classic bullet hell, giving you that difficult collection phase to later reward you with a gigantic gun/bulletspamming beast, to leaving you defenseless again, punishing but rewarding. Great work!",
      "I spent sooo much time on the second boss :P Thanks for the time slow down mechanic!",
      "Great bosses with a nice variety of attack patterns and designs! The game is difficult, but fair and I really enjoyed it! Great work!",
      "5/5 stars! fantastic job!",
      "I was hoping for more of Mouse, but you did NOT disappoint with this one.  Really well done bullet hell.  Unique mechanics for each boss.  I couldn't use WASD either.  Would also recommend a little indicator before the gravity shift on Shvoop. But those two small asides, no complaints on my end.  Great entry!",
      "Awesome variety in boss battles, and I wasted a bit of time on the little game in the lobby.",
      "The bosses all have fun attack patterns to dodge and I like the auto aim a lot",
      "This game is great! the bosses were simple and fun and the references in the room before each boss were nice.",
      "All the bosses were so well designed! Great ideas that kept them unique. I couldn't use WASD in the hub room but not an issue (got to 7 points on the mini-game (shameful I know)). I liked how you didn't have to aim, because that's the part about twin-stick shooters I hate: the second stick aiming. Great job!",
      "Dude this turned out great.  All the bosses felt well though out and unique, and the turtle tutorial and spinning characters in the little waiting room were great touches."
    ],
    "comments_posted": 17,
    "created_at": "2023-03-13 05:13:17",
    "game_url": "https://itch.io/jam/gdko2023-round-3/rate/1966348",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,039",
      "topics": "14",
      "followers": "47",
      "following": "53"
    }
  }
}