{
  "1876052": {
    "overal_rating": [
      "Score*",
      "4.500",
      "4.318",
      "4.227",
      "4.045",
      "3.227"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.500",
      "4.318",
      "4.227",
      "4.045",
      "3.227"
    ],
    "participant": "rio85",
    "game_title": "??-??-??",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 16,
    "comments_raw": [
      "Cant wait to learn more about the story and the back ground, hope you get to the second round",
      "Loved it. Love to see amazing work from a fellow GameMaker user. I played on stream and shared my thoughts while playing if you wanted to watch the playback. Excellent entry.",
      "wow that was cool. nice work, hope to see more.",
      "I really can't wait to see more! I want to know the story!!!",
      "The art style and was great, I'd love to see more.",
      "I really love the atmosphere and style of the game, and I would love to see this developed further, and to see this story continued. And that cutscene, that was so incredible omg",
      "Loved the character sprite! The feel of the game was eerie and cool, interesting to see where this may go",
      "Really enjoyed the aesthetic here! I'm going to have to try and use a similar style some time, it's just so atmospheric!",
      "This is just beautiful.  I need this as a full game.  Especially that cutscene.  I'm gonna have to study that once this game jam is over.  Very nice job all around.+",
      "This isn't what I need to see on a Monday... but it IS what I need to see in round 2!",
      "The setting and atmosphere for the game is awesome, love the screen shake and all of the art that's gone into it. It looks really professional and I look forward to what you have got planned for it",
      "Really awesome cinematic effects, graphics and sounds! Strongly reminds me of Hyper Light Drifter which is one of my favorite games. Would love to see you build off of this!",
      "Great work on the assets and the animations, the music with the cinematic effects really sell the whole vibe! The open hands, the details on the walls and tiles as well as the big bois in the end really show you did a lot of work!On suggestion (that you probably thought of already and I am being pedantic) is to add extra stepping SFX if your game has a lot of walking around ( I tried it this round and it adds to the experience). It was no problem at the start, but right before the last 2 turns where there was nothing new for my brain to focus on, it picked up on the pattern and frowned.",
      "I swear I want to play full game. One minus is optimisation? i dont know i had some lags. But really great stuff!",
      "Neat stuff. The flash of dead bodies and the three gaints really reminded me of the intro of Hyper Light Drifter. And the art is quite nice.",
      "I love the atmosphere it feels very ominous and foreboding especially with that weird vision the sound effects, plus the art is superb. the only problem is that after my first playthrough when the game reset all the sound stopped playing"
    ],
    "comments_posted": 8,
    "created_at": "2023-01-13 14:35:51",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876052",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rio85",
      "member_since": "04 July 2017",
      "posts": "38",
      "topics": "2",
      "followers": "5",
      "following": "2"
    }
  },
  "1877659": {
    "overal_rating": [
      "Score*",
      "4.296",
      "4.370",
      "4.185",
      "4.000",
      "4.222"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.296",
      "4.370",
      "4.185",
      "4.000",
      "4.222"
    ],
    "participant": "simoncb",
    "game_title": "A duck on wheels",
    "platforms": [
      "web"
    ],
    "rating_count": 27,
    "comments_received": 16,
    "comments_raw": [
      "Streamed while playing this and commented throughout if you want to watch the playback. Had the game audio set to the wrong channel, but fixed and revisited briefly after the break.",
      "Solid entry! Love the paper cutout style. Also love your very gracious checkpointing haha, without that this would have been quite a bit more frustrating to end. Also I gotta give bonus points for any entries feature a duck, an oversight clearly in my own entry teehee",
      "Ggeniusï¼\u0081",
      "Very unique art style and concept, and some great level design here, would love to see more!",
      "this game is absolutely hilarious and i love it!",
      "Ducks are cool.I love the art style and the humor.",
      "Insane. Nice controls, good level design, well polished throughout. Art style is so unique and well executed, reminds me of Getting Over It. Looking forward to more ducks and more levels.",
      "I really loved this game, and the way you used stock images was so creative! It came together really well, and I loved the motivational messages too lol",
      "wonderful art direction and fitting music. Love the useless inspirational messages",
      "Lovely game. I really enjoy the positive messages, that is a really nice touch to experience on a Monday :^)",
      "This is one of my favorites. Love the quirkiness of it and it's such fun to play",
      "I absolutely love the style of this game. The art is super cool and I love the almost surrealist styles of ducks, gears, and crates",
      "TEE HEE duckfaced people should be banned for posting signs underneath wooden crate-like structures. Better yet, a future with them being thrown at rotating metal gears is not one I would disagree for.(Great mashup of unique textures, the frequent checkpoints really help a lot players with limited patience *wink wink*. I was joking with duckface-Jerry, he is my friend, can't wait to see him again)",
      "This game is beautiful. I love the use of stock images to create this unique bizarre collage world, and I think the ducks holding the wholesome/motivational signs is quite funny and charming and adds to the whole experience. One little thing though, the sound the duck makes when you jump is a bit annoying.",
      "This game is built so well using only stock images! You're definitely making it to round 2, can't wait to see what you have planned next!",
      "For not being able to come up with an idea, this is actually really creative.  Great job adapting and getting something together (in essentially half the time, too!)."
    ],
    "comments_posted": 2,
    "created_at": "2023-01-14 18:30:09",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877659",
    "coolness": 47,
    "participant_info": {
      "profile_url": "https://itch.io/profile/simoncb",
      "member_since": "08 April 2015",
      "posts": "80",
      "topics": "1",
      "followers": "8",
      "following": "8"
    }
  },
  "1874806": {
    "overal_rating": [
      "Score*",
      "4.167",
      "4.125",
      "3.917",
      "4.000",
      "3.125"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.167",
      "4.125",
      "3.917",
      "4.000",
      "3.125"
    ],
    "participant": "ghostbitstudios",
    "game_title": "A tour of Sweetland",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 19,
    "comments_raw": [
      "Tasty, tasty! Had a blast with this on stream. Love the location and I'm really curious to see which approach you'll take with gameplay if we continue our round one entries into round 2. Great stuff, GhostBit.",
      "I like the art style.",
      "The art style for the creatures and level were great.",
      "very nice art! Like the colour choices and the enemy animations too!",
      "Very nice candy-themed level! It is also awesome to see how your artstyle has improved over time, nice one Ghostbit :))",
      "Sweet level! I love the lollipop enemies the most, excellent animations all around. Some nitpicks are that the player collision should only be at their feet, and the house and ground sprites are a little out of place due to the inconsistent pixel size and flat texture respectively.",
      "Really cool world you've got here chockfull of amazing pixel art. Would love to see those enemies in action! I have one nitpick though with the gingerbread house; It feels off due to its black outline and inconsistent scale. As the black outline stands out quite a bit, (just an idea) you could use this to your advantage by having black outlines around sprites to indicate that you can interact with them (houses, enemies, items, npcs, player, etc). That way players will easily be able to distinguish between the environment and important things.",
      "Wow Ghostbit! The art is really sweet! I went right first and wow! those monsters are my favourite, top quality work of simple leg limps on a detailed body, plus those eyes and mouth are haunting! (well done man! Amazing animations and personality!)",
      "I think you've done a great job with the art style! I love this concept, and am excited to see where you go with the gameplay and story, and future areas of the game!",
      "got to say another great entry by the great ghostbitstudio just wish the collision would be a bit nicer by that I mean you can get stuck on corners and edges real easily but other than that just a few wrong z indexes but it is great I would love to see more maybe even some combat or something",
      "Haven't seen anything like this before (aside from maybe Candyland, the board game).  Pretty well executed.  Would liked to have seen a little more of an objective.  But I can tell the focus was definitely on the art/visual design.  Well done!",
      "Really nice start, I really like the mix of colorfulness with some scary monsters! Would love to see where you take this gameplay-wise if you build off of it.",
      "The world is colorful. The world gives me Alice in Wonderland vibes. It's all good, but the only thing I can't explain is the ginger bread house. For some reason, I feel something is off about that building. Maybe it's because it has a different outline or something like that. But besides that, everything looks great.",
      "So beautiful ! Love the colors and the fun but creepy vibe, can't wait to see more, well done !",
      "Cool level. A tiny issue with depth sorting, but that art style is good, and the design looks neat.",
      "cannot wait until i can kill the food bois next round",
      "Yummy! Looking forward to munching on some enemies.",
      "Fantastic art and animation, loving the sweet themed level and can't wait to see what your main character is going to look like",
      "the art here is super cool and I love all the enemy animations. I really hope this makes it to the next round so I can see where you take it!"
    ],
    "comments_posted": 3,
    "created_at": "2023-01-12 16:17:38",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1874806",
    "coolness": 26,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ghostbitstudios",
      "member_since": "30 June 2019",
      "posts": "721",
      "topics": "13",
      "followers": "43",
      "following": "48"
    }
  },
  "1877174": {
    "overal_rating": [
      "Score*",
      "4.000",
      "3.500",
      "3.409",
      "3.182",
      "2.773"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.500",
      "3.409",
      "3.182",
      "2.773"
    ],
    "participant": "steven-the-gamer",
    "game_title": "Above the Clouds",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 10,
    "comments_raw": [
      "The art is great!",
      "Love the different scenes and care you put into crafting the world. I had fun playing this on stream and left feedback during my play session. I think I saw you said somewhere to wait ten minutes in game, I'll have to go back and try it. I hope you let me catch a fish then! Excellent work with the task. Good job.",
      "Nice soft palette color, solid dithering work. Could be a fun world when filled out more!",
      "Fun game, great art, whats not to like?",
      "Really cool idea, love the fishing and the art is good too. Great game!",
      "This is such a cute game, and I love the location. I think some really calm music would be great for it too! The fishing from the hot air balloon is really unique, and I am curious to see what more mechanics of the game could be like",
      "Good, unique concept.  I'm curious to play more once the mechanics are in place.  I need to know more about this world!  Great job all around.",
      "this is a great game with a nice and original setting but i feel like the fishing aspect could use a tutorial cos i have no idea how to fish",
      "The game's got a good look to it and like how you can fish from a hot air balloon",
      "Pretty good Game! I liked the art and loved the aesthetics."
    ],
    "comments_posted": 2,
    "created_at": "2023-01-14 16:03:26",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877174",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/steven-the-gamer",
      "member_since": "28 November 2018",
      "posts": "297",
      "topics": "22",
      "followers": "103",
      "following": "25"
    }
  },
  "1878115": {
    "overal_rating": [
      "Score*",
      "4.005",
      "3.554",
      "3.655",
      "3.605",
      "3.104"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.211",
      "3.737",
      "3.842",
      "3.789",
      "3.263"
    ],
    "participant": "jackawaka",
    "game_title": "Alien Exploration",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 16,
    "comments_raw": [
      "Nice one, its so unique. Geat job !!!",
      "Was able to stream it earlier tonight. Had a blast exploring and even though I promised not to, I got stuck at the waterfall ... I need to be more careful! Great entry. Well done.",
      "Cool level, I'm excited to see more. I enjoy the textures and the feel of this planet.",
      "Really cool looking world, I like the textures a lot, and the alien trees. I liked that you had the waterfall going, that was neat. Kind of a liminal space kind of place. I'm wondering if you continued it what other things the player would see. More types of flora/fauna, any moving creatures, or maybe fossils of some type. And the goals of the exploration mission could lead in a lot of directions.",
      "Pretty nice little game! the colors were really nice and I liked the 3d models.",
      "This is a very beautiful looking level.",
      "Really colourful and fun environment, nice use of elevation on the level too.",
      "I love the color palette.  CMYK is always an interesting choice.  Super trippy, but in a really good way.  Looking forward to seeing what you do with this.  Great work!",
      "An outstanding, unique level!",
      "While I did indeed get stuck on the geometry by the waterfall, it was ok because it's a nice waterfall to look at! Interested to see where this could do if you do have the time.",
      "This is so surreal I love it. Gorgeous game. Thank you for submitting it!",
      "I love it ! So bizarre and creative, I love the texture it add so much little details, and the waterfall is gorgeous!",
      "So unique the location is!",
      "I really like the models and the colors, especially the waterfall. I'd like to see where you'd take this.",
      "I like the vibrant atmosphere and the gorgeous waterfall! A dark sky would give a nice contrast to the landscape. Awesome!!",
      "Love the colours and the crazy alien plants. The waterfall also looks pretty. Nice job! It's also really neat that you included your concept art!"
    ],
    "comments_posted": 4,
    "created_at": "2023-01-14 23:57:42",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878115",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jackawaka",
      "member_since": "16 January 2017",
      "posts": "62",
      "topics": "2",
      "followers": "9",
      "following": "12"
    }
  },
  "1876156": {
    "overal_rating": [
      "Score*",
      "3.630",
      "2.593",
      "2.630",
      "2.556",
      "2.222"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.630",
      "2.593",
      "2.630",
      "2.556",
      "2.222"
    ],
    "participant": "humbleguildmaster",
    "game_title": "Ancient Alien Architects",
    "platforms": [
      "web"
    ],
    "rating_count": 27,
    "comments_received": 16,
    "comments_raw": [
      "I love the location, and your concept is super unique! This is a challenging game, but really fun!",
      "Played on stream and left feedback throughout the session if you wanted to watch. The pairing of location and theme works really well. I like how you worked the objective and gameplay into the single setting and had it work so well. Good job.",
      "Goodio! Stonehenge is a sick place for a game, and the alien theme really adds to it.",
      "Pretty cool game! I liked the concept and the game play was fun. I liked having to multitask with attacking the aliens and building",
      "Cool game. I can see your inspiration from some stories.",
      "Cool game where you have to balance objectives! Could see powerups and other shenanigans going on as this game gets built (no pun intended) :P",
      "This game is tough! A fun concept though, stonehenge is a very unique location!",
      "I swear I was ð\u009f¤\u008f THIS close to using Stonehenge as my unique location as well hahaha. If you intend to build on this game, I would recommend you have the rotation controls just be A and D or the scroll wheel, and have them work on whichever block is currently picked up - it would make the controls much more intuitive!",
      "Fun little clicker, definitely have potential. for more types of aliens and interactions, and maybe more monuments. Good job!",
      "1st round: aliens destroyed me, desperately tried to protect the stones.",
      "It's good fun, love that you actually get to see the stone henge being built and destroyed by aliens. Would love to see the aliens move positions from time to time but love how more come in and you have to balance building with defending and attacking",
      "Interesting idea.  It actually gives me an idea for my own project (adding that to my game dev notebook!).  Using mouse to both move the paddles AND click the aliens might be a little much in the long run.  Typically, one button, one action is sort of the expected rule in video games (though not always the case, of course).  Just my opinion, of course.  All around, great job!",
      "Neat little concept, with a lot of room to build off of! I'm not sure if there was a way to and I was just missing it, but I wish I could have rotated the second block that I had control of instead of just one of them.",
      "Fairly simple, but an interesting pretext. Though I imagine you could only go so far with stonehenge iteslf in terms of complexity (blocking with the large rocks), I think it could be interesting if it was a game where each level was some monument with a unique challenge. Could be a party game in a way, always about defeating out those pesky aliens.",
      "Wonderful idea, unique location, whats not to like about smashing aliens",
      "This was fun! I wasnâ\u0080\u0099t able to rotate one of the blocking stones, but I that might have been a me problem."
    ],
    "comments_posted": 25,
    "created_at": "2023-01-13 15:49:39",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876156",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/humbleguildmaster",
      "member_since": "08 August 2022",
      "posts": "42",
      "topics": null,
      "followers": "3",
      "following": "15"
    }
  },
  "1873827": {
    "overal_rating": [
      "Score*",
      "3.755",
      "3.395",
      "3.498",
      "3.652",
      "2.932"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.056",
      "3.667",
      "3.778",
      "3.944",
      "3.167"
    ],
    "participant": "dezwave",
    "game_title": "Ash Demo (GDKO_2023_Round1_Entry)",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 9,
    "comments_raw": [
      "Customization options! Love it. Had fun with this one on stream and left feedback there if you wanted to watch. Excellent entry with a lot of care and polish put into it. Great work.",
      "Wow, this is absolutely incredible! The atmosphere of this game is great, and the art style is stunning! I'm very curious to see what additional levels of this game would be like.",
      "Best entry I've played so far. Beautiful artwork and really cool post apocalyptic environment. The level was very well mapped out for a metroidvania type game and the character was cool (reminded me of the movies 'Chappie' and 'I am Mother'). Amazing stuff!",
      "Very cool game. I found a cave where was a levitating monster and a lot of coins. It would have been nice to see the monster actually doing something in the future.",
      "Nice entry all around, fun moody atmosphere. I managed to find the little cave of the coins and sinister monster (and of course, ride on its head for a moment haha). Couple places felt a little too dark, you can lighten colors but then hue shift to cools to make a little more visible, since some platforms were rather hard to see. Nice work, curious to see where it goes!",
      "This is beautiful.  Very well thought out.  Would love to see this fleshed out into a full game.  And the ability to customize your character from the main menu was a nice touch for more contrast.  (Actually inspired a mechanic idea.  Adding that to my game dev notebook!)  Great work!",
      "This was such a cool game! the music was very good, and the atmosphere was astounding! all the effects like the rain and dust really added too it.",
      "Love the styling and polish, especially the main menu. One thing I would change is to make sure all platforms and important elements have high contrast with the background, e.g. your ashy friend would be a lot more visible if they had glowy eyes or lit up the background behind them",
      "This is really impressive. I can tell a lot of thought and effort has gone into its making, love the atmosphere you have created and the art and colours are really nice"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-13 00:43:09",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873827",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dezwave",
      "member_since": "16 November 2022",
      "posts": "5",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "1877947": {
    "overal_rating": [
      "Score*",
      "3.542",
      "3.375",
      "3.375",
      "2.833",
      "2.667"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.542",
      "3.375",
      "3.375",
      "2.833",
      "2.667"
    ],
    "participant": "keltfire",
    "game_title": "Awake",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 14,
    "comments_raw": [
      "fun game, like race the sun (and other such games). Not sure if I like that you can choose your speed, but not a problem as it isn't a mechanics round :)",
      "OK! So I installed Firefox and it was a much smoother experience. I also don't know why on stream I thought we had to go incredibly fast. Probably just being competitive. This morning I played and dialed way back on my speed (I'm not sure how I didn't realize you could decelerate) and it was a blast!If anything, I would suggest you clamp the top speed to a level that's intense but still playable, instead of letting it get up to something that's going to be uncontrollable. Not that mechanics and gameplay are part of the rating this time. But I had a lot more fun when I mellowed out on the speed, but I also think most people will tend to push it speed wise.",
      "OK! So I installed Firefox and it was a much smoother experience. I also don't know why on stream I thought we had to go incredibly fast. Probably just being competitive. This morning I played and dialed way back on my speed (I'm not sure how I didn't realize you could decelerate) and it was a blast!If anything, I would suggest you clamp the top speed to a level that's intense but still playable, instead of letting it get up to something that's going to be uncontrollable. Not that mechanics and gameplay are part of the rating this time. But I had a lot more fun when I mellowed out on the speed, but I also think most people will tend to push it speed wise.",
      "The first time I tried this I got a jump scare because I was going too fast and died LMAO",
      "The first impression that this game gives is that I'm like in a dream.",
      "This game is really atmospheric!",
      "The aesthetic is really cool, but audio and video.  Most of the suggestions I would make others have already said, so I won't really rehash them.  A really nice entry all around.  Nice work!",
      "I reached the end in 265 seconds with a final score of 45. At first I went far too fast but I learnt pretty quick. Love how the massive object rises in the distance, not sure how the score is calculated but I think this game has a lot of potential and the environment is pretty cool",
      "it looks cool but a little bit difficult, also im not sure wether its supposed to be in first person pov or third, since at the end you see yourself, cool game overall  tho",
      "Great speedrunning concept where you set your own difficulty by accelerating. The neon surreal landscape is nice though I have to admit quite common in such forward scrolling games",
      "Nice game, funky world is definitely unique. From a gameplay standpoint (which is not what this round is about, but hey feedback is always nice right?) I think it would help to have a physical representation of yourself/your width or some vehicle onscreen, so you can judge where youâ\u0080\u0099re at.",
      "I loved the game, it was fun to play. I couldn't handle the speed because there were points where I couldn't see the difference between close and far objects sometimes. The art style was good and I am intrigued about what could be going on.",
      "I really enjoyed the art style but though the game was a bit too difficult. I had to slow down a lot because when I was going to fast I couldn't see the obstacles in front of me. but still overall a nice game",
      "I finished it, but I had to slow down as the smaller monoliths(?) were difficult to see when I was going super fast, took me 135ish seconds :)Interesting other worldly landscape and I love the huge looming thing in the sky it was a cool sci-fi oppressive feeling kind of level. Nice!"
    ],
    "comments_posted": 32,
    "created_at": "2023-01-14 22:08:11",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877947",
    "coolness": 41,
    "participant_info": {
      "profile_url": "https://itch.io/profile/keltfire",
      "member_since": "13 June 2020",
      "posts": "312",
      "topics": null,
      "followers": "12",
      "following": "3"
    }
  },
  "1875421": {
    "overal_rating": [
      "Score*",
      "3.304",
      "2.954",
      "2.904",
      "2.653",
      "2.854"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.474",
      "3.105",
      "3.053",
      "2.789",
      "3.000"
    ],
    "participant": "snaro",
    "game_title": "BALLOON AIR RIDE",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 8,
    "comments_raw": [
      "Streamed while playing this and commented throughout if you want to watch the playback. Love the art style on this. It works so well and is such a cozy and enjoyable game. Excellent work.",
      "I really liked the art and the game play was smooth. I really liked the effect you used for the wind",
      "Very cool and smooth game. It could be little bit faster.",
      "Great game, loved the art style and the controls were great.",
      "I really like the art style here - although I wish the clouds had the same line thickness as the balloon, they kind of stand out chilling in the background haha",
      "Nice artwork, nice setting for a game and I like the way you have shown the wind. I feel like the game would benefit from making the wind stronger at a higher altitude",
      "I really like the physics based movement idea and the art is very unique . It feels like I'm playing inside a painting.",
      "The line are style works really well, feels very handmade which is nice. The idea of the balloon lofting in the wind is interesting, I like the joint mechanics of how it reacts when running into obstacles."
    ],
    "comments_posted": 2,
    "created_at": "2023-01-13 00:45:12",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875421",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/snaro",
      "member_since": "29 August 2016",
      "posts": "11",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1875528": {
    "overal_rating": [
      "Score*",
      "2.696",
      "2.696",
      "2.783",
      "2.652",
      "2.609"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.696",
      "2.696",
      "2.783",
      "2.652",
      "2.609"
    ],
    "participant": "cardvark",
    "game_title": "Baba Yaga",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 11,
    "comments_raw": [
      "I like it reming me of online games i was playing when i was younger. Nice entry",
      "I liked the mech, though I just flew over all opposition which was interesting",
      "Streamed while playing this and commented throughout if you want to watch the playback. The care and attention you put into one mech is impressive, that you made three different ones is incredible! What a great power fantasy game. Loved this one.",
      "Nice! I want a full game.",
      "I don't know how constructs work, but I think a lot of physics comes into play here. Good job",
      "smashing with those legs were totally fun",
      "I really love the gameplay as it was fun and had good replayability. This is brilliant.",
      "I loved the action and explosions in the game, if there were sound effects it would be totally awesome. Having different mechs to control is a lot of fun and the fact there is so many weapons is brilliant",
      "I really enjoyed the gameplay It was super fun to destroy enemies with a massive arsenal of weapons. the art was also pretty good",
      "Fun gameplay, especially with the 2nd and 3rd mechs. I think there could've been more cohesion between the foreground and the background, but I really like the art for the mechs and enemies.",
      "This is the most fun ive had blowing stuff up in a while! nice work"
    ],
    "comments_posted": 13,
    "created_at": "2023-01-13 02:44:43",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875528",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/cardvark",
      "member_since": "05 January 2022",
      "posts": "194",
      "topics": "5",
      "followers": "10",
      "following": "4"
    }
  },
  "1839531": {
    "overal_rating": [
      "Score*",
      "2.001",
      "1.449",
      "1.656",
      "1.656",
      "1.449"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.900",
      "2.100",
      "2.400",
      "2.400",
      "2.100"
    ],
    "participant": "spooky-productions",
    "game_title": "Backrooms: Nightmare",
    "platforms": [
      "windows"
    ],
    "rating_count": 10,
    "comments_received": 6,
    "comments_raw": [
      "Character movement was nice (though, not the focus of this round!), definitely quickly felt very samey - not sure if there was a secret nugget to get find there, but it did sort of give me Overlook Hotel vibes (ie The Shining)",
      "I was shocked by how good the character model looks when I looked down. I appreciate the generous sprint stamina. Good work.",
      "I'm sorry I cant play because the file doesn't work but the game looks cool!",
      "I think a map or some decoration around the environment would help massively with navigation. Like the idea and design, maybe a condensed version would make it easier for the player to experience all aspects of the level?",
      "the game looks great but there it was hard to know what to do until i found the no clip wall i then went to a garage thing and saw a monster which barley did any damage but its good i would to see the idea being improved upon",
      "SCARY"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-12 08:43:25",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1839531",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spooky-productions",
      "member_since": "16 December 2022",
      "posts": "19",
      "topics": "1",
      "followers": "4",
      "following": null
    }
  },
  "1869789": {
    "overal_rating": [
      "Score*",
      "3.963",
      "3.926",
      "3.852",
      "3.444",
      "2.852"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.963",
      "3.926",
      "3.852",
      "3.444",
      "2.852"
    ],
    "participant": "zhzh",
    "game_title": "Balloon World",
    "platforms": [
      "web"
    ],
    "rating_count": 27,
    "comments_received": 18,
    "comments_raw": [
      "Very cool game. Only thing is that I can throw chickens over the stone wall and i can also walk over the wall using the fence and the pot thing.",
      "A little tough on my browser to run, but very pretty! Interested to hear about this world of little vignettes living in balloons :)",
      "I love the Balloons I can imagine each one being a new unique location. I only wish those more to explore.",
      "Had a great time with this one on stream. I don't know why I tossed the poor chickens off the balloon farm ... but I couldn't help myself. Really well done. Would love to explore more of the balloons.",
      "This is a very unique location, and I definitely want to explore more levels/balloons. Throwing the chickens is really fun too lol",
      "Nice little farm and cute chickens!",
      "Balloon world has now been freed from chickens, they all vanished by \"yeeeet!\" to the stratosphere. You are welcome.",
      "love love love the aesthetics of this game! Great ideas for some fun modular levels and has so much potential! Even if it's just chucking chickens around! So good.. Had to give a perfect score! Great job",
      "Really like the little world you made. It's fun throwing the chickens and watching them run. I can definitely see how this game could evolve with more rounds of development. Excited to see what you come up with",
      "Really cute ! I can see a lot of funny gameplay with the chicken later, can't wait to see what's going to happen :D I also really like the camera mouvement, it feels really really good !",
      "Truly a unique world.  The camera movement between the title screen into gameplay was a really nice touch.  More games need to do that.  Would like to see a little more of an objective in the game, but that's not really the focus of this game jam.  All around, really nicely done.  Cheers!",
      "I threw a chicken off of the balloon and I feel so bad!",
      "Really cool and unique setting. plus the models are super cute and nice",
      "really cute artstyle and i love the catching and throwing chickens mechanic",
      "Low poly done right! Still lags on my PC....",
      "Very cute and unique, glad you had that pen there in the level to give an objective of sorts",
      "The transition from outside to inside the balloon felt so immersive. Definitely do more like that in the future! Awesome job :)",
      "Really nice and cozy looking level, I like it!"
    ],
    "comments_posted": 17,
    "created_at": "2023-01-14 21:46:39",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1869789",
    "coolness": 33,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zhzh",
      "member_since": "12 December 2022",
      "posts": "33",
      "topics": null,
      "followers": "3",
      "following": null
    }
  },
  "1877924": {
    "overal_rating": [
      "Score*",
      "4.455",
      "3.909",
      "3.682",
      "3.409",
      "2.273"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.455",
      "3.909",
      "3.682",
      "3.409",
      "2.273"
    ],
    "participant": "cheekhoove",
    "game_title": "Bath Game",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 9,
    "comments_raw": [
      "Among the most unique and creative locations this round. I had a great time with this one on stream. Incredible how much fun just moving around the empty space is. Love the effects when you get too close to the camera. A lot of thought and love in this. Great work.",
      "Well this definitely stands out as a unique locations! Nice work. Level design is hard to rate since itâ\u0080\u0099s just an open tub, but I could imagine lots of obstacles or things to contend with like foam or draining water or other toys. Or other bathtub shapes? Who knows! Iâ\u0080\u0099ll be happy though if you add arubber duckcow;)",
      "Unique, good graphics, even moving around was fun. Great stuff!",
      "This is such a cool concept, and such a unique location! Even though there wasn't really an objective I still had fun driving and spinning around :)",
      "The movement is great and although there isn't much to do in the level other than test out the controls, I can imagine some pretty good races to come perhaps with bubbles acting as markers. Hope to get to see where you take it",
      "Art and visual design are simple, but effective.  It's a fun little concept.  Would like to see some sort of objective added.  Didn't really feel like there was a goal.  But you have the base of something truly unique.  Would love to see where you go with this!",
      "Haha this is such a great concept for an environment, I love it!",
      "The models look super nice and I love the style of thee game just super simple and clean. I also love the effect the boat has on the water and the particles the boat makes",
      "Interesting location. The boat controls really well for just a couple buttons."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 21:08:44",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877924",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/cheekhoove",
      "member_since": "27 October 2022",
      "posts": "1",
      "topics": "1",
      "followers": "9",
      "following": "3"
    }
  },
  "1876888": {
    "overal_rating": [
      "Score*",
      "4.393",
      "3.321",
      "2.750",
      "3.000",
      "2.643"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.393",
      "3.321",
      "2.750",
      "3.000",
      "2.643"
    ],
    "participant": "nuzcraft",
    "game_title": "Bicycle in a Tornado",
    "platforms": [
      "web"
    ],
    "rating_count": 28,
    "comments_received": 18,
    "comments_raw": [
      "Some interesting inertia that just kind of makes sense for being in a tornado! And riding a bicycle in a tornado is yeah, decently unique.",
      "Played on stream and left feedback throughout the session if you wanted to watch. I lost a bet and had to buy my buddy dinner ... just couldn't avoid those dang knives! Excellent entry. A lot of fun.",
      "Mad! Crazy! What? Bicycle? Tornado? INSANE",
      "Just as I was wondering how far I could get, I get a knife to the tire! 41 score. Fun game, I like how you can tilt the bike.",
      "funny random idea lol. simple gameplay, unique location, well done :)",
      "A tornado is certainly unique! Fun game concept, although pineapples are pretty random XD",
      "I had such a great time playing this, the title intrigued me and it was literally that, riding a bike in a tornado. I feel like it could be fun if there were more levels with different disasters, like a volcano, a flood, a fire, etc. This is a really fun concept, great job!",
      "Hooked me with the title of your game and ended up having a blast playing it. Awesome job!",
      "You had me at â\u0080\u009cBicycle in a Tornadoâ\u0080\u009d, but then the pineapples have eyes?! Yes! All the stars!!!",
      "I love the setting, its super unique. I also love how the bike moves and how it feels like its being effected by wind. also the little pineapple on the loading screen is very cute",
      "Definitely a unique location! Nice work!",
      "Nice idea and gameplay. The idea is very interesting and it definitely makes you want to see more levels. Great job!",
      "Very interesting idea for a game, I can certainly imagine other levels with different hazards and I think the art and sounds are all good",
      "gooood job 9.9/10",
      "I just played your gam, and overall, I have to say it's pretty epic! The tornado parallax effect in the background is amazing and really adds to the overall concept of the game.",
      "Ill admit, i did not expect to be playing a game where a flying bicycle collects pineapples, but now that ive played it, i have no regrets. nice job!",
      "Quirky concept!  I love it.  Definitely get the sense of it being in a tornado.",
      "Nice and unique setting, and a fun little gameplay loop!"
    ],
    "comments_posted": 6,
    "created_at": "2023-01-14 04:31:36",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876888",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nuzcraft",
      "member_since": "14 December 2016",
      "posts": "67",
      "topics": null,
      "followers": "11",
      "following": "27"
    }
  },
  "1877955": {
    "overal_rating": [
      "Score*",
      "1.732",
      "1.815",
      "1.732",
      "1.650",
      "1.650"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.143",
      "3.000",
      "2.857",
      "2.857"
    ],
    "participant": "shbeeno",
    "game_title": "Blibo and the Lights of the Ashen Lands",
    "platforms": [
      "windows"
    ],
    "rating_count": 7,
    "comments_received": 6,
    "comments_raw": [
      "This is a good start, the movement feels very responsive which is great. I found the perspective a bit confusing (especially since you start right in front of a wall), I thought it was a side-scroller game until I tried to jump haha",
      "Fixed the issue with the folders. Thanks to everyone that told me about it!",
      "Nice simple game with good art.",
      "Nice artwork, some cool gradients and interesting components of the world. Would strongly recommend editing your upload or adding a second download with the fixed folder name, otherwise not many people will give ya a rating ;)",
      "I managed to fix the error by renaming \"GDKO Game Jam Project_Data\" folder to \"BatLotAI_Data\".Cool idea for a character :D",
      "the game doesnt open, it shows an error"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 21:34:09",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877955",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/shbeeno",
      "member_since": "20 December 2022",
      "posts": "2",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1877140": {
    "overal_rating": [
      "Score*",
      "4.250",
      "3.708",
      "3.667",
      "3.458",
      "2.750"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.250",
      "3.708",
      "3.667",
      "3.458",
      "2.750"
    ],
    "participant": "thedevant",
    "game_title": "Blob",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 16,
    "comments_raw": [
      "I played on stream and left feedback throughout my session if you want to watch it. I loved this game. It was right up my alley and I think you put together a very thoughtful layout and level of challenge. Really fun entry. Great work.",
      "This was quite hard (almost too hard), but super fun! I gave up at around 600 seconds at the 1 cube jumps i couldn't get to the top of that thing. I agree with what everyone else is saying about the screen shake, but it is a fun game.",
      "Challenging but well made platformer. Only thing I would change is to relax on the screen shake, it is a little too much.",
      "i really liked the game, it was pretty hard. would love to see more of it! 10/10.",
      "Very annoying game, but in a good way. The game is fun and challenging.",
      "frustrating! So fast paced it is addictive (\"Just one more try!\")",
      "really nice and responsive, nice music and sound design, controls are good, and the art is also not bad, overall really nice little speedrunning platformer game",
      "The sounds and screen shake on death really give a nice atmosphere.",
      "This was a blast to play! Instant replay compensates the difficulty of the game. Great work!!",
      "I love a good speedrunning game. Great level design and the art and theme are nice as well.  As others have mentioned it can be quite challenging as the movement is fast and sensitive.",
      "A super nice clean and polished game. it was very challenging but super rewarding to complete",
      "Simple, but effective.  The artwork and music were both really nice.  Would love to see this in a full game.  Great work!",
      "Deaths = 51, Time = 320 on my first try.  Really great game, the checkpoints were in good positions and the challenge was fair and fun and very well thought out. Love the background art and the music is nicely done",
      "Oh boi i died toooo many times. Love that it has checkpoints :DAlso the juice and the sound fax are pretty good too. Art is honestly just epic.I don't have much to complain about lol, but ig you should make it so that you can press \"W\" to jump.Overall, veri epic game. Enjoyed playing it :D",
      "death 62, time 244 is this a good result? :) i am challenging myself to win with 0 deathes",
      "Under 100 deaths! And what a level bop in the background <3"
    ],
    "comments_posted": 5,
    "created_at": "2023-01-14 12:54:04",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877140",
    "coolness": 42,
    "participant_info": {
      "profile_url": "https://itch.io/profile/thedevant",
      "member_since": "13 October 2022",
      "posts": "27",
      "topics": null,
      "followers": "5",
      "following": "3"
    }
  },
  "1877801": {
    "overal_rating": [
      "Score*",
      "1.402",
      "1.567",
      "1.485",
      "1.485",
      "1.402"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.429",
      "2.714",
      "2.571",
      "2.571",
      "2.429"
    ],
    "participant": "bobdevs",
    "game_title": "Branni: The Pain Killer",
    "platforms": [
      "windows"
    ],
    "rating_count": 7,
    "comments_received": 5,
    "comments_raw": [
      "I like it. Cool game!!!",
      "This was a fun game. It froze after a little bit  so I didn't get to the end, but I'll try it again later.",
      "I liked the concept. The art style is minimalism, but it suited the level really well. I did have a lot of stuttering going on (running on an RTX 3070 with decent CPU and memory), so I'm not sure what was going on there.",
      "Interesting grappling mechanic, fun how much you can fly around in 3D space. Though I couldnâ\u0080\u0099t actually get to the end of the first chamber, and not sure how the gun was meant to help me. From a level design standpoint, it is a little sparse! But I realize I also didnâ\u0080\u0099t see all of it.",
      "The concept seems interesting, but it crashed on my computer. Hopefully it works better for others!"
    ],
    "comments_posted": 7,
    "created_at": "2023-01-14 19:47:05",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877801",
    "coolness": 11,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bobdevs",
      "member_since": "19 December 2020",
      "posts": "35",
      "topics": "2",
      "followers": "1",
      "following": "1"
    }
  },
  "1875605": {
    "overal_rating": [
      "Score*",
      "4.478",
      "4.304",
      "4.087",
      "3.870",
      "4.130"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.478",
      "4.304",
      "4.087",
      "3.870",
      "4.130"
    ],
    "participant": "tenifayiga",
    "game_title": "Buzz Around",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 16,
    "comments_raw": [
      "Played on stream and left feedback throughout the session if you wanted to watch. Gorgeous art and each room told a story. Loved it and would love to see more of this world and the type of game it would be. Great work.",
      "I really want to know what I can see through that telescope. This kind of thing is the part I particularly expect in a game. Keep going!",
      "The artstyle's amazing, I can see this being really good.",
      "Ooh the art style is great, reminds me of Hollow Knight. The wings are a clever way of avoiding walking animations hahaha",
      "Really nice art and a cool concept. I liked all the different meeting rooms, cockpits, balconies and such that made the airship feel real",
      "Wow, this is a brilliant level! Such great design and layout. Wonderful artwork that works perfectly. great colour scheme and altogether wonderful! I'd love to see where this goes!",
      "This is super creative! Love the bee theme mixed with steampunk, very clever and I'd love to see more :D",
      "I like the location up in the sky and the art style is super. Being able to use a tram as well as elevators was really nice way of moving around",
      "my sister loved the different locations. nice job!",
      "my sister loved the different locations. nice job!",
      "Interesting take on location and well-built level. Good job!",
      "Damn this is giving me crazy hollow knight vibes.  Cool world, nicely done.",
      "Nice work! Your hexagonal art-style is very cohesive, and the little animated touches inside the ship really help the level feel alive!",
      "Great art style and an interesting idea, I'd love to see this more fleshed out.",
      "",
      "Can tell you put an large amount of thought into the artwork.  The bee theme is really well done.  I would love to see more of this style (even outside of the game jam)."
    ],
    "comments_posted": 5,
    "created_at": "2023-01-13 04:20:15",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875605",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/tenifayiga",
      "member_since": "03 December 2018",
      "posts": "69",
      "topics": "1",
      "followers": "8",
      "following": "1"
    }
  },
  "1874046": {
    "overal_rating": [
      "Score*",
      "4.000",
      "3.708",
      "3.667",
      "3.208",
      "3.083"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.708",
      "3.667",
      "3.208",
      "3.083"
    ],
    "participant": "total222",
    "game_title": "Cave of wonders",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 12,
    "comments_raw": [
      "Very cool, and it feels good to play. Though jump should be on up arrow too.",
      "Really enjoyed playing this on stream. I'm still trying to wrap my head around how such a simple look can be so dang captivating. I want to continue this adventure!",
      "I like how he stands out against backgrounds. And I like the backgrounds, kind of remind me of some combination of woodcuts/watercolor/geometric design.",
      "brilliant art style! love how simple yet different it is",
      "really fun game with great controls, id love to see more of it",
      "I love this sort of minimalistic style.  And the chiptune music really helps with that feel, too.  Really curious to see where you go with this.  Nice job!",
      "Loved the world and roaming through it.",
      "Love the character design :)",
      "I like the aesthetics of the game and being able to interact with the animals and the warning sign at the start is really cool. Can't wait to see what is inside the cave. The little pause and transition to restart the game when fallen down a pit is really nice too and I also like the variable jump height of the character",
      "Remember to credit your asset pack!https://v3x3d.itch.io/paper-pixel",
      "Really nice little game. loved the dialogue and the art style is very nice",
      "The simple art style is very pleasing. Great start."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-13 13:35:47",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1874046",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/total222",
      "member_since": "28 November 2022",
      "posts": "28",
      "topics": null,
      "followers": "2",
      "following": "8"
    }
  },
  "1864258": {
    "overal_rating": [
      "Score*",
      "4.029",
      "4.343",
      "4.200",
      "4.000",
      "3.486"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.029",
      "4.343",
      "4.200",
      "4.000",
      "3.486"
    ],
    "participant": "r3games",
    "game_title": "Clockworks 1-1",
    "platforms": [
      "web"
    ],
    "rating_count": 35,
    "comments_received": 24,
    "comments_raw": [
      "Love it! You might want to add checkpoints.",
      "My first thought was another hard platformer but then I got use to the controls. Character feels great to control and I really like the simple art work.",
      "niiiice art style! I found it too frustrating lol, but was good looking game.",
      "I love this art style, it feels really polished and clean. I enjoyed the double jump a lot too, I found that super fun, and how you let the player figure it out, instead of outrightly saying there is a double jump, you let the player experiment and find out themselves!",
      "Well done all around.  The color palette works really nicely.  Challenging, but not brutally hard platforming.  Really looking forward to seeing more from this game.  Great work!",
      "This is really awesome! when you got to the first pipe at the end of the first level, i was really wanting more.. and bam! Looking forward to seeing what you do next!",
      "Very polished game!",
      "Very nice art, all the elements work very well together.",
      "Nice artstyle and movement! Please add checkpoint I am literally dying in real life because of this game! 5/5",
      "Being inside a pixelart clocktower with pipes and acid, was nicely conveyed with chains, animations and the tileset. Nice effects!",
      "Plays really nice, love the animation of the background and it's a great first level. My only wish would be if the pipes served as checkpoints as it can be a little frustrating if have to restart at the beginning",
      "The art of this game is great!",
      "Great job! Juicy but a little difficult for me.",
      "I love the idea of being in a clock! But the moving platforms just seem a bit off . I don't know how to say it honestly.One thing you could try is making every platform move with the beat of the clock, like the platform moves a bit every second instead of it being just constant.Also, for some reason, I kept slipping off the platforms, like if I was on the edge I just kinda...fall. That was kinda annoying ð\u009f\u0098\u0095.But OH BOI art was amazing. Honestly love the platformer controls (except that part where i fall of a platform when i am too near an edge) like honestly like the slipperiness in it. Also the levels were pretty good imo :))",
      "Great job! Other than location which could use more justification for being unique, I really like the game. Controls feel great which is the point.",
      "Art and effects are really awesome! Maybe there is little lack of uniqueness but great stuff anyway",
      "simple but extremely polished :)",
      "A fellow game entry that deals with clocks in some manners! Very nice art style, bold but still smooth in a way, and the green ooze with those animations are fantastic. Iâ\u0080\u0099m sure I didnâ\u0080\u0099t get to see all of it since Iâ\u0080\u0099m not very good at platformers ha, so I guess itâ\u0080\u0099s accurate to say indeed â\u0080\u009cI would want to see more levels of this gameâ\u0080\u009d .. but also checkpoints :)",
      "Very clean, very clean indeed. Wish the camera moved down when you do though! In case you fall...",
      "Super clean and polished 2d platformer with great art and physics.",
      "I was so sad when it ended, which is the highest compliment I can think of. I loved it and want more of it. Had a great time on stream. This one is right up my alley. Excellent work.",
      "Im terrible at platformers so I didnt get far but it was a beautiful experience the entire time! Im kinda obsessed with your bright well animated but minimal pixel art.",
      "Nice game! The movement and graphics were very satisfying.",
      "Great artwork, found it quite tricky though :P"
    ],
    "comments_posted": 4,
    "created_at": "2023-01-06 10:05:02",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1864258",
    "coolness": 11,
    "participant_info": {
      "profile_url": "https://itch.io/profile/r3games",
      "member_since": "29 April 2020",
      "posts": "72",
      "topics": "1",
      "followers": "9",
      "following": "2"
    }
  },
  "1873185": {
    "overal_rating": [
      "Score*",
      "1.455",
      "1.455",
      "1.164",
      "1.164",
      "1.018"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.222",
      "2.222",
      "1.778",
      "1.778",
      "1.556"
    ],
    "participant": "issah45",
    "game_title": "Collectier",
    "platforms": [
      "windows",
      "linux"
    ],
    "rating_count": 9,
    "comments_received": 6,
    "comments_raw": [
      "This was great. My main critique is that I wish the screen wrapped so I could move around even more freely. Getting the speed boost was a nice addition. Well done.",
      "Pretty fun, Audio was a bit loud but aside from that, good stuff!",
      "Pretty nice little game. The game play was fun and the art was good, the sound effects were a bit too loud though",
      "Concept is cool, reminds me of a bullet heaven type genre.",
      "Interesting mechanic how the speed boosts stack, could be interesting to see how other picked up abilities stack together.",
      "This was fun and relaxing to play."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-11 13:04:55",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873185",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/issah45",
      "member_since": "16 April 2021",
      "posts": "6",
      "topics": null,
      "followers": null,
      "following": null
    }
  },
  "1876920": {
    "overal_rating": [
      "Score*",
      "3.981",
      "4.000",
      "3.943",
      "3.623",
      "3.245"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.981",
      "4.000",
      "3.943",
      "3.623",
      "3.245"
    ],
    "participant": "game-dav",
    "game_title": "Comet Rocket - GDKO 2023 - Round 1",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 53,
    "comments_received": 37,
    "comments_raw": [
      "Nice work! It's always comfortable to explore the map and then talk with different characters.",
      "The game has such a calm vibe to it! Awesome!!",
      "I really like the environment and graphics. Good job with the gravity effect!",
      "I had already liked your game when you posted on discord, but playing it adds much more to the experience. Great atmosphere, visuals and music!",
      "Very pretty game, nice art and cute npcs, good job :)",
      "I don't even know where to begin with this comment! I kept seeing progress of your work in discord, but I was visiting sporadicly and caught only glimpses. This is fantastic!First, the mechanics of the ship with the four thrusters, the star at the center fitting not only the story but also creating a gravitational pull that the player actually has to work with was wow!Art styles with limited palettes is something I adore, and your planets really looked beautiful in the background with small details like cacti (genius). And while I was cruising around space jumping around my very own star, I notice a happy square fellow just vibing at the back.",
      "Perfect ratings from me! Awesome job, man.",
      "Thank You!",
      "my only problem with this gale is that there arent more levels, it has a nice atmospheric feel and great controls",
      "The ship itself is really interesting, I would love to see more interesting mechanics involving it",
      "love the main mechanic of controling the guy and the planet and the level looked amazing",
      "thank you!",
      "",
      "It was fun seeing the progress you were making on this on the Discord server.  It came together really nicely.  Music, art, and sound design are wonderful.  Would like to see a little more of an \"objective\".  But definitely a game I'd love to see fleshed out more.  Great work!",
      "I love the art and atmosphere and music of this so so much, it all ties together and is so good. I really like moving the player and planet separately as well. One thing that bugs me is how everything goes all glitchy when you get to the border, maybe instead there could be a fade to black or something? To make it more clear that it's a border, and hide the glitch. I love this, and I hope you get through to the next round!",
      "Really cute game! I love the aesthetic, music, and sound design! The style is super cool! :D",
      "Interesting environment and i really like the art and music, bit confusing what your supposed to be doing is tho.",
      "I really like how you can control the comet rocket as well as the guy inside. Art is really well done and those aliens are cool to talk to. I think having a wrap screen would be beneficial. Music is perfect love all of the animations",
      "Very cute environment, I remember seeing screenshots and love the way the spaceship maneuvers separately from the pilot himself!",
      "This is so good. I've been watching the development of it over time and it came together so well. I loved hunting for more aliens to talk to. And the movement sound and art design is beyond satisfying.",
      "This was cool. My computer is super weak so I was getting basically 2FPS, but thankfully this is just a level. I liked the blue art style too, and the ship was a cool idea.",
      "Rocking it in my rocket. Had a great time with this one on stream. Thanks for sharing and I look forward to what you make next.",
      "Nice aesthetic and mood / location.  Nice job on keeping the scope to the task, I have a feeling it may help you on future rounds as you can probably implement a few different game styles from this setting.",
      "Nice job, I saw your development progress in the discord server and I have to say that this looks cool. There are some very small bugs like sometimes when you walk and jump at the same time, it still looks like the character would be walking in the air. Also when going to the boundaries of the map it seems to be jumping back to the area. And last thing is if I press for example A and W at the same time, the planet will move towards the top left corner but only 1 of the thruster is on. But overall it's a very good game!",
      "Dav, bud, this was brilliant. It's been excellent seeing the updates in the discord and well....it's lived up to the hype, really great atmosphere. The worldbuilding's excellent too!",
      "Unique idea for sure, and such attention to detail with all the little planets and variety. Nice style and atmospherics too with the music and sound effects.",
      "This is a really cool idea and I love the art style.",
      "It's really cool to be moving a whole planet* around, the idea of that is cool. There are probably a lot of ways you could take this project. Something about this makes me think it could become something special. It's like Fez where it's a unique mechanic. But the calming music and simple yet still effective graphics make me think Seiklus. I'm not sure which direction you'll take it, but I'm interested in seeing how this project evolves. Also, the flame effect is really cool.",
      "Pretty darn kool :)",
      "What a brilliant idea to move the ship and the people in it using different controls.",
      "This was a great experience and you can see how much love is put into every detail of this game: from the sounds and the colors to the aliens and their dad jokes (Especially the dad jokes). It was great to play this and I definitely would love to see more of it! 10/10",
      "super cool! love how you move both the character and ship!",
      "Nice idea for the round ship. great sound effects and music to bring it all together. I also liked the colour palette you chose :)",
      "From looking at other comments I'd agree that a little direction for the player could be nice.  Besides that, though, the controls feel really great and the art has an amazing charming and mysterious feel to it.  Great job.",
      "Really charming aesthetic! I enjoyed getting to chat with all the aliens. Nice work!",
      "Interesting game idea. It needs more help for the player (as an example: I didnâ\u0080\u0099t knew where I had to go)",
      "I would love to try your game but my potato PC lag so much for HTML games... is there any way to add an EXE version ? I would understand if not, but at least I try ahah."
    ],
    "comments_posted": 93,
    "created_at": "2023-01-14 22:51:38",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876920",
    "coolness": 98,
    "participant_info": {
      "profile_url": "https://itch.io/profile/game-dav",
      "member_since": "23 January 2021",
      "posts": "934",
      "topics": "19",
      "followers": "24",
      "following": "14"
    }
  },
  "1874856": {
    "overal_rating": [
      "Score*",
      "4.115",
      "4.115",
      "4.308",
      "4.154",
      "3.808"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.115",
      "4.115",
      "4.308",
      "4.154",
      "3.808"
    ],
    "participant": "sijilum",
    "game_title": "Crafts and Combat",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 15,
    "comments_raw": [
      "A crayon Kung-Fu. I loved playing this one on stream. Really well done. The little roll was so satisfying.",
      "Thatâ\u0080\u0099s really cool! 5/5",
      "Really cool and effective paper level.",
      "great little idea! Interesting use of different paper and teleporting between them",
      "This is super fun! I love how being a drawing can make the level more interesting as you jump from paper to paper.",
      "Considering how simple the art and graphics are there's a lot of attention to detail that really makes it shine.  Great job.",
      "Smash Bros vibes, I love it!",
      "Awesome fighting game! Also fits the theme of the game jam really well! Great job on the combat too!",
      "I love the music and sound effects, and your concept is really fun to play and unique!",
      "this game is cool and id love to see more, but i feel that the attacks kind of lack some diversity, usally those kind of games especially stickman fights have more than just kick and punch, especially that in your case we can kick while in the air and punch while n the ground, the locqtion in itself isnt really unique but the way the level is presented is, overall a great game",
      "This is really cool. Love the way the character animates when attacking and rolling, especially those jumping head kicks. Everything just feels right about it, I can see see this doing really well in this jam",
      "THIS IS veri epic, this a pretty cool and satisfying fightinz gaem. The concept is cool and the gameplay is satisfying.",
      "Honestly this submission blew me away. Everything feels polished, the animations are spectacular and satisfying, and the level is simple yet very effective.",
      "Really cool, I love the whole arts and crafts theme and could see some interesting future mechanics with that in mind.",
      "Its the small touches in this game that blow my mind. like when you jump run and land on the ground you roll or how if you punch in the air you kick. plush the sound effects and music are on point"
    ],
    "comments_posted": 6,
    "created_at": "2023-01-14 22:42:55",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1874856",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "111",
      "topics": null,
      "followers": "34",
      "following": "10"
    }
  },
  "1861135": {
    "overal_rating": [
      "Score*",
      "2.286",
      "2.190",
      "2.143",
      "1.810",
      "1.762"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.286",
      "2.190",
      "2.143",
      "1.810",
      "1.762"
    ],
    "participant": "creatorgaming",
    "game_title": "Creator Apocalypse",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 6,
    "comments_raw": [
      "Something about shooting enemies on Mario tiles felt wrong, but so right! I played this on stream and left feedback if you haven't had a chance to watch the playback. Good job.",
      "This was super fun, I really enjoyed this game, especially just spinning around and shooting all of the enemies, the music was great too!",
      "Fun game! Had a blast playing it! Great job, dev!",
      "This a pretty fun game. the art is simple but good and blasting away the enemies are fun",
      "Interesting mashup of biomes, would be interesting to see some of the mechanics somehow change if you entered one area or another, or different enemies spawn (maybe if you lure a tough enemy from its original region to another, it becomes easier to defeat?)",
      "I made something similar to this before, so I know how much work goes into this.  Great job!"
    ],
    "comments_posted": 1,
    "created_at": "2023-01-03 09:59:10",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1861135",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/creatorgaming",
      "member_since": "12 November 2021",
      "posts": "168",
      "topics": "4",
      "followers": "16",
      "following": "94"
    }
  },
  "1873766": {
    "overal_rating": [
      "Score*",
      "2.932",
      "2.700",
      "2.546",
      "2.469",
      "2.237"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.750",
      "4.375",
      "4.125",
      "4.000",
      "3.625"
    ],
    "participant": "ashashza",
    "game_title": "Daydream",
    "platforms": [
      "windows"
    ],
    "rating_count": 8,
    "comments_received": 6,
    "comments_raw": [
      "Really liking the ghostly yet warm atmosphere. Controls felt a little slippery, particularly paired with some interesting colliders which sort of throw you in the air even if you didnâ\u0080\u0099t jump, but this round isnâ\u0080\u0099t about character movement so no sweat in that regard! Curious to see how this develops.",
      "This was such a great game! the concept and setting is super unique with the hands as platforms. my only gripe is the controls were a little finicky at some spots like the last two sections where you had to navigate on sloped platforms and jump off the tiny fingers.",
      "Absolutely beautiful! The lighting and fog is spot on. As this was a level design challenge I think it's only fair to comment on that!",
      "Great looking level and an interesting concept.",
      "A level made out of hands is very creative! I'm interested to see what direction this project takes if it advances :)",
      "this game looks epic, the visuals, the hands, the particles, everything i just wanted to see more gameplay but i think if the creator had more time to actually put some gameplay it wouldve been perfect"
    ],
    "comments_posted": 5,
    "created_at": "2023-01-11 20:25:00",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873766",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ashashza",
      "member_since": "30 January 2019",
      "posts": "189",
      "topics": "1",
      "followers": "99",
      "following": "54"
    }
  },
  "1877818": {
    "overal_rating": [
      "Score*",
      "4.190",
      "3.619",
      "3.857",
      "4.000",
      "3.619"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.190",
      "3.619",
      "3.857",
      "4.000",
      "3.619"
    ],
    "participant": "gastricsparrow",
    "game_title": "Desktop Defender",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 14,
    "comments_raw": [
      "This is so cool",
      "This was a fun challenge! I loved the little computer shooting animation!  I would love to see the other upgrades and how they work if you continue developing this.",
      "Felt good typing fast lol! I kept trying to click things but eventually figured out... TYPE EVERYTHING. good job",
      "when the computer switched to shooting mode I was left speechless.Great idea, nice execution, I really liked how you showed off your ideas that were not complete yet!",
      "I really enjoyed this! The difficulty does ramp up a bit too quick for my liking, but with some polish, I could see this being an excellent game. Great work!",
      "This is a really great game. I got to the number viruses and that's when my fingers fumbled. Love so much about it and it's awesome that I can see the things that you had planned to do as well, which all look ace",
      "",
      "Fun concept, I managed to make it to the wave with 10 longsword 10 numb3rz but as others have said it gets very difficult very fast. In terms of visuals and design though, it was fantastic and I loved it!",
      "Very nice concept. I like how the art style also fits very well. Good job.",
      "-how many times you tried to win level with 10 weak 8 longword 2 numb3rz?-yesenjoyed it!",
      "It's a fun game, but the difficulty increases really fast and the mailbox does basically nothing.",
      "I like the way you have to type to defeat enemies reminds me of those old typing computer games. the art nice and I like how it replicates a desktop pretty accurately, like with the pause menu.",
      "Interesting concept.  Tower defense meets typing?  Nice.  Could see this being pretty fun if you had the time for some of the other upgrades.",
      "I think its pretty good! ofc you ran out of time so you basically dont have any upgrades. and the game is way too hard. but i like the theme, and i like typing games."
    ],
    "comments_posted": 10,
    "created_at": "2023-01-14 19:40:37",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877818",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gastricsparrow",
      "member_since": "06 September 2017",
      "posts": "59",
      "topics": null,
      "followers": "20",
      "following": "8"
    }
  },
  "1878090": {
    "overal_rating": [
      "Score*",
      "1.897",
      "1.485",
      "1.237",
      "1.402",
      "1.320"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.286",
      "2.571",
      "2.143",
      "2.429",
      "2.286"
    ],
    "participant": "rlybadday",
    "game_title": "Desktop x Hill",
    "platforms": [
      "windows"
    ],
    "rating_count": 7,
    "comments_received": 5,
    "comments_raw": [
      "Maximum levels of screen shake achieved. 10/10",
      "pretty ok game. nice art and effects, and cool concept",
      "Interesting idea, I think it needed play testing a little more as I ran into the issues previously mentioned also.",
      "I couldnâ\u0080\u0099t figure out what to do with the computer heh but interesting concept to have to toggle between some virtual task and then shooting back in the â\u0080\u0098real worldâ\u0080\u0099 on the same timescale. I feel there was a tad too much motion blur though.",
      "art style looks not bad, but the gameplay isnt that good the enemies escape out of the screen and i dont know what the objective is."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 23:47:25",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878090",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rlybadday",
      "member_since": "30 July 2021",
      "posts": "3",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1876165": {
    "overal_rating": [
      "Score*",
      "2.905",
      "2.784",
      "2.602",
      "2.421",
      "2.179"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.692",
      "3.538",
      "3.308",
      "3.077",
      "2.769"
    ],
    "participant": "dementedsoul",
    "game_title": "Dreamblade",
    "platforms": [
      "windows"
    ],
    "rating_count": 13,
    "comments_received": 8,
    "comments_raw": [
      "Massive and impressive space. Really beautiful and the endless jump was appreciated to more quicly get to take it all in. Really well done. Great work.",
      "Its looking nice but it doesnâ\u0080\u0099t have any gameplay. 4/5",
      "Great looking level.",
      "Super cool entry! the map looked amazing and It felt super big and grand.",
      "Definitely an ambitious entry trying to build a world of this size! Nice work, and fun to have these crisscrossing tunnels.",
      "I was blown away by the graphics! Is there a goal at the moment?",
      "Please leave your comments when finished so I know who has already rated it. Thank you",
      "Beautiful environment and music, loved the scale of everything, and would love to see where you take this gameplay-wise if you build off of it!"
    ],
    "comments_posted": 6,
    "created_at": "2023-01-13 16:22:42",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876165",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dementedsoul",
      "member_since": "17 February 2021",
      "posts": "36",
      "topics": "2",
      "followers": "11",
      "following": null
    }
  },
  "1876245": {
    "overal_rating": [
      "Score*",
      "4.050",
      "3.855",
      "3.952",
      "3.416",
      "3.074"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.150",
      "3.950",
      "4.050",
      "3.500",
      "3.150"
    ],
    "participant": "da-dam",
    "game_title": "ESC. (GDKO 2023 - Round 1)",
    "platforms": [
      "osx",
      "linux",
      "web"
    ],
    "rating_count": 20,
    "comments_received": 11,
    "comments_raw": [
      "Whoua great game but this got me raging bro. Like it tho",
      "greaaaaaaat job, one of the best games of the jam! imho!",
      "I am the ultimate scapegoat ... wait that's not right. Ultimate escaper ... escape artist. That's it. I'm the greatest escape artist! Loved, loved this entry. Was one of my favorite plays while streaming so far. I think you heard all the feedback there, but great job giving me that gamer high when I finally reached the end.",
      "Great accomplishment. Wonderful use of art and feel good speedy character. Obviously you know the points about the difficulty so I won't bother saying, and it is not a task about gameplay anyway.  looks nice and has a flow in the level which is good.",
      "I hate it. 5/5",
      "I agree with others about the difficulty, maybe a practice mode with checkpoints and no chasing would have made learning the level less frustrating? The art is great and it was still fun to beat, here is myspeedrun video",
      "Wow. What can I say, this is absolutely brilliant. Probably the best I played so far in this jam and I've played a lot. The art is astonishing and love the movement feel and abilities of the character. As others have mentioned, it is definitely on the steeper side of the difficulty curve. I managed to get past the two drop down sections and then a little way up the next up section in my first 15 minutes of playing, which is probably about 13 seconds of gameplay, I died a lot but learned with it. I would love to see a video of the whole level or know if I was close to beating the level? I think the shadow chasing the player is really cool but probably work best as a last level boss. I think introducing the character's abilities in a safer place for a first level would work best but I must admit I did enjoy playing this game a lot and may have to come back to it and see if I can complete it",
      "I have a lot to say so here we go.First the positives. The art is absolutely amazing and I love the use of particles for the thing chasing you and the hazards. the player also controls really nicely feeling super tight, snappy, and responsive. But there are some Negatives as well. Like many have already said the game is brutally difficult, it took me almost 45 minutes to complete. A lot of that is down to two parts in the game that made it kind of frustrating to play, the level design and the death.",
      "Dark souls level of difficulty but visually great and gameplay is rewarding when you hit the right notes.",
      "Damn this game is quite hard but really fun. I could see this becoming a popular speed running game with way more levels.",
      "Very challenging! I can definitely see this as a couple levels in where youâ\u0080\u0099ve gotten a chance to deal. You have some unforgiving placements of those pesky slime walls :p Nice art style, popin music, well done."
    ],
    "comments_posted": 10,
    "created_at": "2023-01-13 23:20:49",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876245",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/da-dam",
      "member_since": "10 June 2020",
      "posts": "52",
      "topics": null,
      "followers": "5",
      "following": "2"
    }
  },
  "1878100": {
    "overal_rating": [
      "Score*",
      "3.286",
      "2.905",
      "3.143",
      "2.810",
      "2.762"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.286",
      "2.905",
      "3.143",
      "2.810",
      "2.762"
    ],
    "participant": "bluegamemc",
    "game_title": "Escape Velocity",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 11,
    "comments_raw": [
      "Played on stream and left feedback throughout the session if you wanted to watch. Really impressive including two different style of gameplay but keeping atmosphere, art style and world cohesive. Well done.",
      "That was a lot of fun! I was lowkey terrified in the maze haha. I think the music choice and the story text really helped elevate the level and the story. I would love to see how you build on this! If possible I think the space area could be improved with:",
      "Enjoyed it, the space theme is very generic though, and it's easy to lose yourself in the maze.",
      "I enjoyed the game, and the maze sequence was a nice twist.",
      "The first part of the game was what I liked the most but the maze was well made too and having the line on the walls was a nice touch. The asteroids and the collision it makes looks and sounds super cool and if there is one feature I would want it would be having the option to invert the axis of the controls",
      "Its a nice game but you basically made 2 levels. Not a bad game but your game counts as 2 levels",
      "Controls felt nice.  There wasn't a lot of contrast on the asteroids (at least on my computer).  It made it hard to move out of the way in time.  All in all, though, a good submission.  Curious to see where you go with this.",
      "I really enjoyed the controls of the ship It felt super fun to weave through asteroids or dodge one at the last second. the models while not super complex were still really nice",
      "I have to say the setting of a spaceship flying though an asteroid field is not the most unique, but it is still an interesting level nonetheless and I enjoyed playing it.",
      "Major props to the sound and music. It really sold the atmosphere and intensity. I always felt under the pump and like I was in an action movie! Could use some minor polishing such as textures, and a starry background",
      "It was hard to see the asteroids on my computer until they were too close, so it was mostly luck that got me through. I loved the maze, I'm always happy to play through a maze."
    ],
    "comments_posted": 7,
    "created_at": "2023-01-14 23:49:18",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878100",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bluegamemc",
      "member_since": "23 January 2022",
      "posts": "154",
      "topics": "7",
      "followers": "1",
      "following": null
    }
  },
  "1870211": {
    "overal_rating": [
      "Score*",
      "2.829",
      "3.138",
      "2.675",
      "2.623",
      "2.315"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.056",
      "3.389",
      "2.889",
      "2.833",
      "2.500"
    ],
    "participant": "lucky2337",
    "game_title": "Escape the dungeon",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 6,
    "comments_raw": [
      "I am a master escaper ... even if I'm not sure what the Easter egg was! Had a great time with this on on stream. Great work.",
      "Exploring about was fun! Good stuff",
      "Pretty cool game! I liked the models and exploring the dungeon was very fun",
      "While Iâ\u0080\u0099d say the normal maps are a tad overdone, Iâ\u0080\u0099m overall kinda amazed this runs on web so smoothly, and quite a large area you covered! Also a clever idea to have sort of â\u0080\u009ctasksâ\u0080\u009d to force us testers of your level to seek out different places, very smart move. Nice work.",
      "The graphics are amazing! I wasn't able to find the easter egg but it was fun searching for things and seeing what the dungeon looked like. I don't think using ctrl key is good for a button because it is a shortcut for stuff so if someone presses ctrl + w it closes the program. I like that you have the ability to crouch and the camera and general movement is nice",
      "Interesting idea.  I'm curious to learn what it was my character did though...  Why am I there in the first place?  Leaves me wanting more, you know?"
    ],
    "comments_posted": 1,
    "created_at": "2023-01-14 23:19:21",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1870211",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lucky2337",
      "member_since": "03 January 2023",
      "posts": "143",
      "topics": "4",
      "followers": "2",
      "following": "1"
    }
  },
  "1877987": {
    "overal_rating": [
      "Score*",
      "3.655",
      "3.955",
      "3.905",
      "3.705",
      "3.354"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.842",
      "4.158",
      "4.105",
      "3.895",
      "3.526"
    ],
    "participant": "theduckcow",
    "game_title": "Escherport Concept",
    "platforms": [
      "windows",
      "osx"
    ],
    "rating_count": 19,
    "comments_received": 12,
    "comments_raw": [
      "This could have some cool puzzles in it using the mechanic. There's a movie \"Cube 2: Hypercube\" that did a lot with odd time mechanics. So far, it was fun just walking around and seeing the sun changing.",
      "I love how thoughtfully everything was placed and really enjoyed exploring what you created on stream. Really well done.",
      "Time seems to move according to the player's position, if you are on the beach, the clock shows 3 o'clock, but if you are in the castle it may be 12 o'clock, and if you are in the market the clock shows 9 o'clock. If you enter the castle from the beach, the castle door is closed indicates that it is already night. I don't know if that's true :)",
      "Thanks for the positive feedback and giving it a try!",
      "Really great shapes for the models. Nice idea with a looped, time changing world! Great job",
      "This is really cool!",
      "Okay you got me in this labyrinthic/never ending level ahah. Also got surpised by the time shifting, with the clock moving and all, I can see great puzzles to be done ! Visuals and gamefeel gave me a Sea of Thieves vibe which I really like, well done !",
      "Really awesome level! I loved the way the clock face turned  when you went to the different areas, and the 3d models were super good. the only small thing is that sometimes I could see the models appearing when I entered a new area",
      "Really cool level to walk through.",
      "Really cool! The day/night mechanic with the arch and the door made me think of some sort of puzzle element. Nice work!",
      "Beautiful models and world design.  The day and night cycle is really cool, and the door closing at night and the clock moving is a nice touch that really brings the whole thing to life.",
      "Really fantastic art style, also love the day and night cycle which I didn't even notice at first! I would love playing an RPG in this environment."
    ],
    "comments_posted": 68,
    "created_at": "2023-01-14 22:10:22",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877987",
    "coolness": 72,
    "participant_info": {
      "profile_url": "https://itch.io/profile/theduckcow",
      "member_since": "30 January 2021",
      "posts": "269",
      "topics": "3",
      "followers": "23",
      "following": "9"
    }
  },
  "1871112": {
    "overal_rating": [
      "Score*",
      "2.911",
      "3.176",
      "3.281",
      "3.123",
      "3.017"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.235",
      "3.529",
      "3.647",
      "3.471",
      "3.353"
    ],
    "participant": "foozlecc",
    "game_title": "FOOZLE - GDKO 2023",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 7,
    "comments_raw": [
      "The models are great, and the fact that you made a 3D game in Construct 3 is crazy, I really enjoyed exploring the world.",
      "I had a great time playing with you on stream. Excellent entry and thanks for giving me the live tour. What you put together is so incredibly technically impressive, but also a cool location and well-thought out level. Top marks. I did jump back in off stream and it didn't have any slow-downs or hiccups. I still couldn't make the jump out of the lava back onto the ground though (if that's even possible).",
      "Absolutely insane to have made a whole mini MMO in just 2 weeks. on top of that the models are really nice",
      "Okay this was really impressive for a 2-week game jam! This is awesome! Have an extra star from me.",
      "Wow.  I was NOT expecting something like this for a 2 week game jam.  Performance was a little slow on my computer.  But even with that, I still wanted to explore more of this world.  (Especially the ren faire attire.  Could use a new coat for this year!)  Great work all around!",
      "Really impressed with what you've built, the 3D textures are really nice and the whole scale of everything is awesome to see. I would love to be able to run a little faster but apart from that it's a really epic environment",
      "This being a fully 3D construct level is in itself a unique location. Vandervas Generator knows all too well the pain of wrestling with the fake 3D systems - well done!"
    ],
    "comments_posted": 8,
    "created_at": "2023-01-13 23:14:10",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1871112",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/foozlecc",
      "member_since": "13 January 2020",
      "posts": "203",
      "topics": "4",
      "followers": "1,220",
      "following": "45"
    }
  },
  "1875992": {
    "overal_rating": [
      "Score*",
      "3.417",
      "3.542",
      "3.417",
      "3.292",
      "3.167"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.417",
      "3.542",
      "3.417",
      "3.292",
      "3.167"
    ],
    "participant": "puree-adventure",
    "game_title": "Fishing With Dad",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 13,
    "comments_raw": [
      "Top marks. This was so fun on stream. I'm slightly smarter than I look. My only real request would be for a move counter. I was obsessed with trying to complete all puzzles in five moves or less. Well done.",
      "Nice puzzle game. Could be fun to incentivize your better decisions by having a turn counter (or having a max limit, for that last puzzle I kinda just mashed until I solved it haha)",
      "Cool style and I loved the puzzles.",
      "Very cool style. Besides what's already been said, I really liked the colors and the effect on the bg water.",
      "Firstly, I loved the hover effect in the title screen so much! The art style is incredible, this whole game is just so stunning! The atmosphere is so calming, and a bit emotional as well",
      "I love this game for this kind of flat fish is very delicious!",
      "Amazing game, I generally wanted to play more and then it ended :(",
      "Really fun little puzzle game! Surprisingly atmospheric, and a joy to play. Great sounds and effects. Nice work!",
      "Such a fun game. the puzzles were challenging but rewarding. and I love the style.",
      "great style, nice UI!",
      "i thought ahnaf30e was joking but when i played it, it actually was surprisingly emotional even though there were just three puzzles and roughly 3 minutes of gameplay, I have no idea what wizardry you did to make me emotional over some (really good/well designed) fishy puzzles, but i applaud it.",
      "This game has truly been an emotional rollercoaster for me. I have felt a wide range of emotions all at once, and I honestly don't know how to express them all. The characters have evoked feelings of sadness, anger, happiness, and excitement all within the same 5 minutes of playing. I felt like I was truly a part of the game's world. The soundtrack has also added to the emotional intensity, with its powerful and moving melodies. Overall, this game has given me an experience that I will never forget and has left me with a sense of awe and wonder. I can say that it has truly been a journey that has left me with a range of 10 different emotions all at once.Overall, Very epic and beautiful game.",
      "unique game engine, i like to solve it"
    ],
    "comments_posted": 7,
    "created_at": "2023-01-14 21:26:49",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875992",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/puree-adventure",
      "member_since": "10 May 2021",
      "posts": "242",
      "topics": null,
      "followers": "127",
      "following": "37"
    }
  },
  "1877534": {
    "overal_rating": [
      "Score*",
      "3.174",
      "2.001",
      "2.208",
      "1.932",
      "1.725"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.600",
      "2.900",
      "3.200",
      "2.800",
      "2.500"
    ],
    "participant": "snakewinter",
    "game_title": "For Those Who Have Been Consumed By An Apple...",
    "platforms": [
      "windows"
    ],
    "rating_count": 10,
    "comments_received": 8,
    "comments_raw": [
      "Very nice unique location, the dialogue between the different people is great and I love reading the posters on the walls. I feel like the apple stomach acid could stand out a bit more against the white floors but love all of the other things like how it rises and lowers. The camera and movement in the game is done really well and like how you've done the stairs",
      "You had me at Max Trust. Really quirky and unique entry. Well done.",
      "I have never hated a video game character more than the \"Princess\" - and she had like two lines. Incredible writing.",
      "It was a bit weird, the kind of weird I like.",
      "Cool game! I liked the concept and the NPC dialogue was funny",
      "Unique location; I agree with the comments regarding colour. I think some more work around the aesthetic and it could turn out good.",
      "Unique and terrifying, I too know not what I just experienced. But I appreciate the humorous details in the poster work. Bright colors or uniform lighting could be turned down, right now all the surfaces kinda blend together in a uniform color.",
      "i gotta say, inside an apple is the most unique location there can be. also what did i just play"
    ],
    "comments_posted": 14,
    "created_at": "2023-01-14 17:31:53",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877534",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/snakewinter",
      "member_since": "29 August 2021",
      "posts": "155",
      "topics": "1",
      "followers": "55",
      "following": "5"
    }
  },
  "1876742": {
    "overal_rating": [
      "Score*",
      "3.404",
      "3.504",
      "3.454",
      "3.204",
      "2.603"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.579",
      "3.684",
      "3.632",
      "3.368",
      "2.737"
    ],
    "participant": "headband-house",
    "game_title": "GDKO 2023 - Round 1",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 10,
    "comments_raw": [
      "Had a great time playing this on stream. Thanks for letting me know to queue it up on my post in the community section. Like I said when streaming, I want in that cave!",
      "Atmosphere's amazing, I agree with previous commenters that the movement's quite slow, but this is a great display of potential.",
      "The atmosphere is amazing and really fits the location well. I love the slight swaying of the plants too!",
      "Great atmosphere! Great artsyle!",
      "Good effects! But I dont know how about others, when I opened the door to cave, game began lagging, however I lke the engine",
      "Awesome mechanics! I also loved the sound effects. Thank you for submitting this and great job!",
      "The atmosphere under the sea is caught really well and I love the artwork and am left anticipating for what happens next",
      "This game was really good! the art was great and I loved the sound effects. My only problem is the sub moves a bit too slow",
      "Iâ\u0080\u0099m ready to relive the Atlantis experience haha, nice sound and sense of slow moving underwater movement. I like the swaying seaweed motions, and how foreboding the depths are.",
      "man this game is great. i am super excited for the next level. the atmosphere is so amazing, i was genuinely scared. from the sluggish movement, to the deep sea area, to the ambience, to the mystery, man its just so good! not really much gameplay but the snipit of atmosphere is so amazing. great game!"
    ],
    "comments_posted": 1,
    "created_at": "2023-01-14 00:03:24",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876742",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/headband-house",
      "member_since": "13 January 2023",
      "posts": "21",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1875181": {
    "overal_rating": [
      "Score*",
      "2.928",
      "2.879",
      "2.635",
      "2.781",
      "2.293"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "2.950",
      "2.700",
      "2.850",
      "2.350"
    ],
    "participant": "screaminggoatstudios",
    "game_title": "GDKO 2023 Round 1",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 9,
    "comments_raw": [
      "I actually played this a few days ago but forgot to rate it, I'm glad I remembered! I love the character and the lighting, and the location is really unique. I'm curious to know the backstory of this little astronaut, and why they're on this planet in the first place. Great job! :)",
      "I want to mine all those space rocks! I played on stream and left feedback throughout if you wanted to watch. Great entry that has me intrigued. I want to play more. Good work.",
      "Looks pretty cool.",
      "Hoping to see more of this one.",
      "This is a very nice little game. the art is really nice and I love the glow on the environment.",
      "I like the floaty feel of the character and it definitely feels like you're on a different planet. Would love to be able to dig out the minerals and unlock new paths, the level is looking good so far",
      "",
      "The art and post processing made the game feel like your on a completely new planet. Although there wasn't really much to do except navigating the caves. I think a mining mechanic could be fun.",
      "Cool art style and I had fun navigating through the level. I feel like I'm missing something since all I could do was jump and explore."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-12 21:16:05",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875181",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/screaminggoatstudios",
      "member_since": "15 July 2021",
      "posts": "51",
      "topics": null,
      "followers": "4",
      "following": null
    }
  },
  "1873946": {
    "overal_rating": [
      "Score*",
      "4.793",
      "4.655",
      "4.586",
      "4.414",
      "3.828"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.793",
      "4.655",
      "4.586",
      "4.414",
      "3.828"
    ],
    "participant": "nutt3d",
    "game_title": "GDKO 2023 Round 1 \"Astral Plane\"",
    "platforms": [
      "web"
    ],
    "rating_count": 29,
    "comments_received": 18,
    "comments_raw": [
      "I like it its a grat entry. fun to play. good job",
      "Fantastic entry. I had a blast with this on stream and left a lot of feedback while playing if you want to watch the playback. Bottom line: awesome entry and can't wait to see more from you in future rounds.",
      "THIS WAS SO COOL! You're art style is outta this world! Im super excited to see any more levels that come from this game. I dont really have any suggestions as far as level design (Im not good at platformers) or art (your art is way better than mine).",
      "THIS WAS SO COOL! You're art style is outta this world! Im super excited to see any more levels that come from this game. I dont really have any suggestions as far as level design (Im not good at platformers) or art (your art is way better than mine).",
      "The mechanics and controls are great, and I love the art style! In regards to the zoom, I personally liked the 2x zoom better.",
      "Really amazing art in this! And the environment is super cool and eerie :D",
      "great looking art, super atmospheric scary location. the horror dimension!",
      "Feels great to control, looks awesome and definitely a unique vibe to the location. I would like to see more!",
      "Really nice mechanics! I liked the sound effects that the left and right click made and just sat there making drum beats with the sounds lol! The movement was very fluid! Great job! Also, while the larger field of view is nice, i feel that having it closer to the player, like the default mode, makes it feel more immersive. Great job!",
      "I love the artwork, really unique level.",
      "This is sick! Very impressive artwork, I have to begin stalking you online!Great mechanics and fighting skillset on the character as well, really enjoyed your focus on the world and leaving the player blank, along with your statement against damage etc. Thumbs up\"The colour palette adds so much to the creepy world, with the shading, animations and the dismembered Patrick... wow you sure went for it!",
      "The art and setting for the game is really well done, loving the crystals coming towards the character as well as the enemies",
      "this is such a cool game! the animations and art are really great and I loved the atmosphere",
      "Excellent art! Love the animations and the small details like the swords on the ground. This could definitely sell in the asset store. Full marks from me!",
      "Parallax effects are enjoyable",
      "Very nice and well done graphics, you put the effort in for sure! Creepy, intriguing parallax world setting. Canâ\u0080\u0099t help but wonder more about the looming eye.",
      "Great art, this is really cool.",
      "Really like the art of this entry. It looks fantastic."
    ],
    "comments_posted": 22,
    "created_at": "2023-01-12 04:22:38",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873946",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nutt3d",
      "member_since": "07 August 2022",
      "posts": "587",
      "topics": null,
      "followers": "49",
      "following": "2"
    }
  },
  "1877755": {
    "overal_rating": [
      "Score*",
      "3.916",
      "3.864",
      "3.281",
      "2.964",
      "2.593"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.353",
      "4.294",
      "3.647",
      "3.294",
      "2.882"
    ],
    "participant": "spadeship",
    "game_title": "GRAVITY HAS STOPPED WORKING!",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 11,
    "comments_raw": [
      "Very cool game, I really liked the idea! It was fun to play on the stream!",
      "Nice concept. Love it!",
      "Great execution on a cool concept and really fun to play. I beat it on stream and left feedback throughout if you wanted to watch. Good work!",
      "fun extendable mechanic! nice tight and good puzzle game!",
      "Fun level with a cool puzzle mechanic. I would definitely want to play more levels of this.",
      "This is a pretty cool idea! I like the main mechanic and the art was simple but nice",
      "I love puzzle platformers.  This is a good idea for one.  Would love to see this implemented into a larger game.  Great work!",
      "Nice little puzzle platformer, it'd be cool to see this fleshed out as a full game",
      "Really nice puzzle platformer,  the level is designed well and I can certainly imagine other fun levels to come",
      "Unique concept! Definitely see how this could turn into something quite interesting being a weird riff on platformer and also block pushing puzzle game.",
      "Awesome mechanic! Your level is really well thought out :) Nice job"
    ],
    "comments_posted": 12,
    "created_at": "2023-01-14 19:17:00",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877755",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spadeship",
      "member_since": "13 March 2022",
      "posts": "264",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "1875797": {
    "overal_rating": [
      "Score*",
      "4.750",
      "4.667",
      "4.417",
      "4.208",
      "4.375"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.750",
      "4.667",
      "4.417",
      "4.208",
      "4.375"
    ],
    "participant": "midorimonki",
    "game_title": "GRIM",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 24,
    "comments_received": 19,
    "comments_raw": [
      "INSANE GAME!!!! SO GOOD!!!!!",
      "This looks amazing and also has great dialog.",
      "Special. Just a standout special entry. Loved it and I'm so glad I got to stream it. Top marks from me.",
      "Awesome job on this!",
      "Art style was wonderful! The overall feel was nice and lovecraftian. Really loved the atmosphere of this level :)",
      "Great game with a cool story.",
      "I thought this was going to be kinda calm and cute, I was so wrong LMAO",
      "What can I say that hasn't already been said. 5/5 absolutely  spectacular",
      "What a vibe ! couldn't pass the boss though I'm not sure how to get this last sunflower ahah. Also, I didn't want to kill those little guys but somehow even if I'm not close to them I killed them by pressing space bar ?? I was so sad :'(",
      "Alright, back playing it on my windows machine: Fantastic work! Really nice, earie visuals. Iâ\u0080\u0099m a big fan of the dynamic lighting in 3D with 2D cutouts. Couldnâ\u0080\u0099t quite get that last step from atop the gaurdian (space bar to pull seemed to not do anything?), but also appreciated the detail of the little graveyard in the corner (or maybe I was supposed to do something with that ha idk).",
      "What the f. 5/5",
      "I WANT MOOOOOOORE!!!  - GHOSTBIT 5/5",
      "Really nice! The boss took me minute to figure out, but other than that, very solid. Music was tense and atmospheric, and the overall aesthetic is great. Great work!",
      "you fucker, you made me feel happy and calm and then made me feel so bad for doing what i was asked :(. either way great game that made me actually understand the title at the end .-.",
      "I see you like playing with reflections as well :) Excellent game, well polished, big Undertale vibes. You can try exporting for WebGL in future rounds so you don't encounter technical issues with the build",
      "Good Job!",
      "Such an awesome story you got going on! The art is also really cute :D Sadly I couldn't finish it because I couldn't find the last soul but nonetheless you did an amazing job",
      "WOW with the limited time span, this game absolutely rocks.",
      "Iâ\u0080\u0099ll try this again (and rate) once I get to my windows machine, but just wanted to let you know that the mac build is getting me a blanket â\u0080\u009cThe application â\u0080\u009cGRIMâ\u0080\u009d canâ\u0080\u0099t be openedâ\u0080\u009d (not to be confused with the sandbox/quarantine thing, which Iâ\u0080\u0099ve been bypassing to play other OSX build)."
    ],
    "comments_posted": 14,
    "created_at": "2023-01-14 18:17:46",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875797",
    "coolness": 36,
    "participant_info": {
      "profile_url": "https://itch.io/profile/midorimonki",
      "member_since": "02 December 2020",
      "posts": "88",
      "topics": null,
      "followers": "18",
      "following": "5"
    }
  },
  "1876711": {
    "overal_rating": [
      "Score*",
      "2.752",
      "2.329",
      "2.329",
      "2.223",
      "1.799"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.059",
      "2.588",
      "2.588",
      "2.471",
      "2.000"
    ],
    "participant": "crimson-wolf-games",
    "game_title": "Gdko 23 round 1",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 17,
    "comments_received": 6,
    "comments_raw": [
      "I think you heard most of my feedback on stream. I like this concept a lot and dig the visual fx. Would love to see this expanded on. Well done.",
      "I like the style / visuals. I would be very curious to see how the game would look with more levels. Its fun messing around with the momentum and trying to get the height you need for some of the jumps.",
      "Nice movement. I can see some really fun jumps and tricks in later levels!",
      "Such an awesome little game! the skateboarding mechanics are really satisfying and I could imagine some tony hawk style scoring system with a bunch of cool flips and tricks to do. Plus the crt post processing filter is absolutely insane looking",
      "The core idea is there.  Would like to see it pushed a little more: visuals, gameplay, audio.  Keep going with this after the jam.  I'd be curious to see where it ends up.",
      "Reminds me of the old Line Rider game from back in the day (had to look that up to even remember what it was called). Interesting trippy visual effect! Though didnâ\u0080\u0099t get to see too much of a level itself beyond some shapes and a small area to ride around."
    ],
    "comments_posted": 7,
    "created_at": "2023-01-13 23:23:38",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876711",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crimson-wolf-games",
      "member_since": "23 July 2019",
      "posts": "180",
      "topics": "2",
      "followers": "6",
      "following": "4"
    }
  },
  "1878044": {
    "overal_rating": [
      "Score*",
      "2.263",
      "2.263",
      "2.057",
      "2.006",
      "2.006"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.444",
      "2.444",
      "2.222",
      "2.167",
      "2.167"
    ],
    "participant": "mohamadhijazi",
    "game_title": "Gouravity ball",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 9,
    "comments_raw": [
      "Pretty cool game! reminded me of flappy bird or the helicopter game. This was tricky as you had to account for the momentum of each gravity change!",
      "Fun concept! Flappy bird, but you have to pay even more attention to momentum and plan a few moments ahead (though with the current level, itâ\u0080\u0099s simple enough to flip flip keep pressing space while itâ\u0080\u0099s in the middle, since all obstacles are on the top or bottom, but I get thereâ\u0080\u0099s plenty of room for there to be other obstacles in the future). The camera perspective definitely makes it a bit more interesting than a traditional side scroller of the same mechanic.",
      "has potential as an addictive mobile game if you can get the artsyle more professional and more levels. Not sure it fits the theme of the Jam though :)",
      "The gravity switching is cool and smooth. The level is quite hard in the beginning. Also I have to say, it's not very unique level as the task was to create one.",
      "Like the gravity switching, as well as the abstract location! Would love to see more levels for this game",
      "simple game but pretty fun.",
      "Flipping the gravity is a really cool mechanic, I feel like trying to stay in the middle was quite tricky but manageable and maybe should have appeared a bit later on but it was fun to play and love the lighting and shadows in the game",
      "The base game is definitely there.  You can expend on what you have in so many different directions.  Since this is a challenge focused on art and visual design, I would like to see a more unique location.  But overall, your pieces are all in place.  Nice work!",
      "Cool base mechanic of swapping gravity direction, an idea for adding a bit more depth to it might be having some obstacles floating in the center, to work around the player just hovering in the middle. Could definitely use some more detail or uniqueness on the level or art style though, as it's a bit straightforward."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 23:04:31",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878044",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mohamadhijazi",
      "member_since": "10 February 2020",
      "posts": "36",
      "topics": null,
      "followers": "4",
      "following": "2"
    }
  },
  "1876382": {
    "overal_rating": [
      "Score*",
      "3.424",
      "3.667",
      "3.485",
      "3.576",
      "2.879"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.424",
      "3.667",
      "3.485",
      "3.576",
      "2.879"
    ],
    "participant": "rsdnrs",
    "game_title": "Hell Kitten",
    "platforms": [
      "web"
    ],
    "rating_count": 33,
    "comments_received": 18,
    "comments_raw": [
      "It took me a minute to get a hold of the controls, but I'm glad I stuck it out on stream for a victory! Still need to head back and try expert mode. Great work. I really enjoyed it.",
      "I like the level but the gravity makes it a bit 2 floaty for me, the red screen does not play sometimes when you drink the thingy but overall I like it. (I know the song lol)",
      "So much fun!",
      "The game seems like fun, but I had trouble figuring out how to attack. Even though I had trouble attacking, I did enjoy the game.",
      "Cool game with great artwork. pretty difficult but its a good challenge xD",
      "took me awhile to understand how to attack, but once i got it, man that cat is vicious!",
      "We need more cat games like this, great job!",
      "Watched Endmark Games' plays this on his stream. I thought it looked fun so I've decided to come here. It IS FUN! Replayability is awesome so that's an extra star from me. Awesome job!",
      "Pretty fun game! the attack mechanic and slow down of the game was really cool and the art animations were great too",
      "Jjust played this game and MAN, The CAT is going SICKO MODE lol. Btw, very EPIC game :D LIKED IT A LOT.",
      "Fun game! I was able to beat hard mode, but expert eluded me. Nice art style and music as well. I feel like the respawn needs to be almost instant for a game like this, kind of like Super Meat Boy or similar games , to keep the action going non-stop! I would also start the timer at the beginning of the level and skip the drink all together. Overall, nice work, can't wait to see more!",
      "Really liking the style of the game, I didn't make it to the end of the level unfortunately but enjoyed what I got to play.  I think being able to skip the intro would be nicer. Being a cat that can scratch down was a lot of fun and love the enemies and whole design of everything",
      "really great little arcade game with a really unique concept, only problem is that we can't skip the first scene so thats kindof anoying having to see it everytime",
      "The strongest thing about this game is the \"one more try\" aspect, I really liked the game pushing me to try to make it just in time.",
      "I really like the concept of cute kitten unleashing hell on enemies and I think the art style adds to this idea really nicely. I would suggest however remapping the keybinds for killing and drinking to the same key, one that's easier to access (perhaps space). This way there isn't a clutter of keys the player has to manoeuvre their hands across the keyboard to press, and you'd have one key that is associated with killing/activation of killing.",
      "It's really fun, awesome sound effects and music too!",
      "Cute cat!",
      "I really love the artstyle and the music and sfx, and the little cat is adorable, which is ironic considering what the game is. sometimes i found it a bit hard to attack the enemies but apart from that it was super fun!"
    ],
    "comments_posted": 32,
    "created_at": "2023-01-13 19:09:25",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876382",
    "coolness": 39,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rsdnrs",
      "member_since": "04 October 2021",
      "posts": "91",
      "topics": null,
      "followers": "2",
      "following": "3"
    }
  },
  "1877087": {
    "overal_rating": [
      "Score*",
      "1.979",
      "1.402",
      "1.320",
      "0.990",
      "1.072"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.429",
      "2.429",
      "2.286",
      "1.714",
      "1.857"
    ],
    "participant": "vincentwan123",
    "game_title": "Hop To Heaven",
    "platforms": [
    ],
    "rating_count": 7,
    "comments_received": 3,
    "comments_raw": [
      "Interesting location for sure. Felt a bit awkward that I couldnâ\u0080\u0099t aim exactly as I want, limiting to the 0, 45, 90 degree sort of increments, but sort of like the skill that comes with needing to jump the exponential increase in the jump distance based on meter filling.",
      "Good game!!",
      "Interesting design! The dialogue box seemed to block a lot of the environment for me but from what I could see I liked it!"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 09:15:42",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877087",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/vincentwan123",
      "member_since": "20 October 2020",
      "posts": "0",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "1876388": {
    "overal_rating": [
      "Score*",
      "4.174",
      "3.261",
      "2.783",
      "3.000",
      "2.870"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.174",
      "3.261",
      "2.783",
      "3.000",
      "2.870"
    ],
    "participant": "samagana",
    "game_title": "Hordes",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 14,
    "comments_raw": [
      "I love this so much, the art style is AMAZING and the gameplay is super fun. One thing for me though, I'm not sure if this is just my laptop but the New Horde text was a bit blurry. I really enjoyed this game! :)",
      "Played on stream and left feedback during the session. Great work with this. I was really hoping to beat it, but that (I'm assuming) final enemy kept besting me! Good work here.",
      "This looks awesome! looking forward to seeing what you do next along with if you add other attacks??",
      "Mortal Combat 3 vibes!",
      "Basic little battle, gameplay's quite repetitive but the artwork's great.",
      "Nice battle stage, 10/10 on the artwork :D",
      "Pretty good. The enemies doesn't deal enough damage.",
      "Super artstyle!!! Gameplay was not amazing, as enemies turn instantly when you jump over, so can't dodge attacks, but not an issue as the round isn't about gameplay :)",
      "I really dig the artstyle. It was just so good. The gameplay is solid and I think you nailed it. Great job!",
      "The artwork and animation are fantastic.  Would like a little more time in between enemy attacks to be able to stand up and attack without getting hit.  But that aside, it was a wonderfully put together game.  Great job!",
      "The art is amazing and the game is presented really nicely. I feel like the attacking could be improved but at this stage of the jam the focus is art and location and I think you nailed it. Hope to get to see your game develop",
      "Very nice simple game. the music was very nice and the art was also good.",
      "It looked great and the variety of enemies was cool.",
      "Stunning pixel art work, that background gives me chills! You even had custom animations for several characters."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-13 19:33:04",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876388",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/samagana",
      "member_since": "21 September 2022",
      "posts": "14",
      "topics": null,
      "followers": "7",
      "following": "2"
    }
  },
  "1875144": {
    "overal_rating": [
      "Score*",
      "3.395",
      "2.880",
      "3.189",
      "2.829",
      "2.932"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.667",
      "3.111",
      "3.444",
      "3.056",
      "3.167"
    ],
    "participant": "projectpaddy",
    "game_title": "Hurry Up & Buy ( GDKO 2023 Round 1 )",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 9,
    "comments_raw": [
      "This is so much fun, I loved the controls, really feels like you are driving around a shopping cart. I love the art style, and I loved crashing into everything lol, I tried a few times and didn't manage to win, but I came close a few times, and still had fun anyways.",
      "Unique idea of zipping around a store! Feels good to drift (would be visually more fun if the cart turned slowly, but hey thatâ\u0080\u0099s not the scope of this round anyhow). Nice work.",
      "I love the art style of this game. It's very fun to play, and I can see this being a full game pretty easily.",
      "Welcome to Costco. I love you. It feels good to be loved. Fun objective racer. I enjoyed playing this one on stream and left feedback throughout. Loved you taking a real-world location and making it fun to play in. Well done.",
      "Great game, it was fun sliding around the store.",
      "I managed to win with about 5 seconds left. It's a really nice game with many artistic details in the whole supermarket and the game has really good controls",
      "I really enjoyed this game. the controls felt a little slippery and hard to control but it was still pretty fun. the art was also pretty nice",
      "I love the style and the game play is fun and wacky. I can't find the 6th present though. Otherwise, a fun chaotic experience.",
      "The handcrafted feel of this is kind of refreshing.  Would love to actually have music like that when shopping at Costco's."
    ],
    "comments_posted": 3,
    "created_at": "2023-01-12 20:47:17",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875144",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/projectpaddy",
      "member_since": "24 November 2020",
      "posts": "177",
      "topics": "3",
      "followers": "21",
      "following": "186"
    }
  },
  "1877389": {
    "overal_rating": [
      "Score*",
      "2.070",
      "2.070",
      "1.932",
      "2.139",
      "1.932"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.000",
      "2.800",
      "3.100",
      "2.800"
    ],
    "participant": "very-tori",
    "game_title": "Ice Jump",
    "platforms": [
      "windows"
    ],
    "rating_count": 10,
    "comments_received": 8,
    "comments_raw": [
      "really like the sky, and while normally Iâ\u0080\u0099m not a big fan of first person platformers/jumping games, I at least appreciate that thereâ\u0080\u0099s not too much inertia so you feel you can control the character",
      "Some trouble with the mouse sensitivity, but once I worked it out, it was real challenge. I appreciate you having music, but I thought it might have worked better with just some more ambient cold-sounding noises ... if that makes any sense! Game looks great. Great job with this entry.",
      "This was a fun and pretty to look at. Well done.",
      "Like others have said, the mouse sensitivity was far too high for but, the skybox is gorgeous and the gameplay is fun! Nice work!",
      "pretty good game with one major problem. the art was nice and the gameplay was fun except for the massive lag that would happen every time I looked up. The only way I could play was by looking up and seeing where the platforms were then having to look down and jump blindly so I wouldn't lag, and even then I still lagged. Or maybe I just have a potato PC I don't know",
      "This would make a nice speedrunning game, and also a nice background for those text to speech tiktoks haha",
      "I don't have a clue how you got the galaxy/nebula thing to actually move, but man that was just fun to stare at.  Agree with Keltfire, the mouse sensitivity was too high.  Overall, though, very atmospheric.  Nice work!",
      "Lovely environment and textures and music! Only small thing would be a way to adjust mouse sensitivity as it was way too high for me personally, but all in all very awesome!"
    ],
    "comments_posted": 5,
    "created_at": "2023-01-14 23:11:12",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877389",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/very-tori",
      "member_since": "27 March 2021",
      "posts": "106",
      "topics": null,
      "followers": "8",
      "following": "24"
    }
  },
  "1867365": {
    "overal_rating": [
      "Score*",
      "4.619",
      "3.857",
      "3.857",
      "3.857",
      "3.095"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.619",
      "3.857",
      "3.857",
      "3.857",
      "3.095"
    ],
    "participant": "zonlee1",
    "game_title": "In the Canvas",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 15,
    "comments_raw": [
      "Really original idea! There are a lot of possibilities for where you can take this. As I was jumping around, I was thinking of different hazards you could have. Like maybe the main character is like touching up old artworks, having to clean up after bugs or effects of time. Then I thought maybe this paintbrush is a forger and they're jumping around the artwork to learn its design.  By the time I finished playing, I thought of Van Gogh giving the player a thumbs-up.",
      "I would love to explore more works of art in this fashion. Really interesting take on the task. I enjoyed this one a lot. I played on stream and left feedback throughout. I'm not sure what I was doing wrong, but I couldn't seem to get the full picture view to trigger. Awesome work.",
      "I love the environment, it's such a unique location, being inside the painting.",
      "Cool concept, I love starry night :)",
      "If you can make a solid gameplay loop out of this I can see this being a genius game, there's nothing to do at the moment but being able to platform through public domain art is amazing.",
      "I would really like to see future levels and gameplay, I love this concept, I think the location is super unique! I loved that the character was a paintbrush as well. I think it could be cool if you maybe added a tiny bit of animation within the paintings, like lights turning on in windows, or clouds + stars moving, e.t.c, that would bring the paintings  to life!",
      "Good idea showing where platforms are with colour. A unique location for sure!",
      "Really creative and beautiful game! It would be really cool and immersive with sound effects :)",
      "I'd like to see this go through, so we can see where the gameplay goes.",
      "I absolutely love the style of this game. the art is great and the way the platforms are colored and the the background is dark is really cool and creative",
      "Love the way you represent platforms using colored parts of the painting, would like to see more works of art explored in this manner",
      "",
      "Very unique concept, definitely would want to see more. Iâ\u0080\u0099m sure you have some ideas of how your paint brush stroke plays a role, and Iâ\u0080\u0099m curious to see what that would be. I liked in a way how it was somewhat ambiguous what I could jump on, I had to get an intuitive feel, which was nice.",
      "That is a really cool technique!  I never would've thought to use a layer mask (my assumption?) as a way to create a platformer.  Definitely going to be studying this more after the game jam and adding that to my developer toolbox.  Nice work!",
      "I think your game is very creative and I definitely never seen anything like it. I think using a van gogh painting for the background is a great choice and love that the platforms are in different shapes"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-08 06:00:42",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1867365",
    "coolness": 77,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zonlee1",
      "member_since": "28 January 2021",
      "posts": "12",
      "topics": "2",
      "followers": "1",
      "following": null
    }
  },
  "1861207": {
    "overal_rating": [
      "Score*",
      "3.905",
      "3.286",
      "2.857",
      "3.190",
      "3.190"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.905",
      "3.286",
      "2.857",
      "3.190",
      "3.190"
    ],
    "participant": "someidiotic",
    "game_title": "Infested & Sons Inc. LLC. Ltd.",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 16,
    "comments_raw": [
      "Had a great time with this on stream, but wished I could earn upgrades a little more quickly. Screen wrap would be awesome too, but I think you watched my feedback already. A fun time and a perfect jam-style game. Well done.",
      "Interesting idea, I like the setting and situation you've set up with this game, although I do think it was a bit too easy/stale especially after a while. Maybe different types of enemies would help? That being said, this wasn't a gameplay round so I don't hold it against you!",
      "I love the setting and concept for this game! I may have had some issues with my browser but I wasnt able to maximize the screen so it was it little difficult to I think get a full view for feedback. I also ran into some issues trying to make purchases. Excited to see how this develops!",
      "A fun survival game, interesting idea to have the environment change!",
      "liked the atmosphere. It reminded me of The Binding Of Isaac for some reason haha",
      "Very interesting take on the theme and the gameplay was fun. I wish there was more interactions, which is a good thing I think!",
      "I can't believe you made this in scratch! I really enjoyed the gameplay, and I loved the location changes too.",
      "Watched this being played on Endmark Games' stream and decided to play it myself. The game was really fun! You nailed the gameplay! Awesome job!",
      "I love the little scuttle movement of the rats. I think the ability to move is awesome but I rarely moved as didn't see any benefit but a nice game nevertheless",
      "I really enjoyed this game! the sound design made hitting enemies really satisfying and the game feels super polished. the only problem is I found it too easy to just spin my mouse in a circle and never get hit by anything",
      "great game! killing enemies was really satisfying and i liked the art. but i felt like there was not really a point to moving because staying in the center is the most strategic place because you have more time to react with the claw but  other than that great entry :D [also i could only make it to wave 12 :)]",
      "Very fun, had me playing for quite a while. Would have loved if the camera's UI was integrated into the game (e.g. camera battery = health)",
      "Knowing it is made in Scratch - it is great work!",
      "It was fun for a bit. The transitions were really good, I kind of wish they would have been a little more than visual (at least I couldn't tell the difference). The shop was good.",
      "Having the shop at the very end was a nice lure to try again, though I found that wildly spinning my arm around like a maniac still ended up being as good a strategy as any. Would be interesting to see different enemies or mechanics occur as the sub levles changed! Or if there was a way you could make them change yourself for some benefit?",
      "The game was fun, but I felt like it got boring eventually."
    ],
    "comments_posted": 2,
    "created_at": "2023-01-03 11:38:33",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1861207",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/someidiotic",
      "member_since": "13 May 2021",
      "posts": "19",
      "topics": null,
      "followers": "1",
      "following": "4"
    }
  },
  "1875514": {
    "overal_rating": [
      "Score*",
      "4.143",
      "3.333",
      "3.286",
      "3.095",
      "2.476"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.143",
      "3.333",
      "3.286",
      "3.095",
      "2.476"
    ],
    "participant": "noahaslan",
    "game_title": "Inn Dirt",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 11,
    "comments_raw": [
      "nice drawing!!!",
      "Really cute style. Charming little experience. I had fun streaming this one.",
      "Really awesome style! I love the idea and the art is really nice",
      "I love the earthworm. I am very sure that I want to see what the current game will become after five iterations.",
      "I really like the art style, I think this could be a really great game.",
      "I like the location, interesting to see a worm hotel and the point and click game feeling was nice. Hand drawn pencil art-syle could be really great when taken further; Almost a kids books style. Good idea :)",
      "The concept is promising! The artstyle takes me back to childhood for some reason lol. Great work!",
      "This concept is really cool, and if you continued making this I would love to see more of the hotel, and explore a lot more",
      "Haha, this is a wicked cool idea for a location & world. I felt myself wishing I could get to my room and see what life is like here.I like where you're going with the art style too. Like Michell pointed out below, there's some small tweaks that could help it be easier to read ... but I think ultimately this style could be quite endearing in a larger experience.",
      "",
      "Your perspective work is really good.  Would like to see just a bit more contrast between things (especially the text).  Would be curious how the full game would play out.  Can't say I've ever considered a worm hotel before.  Fun concept."
    ],
    "comments_posted": 10,
    "created_at": "2023-01-13 17:57:29",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875514",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/noahaslan",
      "member_since": "10 July 2020",
      "posts": "71",
      "topics": "5",
      "followers": "6",
      "following": "9"
    }
  },
  "1876845": {
    "overal_rating": [
      "Score*",
      "4.386",
      "4.432",
      "4.409",
      "4.455",
      "3.568"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.386",
      "4.432",
      "4.409",
      "4.455",
      "3.568"
    ],
    "participant": "endmarkgames",
    "game_title": "Intergalactic Janitory",
    "platforms": [
      "web"
    ],
    "rating_count": 44,
    "comments_received": 28,
    "comments_raw": [
      "Using the robot as platform and for movement is cool. And the background looks so beautiful! A solid game overall!",
      "Nice work all around! Far more than a level, controls felt real nice - and I highly appreciate the good design in relating the primary character colors to the text box popups. Even had a whole little story and everything. Well done!",
      "Whoua this game is not a game jam game i thing we are just play testers. Cuz that have to be released as a full game. That's impressive game mecanics, art styles everthing.",
      "Really loved this! it was awesome flying around on your robot!! Looking forward to getting to this point of gameDev one day! haha",
      "I enjoyed the different mechanics and the level design uses them well. The graphics and animations are great, I also liked the attention to detail on the text box. The effects you put on some of the words are really cool.",
      "Love the variations in gameplay with your little robot buddy, also a fan of the parallax, particles, and tiny animations like the stars. The location itself is quite cliche but a great game nonetheless.",
      "Really nice entry. The environment is interesting and the art is great. I know this isn't a gameplay round, but the gameplay is also really cool, I love using your little robot buddy to traverse different obstacles.",
      "Great game and story, I did find the space controls a bit sluggish and clunky, but since that wasn't the task I didn't let it affect the rating. My only complaint would be the fact that sometimes the text goes outside of the screen. Overall It's a great entire and I hope that you get to round 2!",
      "This was great bud.  Very well thought out and executed.  Loved the gravity flying mechanics primarily.  One small item I would say is when you need your follower friend to jump onto etc is that he snaps / lerps into position faster so that the player doesn't have to wait.  The one point I really noticed this was when he was needed to jump over the laser horizontally.",
      "Wow, I'm amazed by all the mechanics you've implemented in this short amount of time ! programming is still a kind of magic for me so that makes you... a wizard. And on top of that, art is really cool, there is a beautiful dialog system, cutscenes, juicy animations ... I'm jealous ! Very well done !",
      "I love the art, but the If I remember correctly the \"mop\" riding section is a bit slippery and I would have liked to see a unique riding animation and not just a static player, The last two things I have to say is the shine animation on the helmet  I don't think should be there in some parts because if there is light it won't go away in the same room just because you move but I guess its an artistic choice, The wall climbing is a bit finicky sometimes when it works it's great but when it does not it's a minor annoyance. The art was overall great I love the bounciness of the player the mop was cool just a little static lol,  I would love to see more of this.",
      "great use of the robot for some cool varied mechanics. clean movement and control, very very nice gameplay.",
      "I am amazed on how many uses you found for the robot companion! Very cool!The art style is sick, well done, that shiny helmet and the way you grab on to edges is so cute! (great inclusion by the way mechanic-wise)Can't wait to see what else you make with mr Mops!I hope to hear your story of switching to gamemaker, how did that happen? :D",
      "Thanks for letting me know about this on Twitter <3 I appreciated that you had some dialogue at the start for flavour and investment but then eased off it for the actual gameplay.",
      "Great game! Very well-designed level, satisfying controls, and just enough difficulty.",
      "Such a clean game! it feels super polished and nice, and the art is super cool. the dialogue is also really fun",
      "Thank you so much. I think thereâ\u0080\u0099s some other unexplored mechanics that would work, so Iâ\u0080\u0099m hoping we continue with this entry.",
      "love that, waiting for next part",
      "Very fun! Obviously would like to have sound but I understand leaving it out for round 1. Controls were very intuitive and smooth, and the ledge grabbing felt very satisfying.",
      "This is the first game I played in this jam and I think it is really cool. Love the little bit of humour at the start, the art is top notch and the way you traverse the level is awesome, especially with the other character being a handy platform that never gets in the way",
      "very fun platformer and artstyle!",
      "I feel like you used pretty simple pixel art together in a way that looks amazing and immersive, and the gameplay feels super smooth.  It was also great to see a fellow GameMaker enthusiast!  Hopefully I'll get to join you in the next round.  No doubts at all that you'll be there.",
      "The helper bot's mechanics were creative. Great game!",
      "Really enjoyed this! Great mechanics and art direction. The dialogue was fun and the controls felt nice. Great job!",
      "Luved it",
      "I CANT BELIEVE YOU HYPED UP MY GAME WHEN YOU HAD THIS UNDER YOUR SLEEVE! Canâ\u0080\u0099t wait to see more !!!!",
      "The juice in this game is fantastic!  The mechanics introduced with the tiny bot character were cool, the art style was great, and those small details like the grip mechanic and the interaction with the characters, both in terms of mechanics and dialogs, were great. Solid entry! 10/10  Had a lot of fun playing this one!",
      "Really fun level and I already like both characters, would like to see what they do next!"
    ],
    "comments_posted": 88,
    "created_at": "2023-01-14 23:58:27",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876845",
    "coolness": 93,
    "participant_info": {
      "profile_url": "https://itch.io/profile/endmarkgames",
      "member_since": "09 July 2020",
      "posts": "766",
      "topics": "2",
      "followers": "30",
      "following": "17"
    }
  },
  "1876031": {
    "overal_rating": [
      "Score*",
      "2.546",
      "2.160",
      "2.006",
      "2.083",
      "1.774"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.125",
      "3.500",
      "3.250",
      "3.375",
      "2.875"
    ],
    "participant": "sevo88k",
    "game_title": "Isolation",
    "platforms": [
      "windows"
    ],
    "rating_count": 8,
    "comments_received": 6,
    "comments_raw": [
      "beautifull, graphic is so nice.",
      "Gorgeous work with this. The visuals are obviously incredible, but I love how you went above and beyond with the audio. It made everything come to life. Excellent entry. I hope more get to play it.",
      "Looks amazing, good job on this.",
      "Graphics are fantastic.  Almost hyper-realistic.  Would like to see a little more to explore.  Good job all around.",
      "Nice game bruh. I like the atmosphere. More content to it pls",
      "Interesting location, seems like more of a story on where we are and why weâ\u0080\u0099re there. Feels a little small and not much to do, but definitely high fidelity to make up for some of that."
    ],
    "comments_posted": 18,
    "created_at": "2023-01-14 09:20:38",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876031",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sevo88k",
      "member_since": "25 April 2020",
      "posts": "20",
      "topics": null,
      "followers": null,
      "following": "1"
    }
  },
  "1877266": {
    "overal_rating": [
      "Score*",
      "2.400",
      "2.400",
      "1.964",
      "1.746",
      "1.818"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.667",
      "3.667",
      "3.000",
      "2.667",
      "2.778"
    ],
    "participant": "jammyowo",
    "game_title": "Lantern Boy [GDKO R1 entry]",
    "platforms": [
      "windows",
      "osx"
    ],
    "rating_count": 9,
    "comments_received": 7,
    "comments_raw": [
      "Your pixel art is lovely. I'm going to be studying your tree.  That's what I was trying to do in mine!  The gameplay is really interesting.  A cool way to sort of teach/learn color theory.  Took me a minute to figure out what I was supposed to be doing though.  Not the focus of the game, though.  Great job all around!",
      "I played this on stream and left feedback throughout my time with the entry if you didn't get a chance to watch the playback yet. I really enjoyed the art and gameplay. It was a nice comfy experience after a couple hours streaming, so it hit the spot perfect. Great work. Looking forward to see what you do next round.",
      "Such a nice little game! the art was really cute and I liked the mechanic of having to mix the ghost color and the lantern color to make the ghost happy. plus the water shader you used was really nice",
      "I really liked the concept and the art. The game did feel a little slow paced and too easy though.",
      "I like the idea but I think it's quite simple. The gameplay felt quite slow and there wasn't much that kept you interested, but the concept is very interesting. Great job.",
      "I think you did a nice job on style, the reflection and background fit quite nicely. Walking felt a bit slow, but I still made it to the end to see the whole level (also wasnâ\u0080\u0099t quite sure how I got the spirits home). Made me think of spiritfarer, fun title too.",
      "its alright. the lack of tutorial made it hard to figure out what to do but once i figured it out it was kinda cool. i like the aesthetic of the town, but the location itself imo is super generic."
    ],
    "comments_posted": 3,
    "created_at": "2023-01-14 13:38:25",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877266",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jammyowo",
      "member_since": "25 January 2021",
      "posts": "10",
      "topics": null,
      "followers": "8",
      "following": null
    }
  },
  "1876995": {
    "overal_rating": [
      "Score*",
      "3.450",
      "3.329",
      "3.268",
      "3.147",
      "3.087"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.385",
      "4.231",
      "4.154",
      "4.000",
      "3.923"
    ],
    "participant": "dev-pirates",
    "game_title": "MemRep.Exe",
    "platforms": [
      "windows"
    ],
    "rating_count": 13,
    "comments_received": 9,
    "comments_raw": [
      "Nicely done, loved how the 2.5D elements shone through. Fun mechanic of the coins unlocking the level, and you actually built out a pretty decently sized space here!",
      "OK, don't laugh but I thought I couldn't get the game to run because I kept thinking I had Quit selected instead of Start. Ha! It took me a bit to get everything up and running properly on my PC, but I'm so glad I did. This was a fantastic entry. There was something so exhilarating about running across an empty chasm collecting coins just in time for the blocks to appear in front of me. This was  a really clever and beautiful platformer. Excellent work.",
      "I really liked the mechanic and the movement being a set distance of jump rather than varied was a nice retro touch that helped make the platforming feel great when you know exactly how far you'll jump.  I think like a lot of people, I search games based on \"Windows\", but I don't think this game showed up in that way, so I didn't even realise it existed until I took off the search parameters. Maybe that's why you have so few ratings, as it isn't listed as a Windows app, and so no one can see it.",
      "Really cool concept! Liked the art but the game ran a bit laggy on my pc.",
      "Really cool concept",
      "I was surprised by how many mechanics this game has. Good job",
      "Amazing work! Love the colour palette (obviously XD) and genius mechanic! Can't wait to see what else you come up with! The old computer sure brought back memories, great rendition!",
      "Loved the concept, felt the controls were a little janky but in terms of level design, very unique and I'd like to see more!",
      "I really enjoyed how well the level concept and mechanic went together!"
    ],
    "comments_posted": 44,
    "created_at": "2023-01-14 07:17:19",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876995",
    "coolness": 104,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "540",
      "topics": "1",
      "followers": "11",
      "following": "12"
    }
  },
  "1877704": {
    "overal_rating": [
      "Score*",
      "3.857",
      "3.667",
      "3.476",
      "3.571",
      "2.857"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.857",
      "3.667",
      "3.476",
      "3.571",
      "2.857"
    ],
    "participant": "aerial301",
    "game_title": "Meteor Outpost",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 11,
    "comments_raw": [
      "I loved the starry background and lighting effects, and the art style was great! I had a bit of lag, but that doesn't really matter, that's not what this round is about lol. I loved exploring, this is a very unique location, great job :)",
      "The lighting effects are awesome. This looked really cool. I liked the under-red-glass part, too.",
      "I like the movement. feels really good. The effects are nice too! I was wondering if it would be nicer if the character stays within the grid, still moving at the same pace, but always ends movement within a square? Not sure, maybe it will work better for puzzle design elements later on :) Great visuals and interesting location",
      "I played this on stream and left feedback throughout if you didn't get to watch the playback yet. Unique location. Great art and I really like the extra attention you paid to the little details and flourishes in movement. Well done.",
      "I played this on stream and left feedback throughout if you didn't get to watch the playback yet. Unique location. Great art and I really like the extra attention you paid to the little details and flourishes in movement. Well done.",
      "i like the game, but the lack of gameplay yet is a little disappointing. i'm exited to see what the gameplay will be like!",
      "I liked the look and feel of the game. I would like to see more.",
      "The player movement is fluid and the vfx are great. Nice work!",
      "I really love the feel of this game. the effects on the player and the smoke really add a lot of life to the game, and love the art. the only thing was that when A door or teleporter didn't work I wasn't sure if I just couldn't access that area in this version or If I needed to do something to unlock them.",
      "Really like the location and how the different sized stars add depth and motion to the outpost. The special effects are very nice and movement is fluid. Hope I get to explore more",
      "Great aesthetic so far, would love to see more. You should add more details to your game's description so players are aware of the scope of the game (teleporter and door are disabled) and are not missing out on any hidden features."
    ],
    "comments_posted": 8,
    "created_at": "2023-01-14 18:13:36",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877704",
    "coolness": 43,
    "participant_info": {
      "profile_url": "https://itch.io/profile/aerial301",
      "member_since": "12 November 2022",
      "posts": "312",
      "topics": null,
      "followers": "9",
      "following": "7"
    }
  },
  "1878096": {
    "overal_rating": [
      "Score*",
      "4.619",
      "3.762",
      "3.667",
      "3.000",
      "3.238"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.619",
      "3.762",
      "3.667",
      "3.000",
      "3.238"
    ],
    "participant": "n3wtworldorder",
    "game_title": "Moco",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 13,
    "comments_raw": [
      "Streamed while playing this and commented throughout if you want to watch the playback.",
      "What a fun/unique location. Why is he so cute.",
      "No mocos were harmed in the making of this game",
      "Very unique was not expecting that!! Looking forward to how you will progress this!!",
      "This was awesome and hilarious.",
      "unique and funny. Made me chuckle :)",
      "Like the others have mentioned, I really like the unique location here. Great job on getting me intrigued lol.",
      "super interesting concept. the art is cool and the controls are super smooth. cant wait to see where it goes!",
      "Love the character, especially the jump and how you got to avoid the finger in different ways. Excited to see what other levels you may have got planned",
      "So unique the location is !",
      "Extremely unique setting, great nostalgic art style, can't wait to see what you come up with in the next round",
      "That was amusing!  The handdrawn art style was really cool.  Reminded me of the old show \"Ahhhhh! Real Monsters\".",
      "Funny game XD! That location really is unique. Loved the artstyle too!"
    ],
    "comments_posted": 9,
    "created_at": "2023-01-14 23:49:52",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878096",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/n3wtworldorder",
      "member_since": "08 December 2020",
      "posts": "22",
      "topics": null,
      "followers": "4",
      "following": "2"
    }
  },
  "1877856": {
    "overal_rating": [
      "Score*",
      "2.904",
      "2.653",
      "2.653",
      "2.503",
      "2.603"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.053",
      "2.789",
      "2.789",
      "2.632",
      "2.737"
    ],
    "participant": "kodelesskaiden",
    "game_title": "Mt. Farm",
    "platforms": [
      "windows",
      "osx",
      "linux",
      "web"
    ],
    "rating_count": 19,
    "comments_received": 10,
    "comments_raw": [
      "Why do zombies always have to ruin my chill farming sim!? Well done. Had a fun time with this one.",
      "Cool survival management game, nice job!",
      "Cool game but quite boring.",
      "This game is pretty fun! I liked having to manage both attacking and farming to stay alive, although I felt things moved  bit too slow, , like collect crops, attack zombie, collect more crops, attack zombie again and again. It was a fun loop but when depositing crops is slow and same with growing crops going back collecting the axe and collecting them was a bit slow. but I think Its a cool concept and would love to see where it goes",
      "Funny quirky idea of a magical farm... THAT HAS ZOMBIES!",
      "",
      "I think this is a good start to a fun idea.  Would've liked to see a bit more graphics for the jam, but I think you still are onto something cool.  Take some of the ideas mentioned below after the jam and keep going with it!  I'll be curious to see what you do with it.",
      "the game was great the setting itself was not that original but the story behind it makes up for it, gameplay wise the game was fun but i feel like an indicator as to where the zombies are could have been really useful",
      "I really liked your story explaining the whole situation (of course, being impatient I wished you would allow for a \"Skip-this-paragraph-I-read-it-now\" button, but this is a game jam and I know you have a million other things to worry about.",
      "By the intro lore, I was going to say it definitely sounds like an interesting location! Although sad that it seemed essentially disconnected to the actual gameplay itself. Interesting mashup though, to have a combo farm simulator / zombie rush, I can imagine future levels getting kind of hectic!"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 20:37:55",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877856",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/kodelesskaiden",
      "member_since": "15 September 2022",
      "posts": "7",
      "topics": "1",
      "followers": "2",
      "following": null
    }
  },
  "1878120": {
    "overal_rating": [
      "Score*",
      "3.960",
      "3.960",
      "3.680",
      "3.880",
      "3.320"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.960",
      "3.960",
      "3.680",
      "3.880",
      "3.320"
    ],
    "participant": "kingjaw",
    "game_title": "Murder Virus(Old)",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 13,
    "comments_raw": [
      "I was so close to a Dwayne Johnson victory on stream but had to settle for John Doe. I like so many of the little details and care in this entry. I played on stream and left feedback throughout if you wanted to watch. Well done, Kingjaw and good to see you in GDKO again.",
      "I love a good top down 2d shooter! And the setting is really good considering the last couple of years. I would have loved to see a little bit more variety in the level's art but overall so good. Cant wait to see more levels.",
      "Oh hell yeah, KingJaw back at it with the STUFF! Excellent showing as always...",
      "I was really intrigued after I saw the title and pictures, and this was so fun lol. I love the concept, and it is a fun challenge! I couldn't get past the john doe difficulty tho LMAO",
      "Cool arcade  shooter with  a fun virus theme. Would have preferred screen wrap for the character to make it more arcadey and smooth. Overall, great game!",
      "Solid entry all around.  I would suggest some sort of UI element for where the mouse cursor is.  I lost mine momentarily a few times.  That aside, though, this really well done.  Great job!",
      "The names for the different difficulty levels really made me laugh.",
      "one of the best entries of this game jam i ve seen so far! good job, keep going",
      "The menu and end screen introduces and envelops the world nicely, as well as what type of hardcore game this is.",
      "This is such a fun game! the fast paced shooting is super satisfying, and the harder levels are super challenging and fun with the hoards of bullets flying across the screen. my one problem is the music was a tad too intense",
      "Super fun and addicting, and a very good level of challenging. On that note actually, I think the difficulty curve could be a little smoother, it seems to spike right around wave 4 pretty significantly but maybe that's just me. Regardless I would love to see more of this!",
      "pretty good. also did you put that background in the beginning so that tripiphobiacs are creeped out :(",
      "Really nice art style and gameplay"
    ],
    "comments_posted": 4,
    "created_at": "2023-01-14 23:56:49",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878120",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/kingjaw",
      "member_since": "14 August 2020",
      "posts": "441",
      "topics": "4",
      "followers": "38",
      "following": "4"
    }
  },
  "1873429": {
    "overal_rating": [
      "Score*",
      "4.000",
      "4.048",
      "3.810",
      "3.905",
      "3.810"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "4.048",
      "3.810",
      "3.905",
      "3.810"
    ],
    "participant": "mrdoctorb",
    "game_title": "Mushroom Forest",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 11,
    "comments_raw": [
      "Streamed while playing this and commented throughout if you want to watch the playback. The lighting on the pixel art is amazing. Made everything feel so alive. Love the thoughtfulness of the level design. This was the last game from Round One I'll stream and I'm glad to go out on such a high note. An excellent entry.",
      "cool game !! like it.",
      "good game, i like it. some optimisation problems, but overall 10/10",
      "wonderful art and animation! I liked the item switching, reminded me of tomb raider on PS1 :)",
      "Very lovely! I love the interplay between the features of the game and the level, changing to let you get to new areas. I also love the attention to detail in the graphics- like the character blocking light.",
      "This was really an amazing experience! The art and the mechanics are top notch! Great work!",
      "Beautiful environment and love the ability of the mushroom character",
      "super chill game. love the art and the lighting effects",
      "Probably the best game I've played so far in the jam. The art is amazing and the mechanics are really good for a five minute long game. You should definitely make more levels.",
      "Nice entry! The light rays are a good touch, and I like how it layers with some already nice background work. Took me a moment to figure out how to actually â\u0080\u009cuseâ\u0080\u009d the menu item once I picked up the little package (I was trying to use enter or up arrow to assign), but figured it out.",
      "Cute character and an interesting environment. I love the sunrays breaking through the canopy and the different background/foreground layers. Nice!"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 22:53:41",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873429",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mrdoctorb",
      "member_since": "28 August 2020",
      "posts": "1",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "1877892": {
    "overal_rating": [
      "Score*",
      "4.400",
      "3.400",
      "3.320",
      "3.400",
      "3.240"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.400",
      "3.400",
      "3.320",
      "3.400",
      "3.240"
    ],
    "participant": "h4zm4tt",
    "game_title": "My Last Two Brain Cells",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 12,
    "comments_raw": [
      "It was fun running around looking for the switches and bounching!",
      "Love the little motions of the little cell. I had a great time playing this on stream and left feedback throughout. Unique location and a great entry. Well done.",
      "Very fun idea and cute characters :D",
      "Smooth gameplay with a well thought out level layout that keeps you moving in the right direction yet doesn't make it feel forced",
      "I like the unique location.",
      "Good job, i like it",
      "Saw the progress on the Discord channel. Amazing how it turned out. Really nice gameplay and was actually fun to play! Great job!",
      "The name is great, seeing it on the discord chat gave me a chuckle :D",
      "The concept is fun. However the pixelart is blurry and I'm not sure how to win.",
      "I love the concept and the location, it's super unique and fun to play!",
      "A really great location for a game that I enjoyed exploring, art is good and I like that you've springs and levers in the level",
      "This was a pretty fun game! the concept and setting were very original and interesting and the art was pretty good"
    ],
    "comments_posted": 6,
    "created_at": "2023-01-14 20:44:16",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877892",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "200",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "1877725": {
    "overal_rating": [
      "Score*",
      "3.857",
      "3.667",
      "3.476",
      "3.190",
      "3.571"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.857",
      "3.667",
      "3.476",
      "3.190",
      "3.571"
    ],
    "participant": "elzach",
    "game_title": "Nameless Lands [Kojam2023]",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 9,
    "comments_raw": [
      "Love that Ocarina of Time-style auto jump. I do wish I could jump on my own though. Those aren't part of this round's task. I think you nailed the actual task. Love the reveal of the major visual elements with their placement. The camera triggers were smooth. Great work all around. I played on stream and left feedback throughout my play if you wanted to see more. Great entry.",
      "such a cool idea! I love the models and the way the camera moves when you get to different spots. cant wait to see where you can take this !",
      "Cool but you should make a manual jump instead of the auto jump.",
      "Really impressive character and the world is so detailed, can tell a lot went into its making. Love the fact that the character can auto jump in places and camera is really good. The feet can clip inside the stairs but its only a minor thing compared to how many more awesome things there is, well done",
      "Nailed the art/visual design challenge.  The camera movement was a little unpredictable in places.  But aside from that, it was great.  Love the cracked faces in some of the pillars.",
      "open world ? :)",
      "Great work! It really fits the theme!",
      "This was really cool! Great job!",
      "Incredible start, really breathtaking scene! Had some small issues with turning around because my mouse was trailing off the edge of the screen, but aside from that I loved it!"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 18:23:05",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877725",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/elzach",
      "member_since": "23 April 2017",
      "posts": "50",
      "topics": "1",
      "followers": "53",
      "following": "14"
    }
  },
  "1877094": {
    "overal_rating": [
      "Score*",
      "1.974",
      "1.974",
      "1.513",
      "1.382",
      "1.447"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.727",
      "2.727",
      "2.091",
      "1.909",
      "2.000"
    ],
    "participant": "r4y-1",
    "game_title": "Ninja Factory - GDKO 2023 Round 1",
    "platforms": [
      "windows"
    ],
    "rating_count": 11,
    "comments_received": 5,
    "comments_raw": [
      "Nice little vignette of a level with some fun detailed props. Interesting stage for sure. From one duck to another, I can appreciate not having had enough time!",
      "Don't be too hard on yourself, your sense of aesthetics and level design are pretty good! I am confident you will make it to the next round.",
      "I hold E and the ninja ascends and descends the ladder at supersonic speeds. GOTY. But seriously, taking the time to make the background assets look 3D really helps the level pop and feel alive! Nice work :)",
      "Simple game but good art!",
      "Controls work well, aesthetically looks good but there's some tough competition this round."
    ],
    "comments_posted": 25,
    "created_at": "2023-01-14 09:28:46",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877094",
    "coolness": 43,
    "participant_info": {
      "profile_url": "https://itch.io/profile/r4y-1",
      "member_since": "02 February 2021",
      "posts": "225",
      "topics": "5",
      "followers": "9",
      "following": "10"
    }
  },
  "1878117": {
    "overal_rating": [
      "Score*",
      "3.095",
      "2.667",
      "2.381",
      "2.286",
      "1.952"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.095",
      "2.667",
      "2.381",
      "2.286",
      "1.952"
    ],
    "participant": "turtlegunner",
    "game_title": "Off the Shelf",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 10,
    "comments_raw": [
      "Okay, just no",
      "Streamed while playing this and commented throughout if you want to watch the playback. Glad you still submitted even though you were running short on time. What you put together is an enjoyable, if short, experience. Well done.",
      "we all like kittens, arent we",
      "I think that your original idea for the game is super cool. It's a shame that you ran out of time but hey— things happen.",
      "I can relate to having real life issues.  I lost 2 days for work issues.  Really needed to tweak my character movements.  Regardless, you managed to get something.  And I'm intrigued.  I want to see where you go with this sentient stuffed animal idea.  Nice work!",
      "Fun little game! Had a blast playing it! Great job on the game!",
      "Short game but nice. the controls are nice and the player art is good",
      "The character looks cool and it's not too bad for the time you spent making it and I also noticed that you submitted in less than a minute before the deadline",
      "I really love the walk animations of the cat(?).",
      "im gonna give it a good score for more levels and qualifying bc you had to rush it and i think its a cool idea."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 23:59:01",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878117",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/turtlegunner",
      "member_since": "22 October 2022",
      "posts": "9",
      "topics": null,
      "followers": null,
      "following": "1"
    }
  },
  "1878184": {
    "overal_rating": [
      "Score*",
      "3.755",
      "3.189",
      "3.086",
      "2.880",
      "2.366"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.056",
      "3.444",
      "3.333",
      "3.111",
      "2.556"
    ],
    "participant": "winerentertainement",
    "game_title": "On You",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 12,
    "comments_raw": [
      "I think you set a really nice atmosphere for the game and you got an awesome environment, loving the bumpiness of the skin and all of the details in the microscopic world. The music and sound effects especially the timing of the walking are all great. My only suggestion for future improvement is I think the hairs might work better as a solid",
      "Very unique location! Arrow keys worked fine, but while trying to move with WASD, I couldn't move left or forward with the W and A keys. The art style is interesting and the music enjoyable. Nice work!",
      "some buttons dont work",
      "Very unique location, the art is uncanny and reminds me of Subnautica. The character move set with the dash and floaty jump suit this game very well. Unrelated to this round, but I encountered many bugs (other than lice) that made it hard to play, I hope you will have time to fix them in future rounds and I look forward to the gameplay",
      "Interesting spooky level for sure, curious to see what comes. Being the manifestation of head-lice is definitely unique!",
      "I really love the particle effects coming out of the player, and the atmosphere of the game is great! I hope you get through to the next round because I'd love to see what the story would be like. Just saw your comment saying it was located in the human skin, that's such a unique location, probably one of the most unique ones I've seen!",
      "Great to play with you on stream watching. Love the world you built here. I see nothing but potential and want to spend more time in this space. Great work.",
      "Love the style you went for the human skin! Nice little details with the hair, and the skin with the unsettling music and SFX!I was so happy to find the little mites walking around hehe. I always wanted to make a game on the skin, it is such a weird world!Interesting choice of camera work, to have it move around constantly! (Are you using a French keyboard? The arrow keys worked nicely but not the WASD hehe)",
      "the walk sound and movement in general was annoying but the particles and world was cool",
      "A lot of directions you could go with this. Makes me think of Osmosis Jones.",
      "I'm curious where is this location?? Where did you get the idea? And curious what kind of story you will give this level?",
      "Interesting environment and nice movement mechanics when you get the hang of it and account for the reset of direction!"
    ],
    "comments_posted": 25,
    "created_at": "2023-01-19 16:03:26",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878184",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/winerentertainement",
      "member_since": "07 January 2023",
      "posts": "56",
      "topics": "2",
      "followers": "2",
      "following": null
    }
  },
  "1878013": {
    "overal_rating": [
      "Score*",
      "4.667",
      "3.952",
      "3.571",
      "3.143",
      "3.333"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.667",
      "3.952",
      "3.571",
      "3.143",
      "3.333"
    ],
    "participant": "solisu",
    "game_title": "POV",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 7,
    "comments_raw": [
      "Just finished playing this on stream (for probably wayyy too long) and left a lot of feedback. I have to know if I was close to the end! I love that you built in the \"aha\" moment for players. It was a really unique experience. Well done.",
      "Weird having to look at myself from a different view to see the platforms. Great idea, well done!",
      "That...was incredibly unique.  The concept is fantastic.  And I would love to know how you actually did it (if you have a video or a blog post on it, definitely send it my way).",
      "I really love the weird kaleidoscopic effect. I Loved the player model and the music was nice",
      "",
      ".....what. that was trippy as hell.it was a really cool environment and i did manage to find the first platform but the game would not let me jump, i would just squish down.",
      "This concept is wild haha. I was able to get to the next platform, but I can't for the life of me get to the third for some reason my guy won't jump high enough."
    ],
    "comments_posted": 6,
    "created_at": "2023-01-14 22:38:07",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878013",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/solisu",
      "member_since": "14 March 2019",
      "posts": "31",
      "topics": null,
      "followers": "18",
      "following": "24"
    }
  },
  "1877462": {
    "overal_rating": [
      "Score*",
      "4.667",
      "4.667",
      "4.641",
      "4.051",
      "4.128"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.667",
      "4.667",
      "4.641",
      "4.051",
      "4.128"
    ],
    "participant": "ahnaf30e",
    "game_title": "Parsdon",
    "platforms": [
      "web"
    ],
    "rating_count": 39,
    "comments_received": 28,
    "comments_raw": [
      "That was a really unique experience.  I think using the mouse was a bit clunky.  But that aside, I think you're onto something special here.  I would absolutely want to see an entire game like this.",
      "Love the artstyle, atmosphere and gameplay! brilliant entry",
      "Super cool! I love the art style and the different methods of moving around are cool. I just think it could be a little easier to switch between them. I don't think the mouse needs to be involved. And also the foreground element inside the tent is a cool touch, but it blocks some of the platforming so it's hard to see what you're doing. It would be cool if it just wasn't in the way. But overall, really cool entry!",
      "This was amazing! Everything, the art style, the juice, the atmosphere, the spider legs especially.  I would love to see more of this.!",
      "Loved the vibes and this spider-like mechanic ! but as many others couldn't pass the tent, even if it's possible I think it's just a pain ahah. But overall very nice experience, would play more of it !",
      "I love the art style, and the gameplay was so fun! I'm not sure if I missed something but I couldn't figure out how to swap items, and couldn't get past the tent, I'm seeing people say about mouse buttons but I am on a trackpad, so is that why? I probably just didn't read something LMAO",
      "Awesome mechanic that caught me off guard. The legs reveal is a really strong start for a potential full game and sets the tone amazingly. The visuals are also so good. One thing, I think swapping between items would be more efficient with keys rather than mouse buttons.",
      "This is awesome.",
      "Hello fellow GDevelopers! LOVING the mechanics! Great game! Gameplay and art are very solid. A little bit lag on my potato laptop but that's on my part probably lol. Gonna need to do some upgrades. Thanks for making this!",
      "this is amazing, the spider leg thing is super original and the setting i great too",
      "Really great stuff! Jacob is adorable and I really like the background and all the swinging cables. The mechanic is super cool and is fun to use. Great work!",
      "AMAZING SO GOOD OMG. the art is amazing the sound is amazing the game is amazing it is all amazing. really want to see more, (also i managed to get it to work i just had to click Jacob a couple times)",
      "\"WHAAAAT?? WTFF\" that was my reaction to the mechanic I was so not expecting that, it was so weird I love it so much, and the way it moves so awkwardly, that's genius. Really awesome, can't wait to see how it's going to evolve, really well done ! And the art is so beautiful, and the ambiance sound too, I love good sound design, it really makes everything go together. Really an amazing work all around !",
      "",
      "I don't need sleep anyway, thanks XD",
      "Love the environment and the surprising twist in mechanics. Would like a hotkey to swap easily between the different movement schemes.",
      "irs good",
      "Really great entry. Super cool art and really interesting mechanics.",
      "The environment is really nice and the ability of the character is really unique and awesome. Your game definitely leaves me wanting to see more",
      "this game was absolutely crazy. when you first pick up that item thinking \"Oh what could this be\" and then you see what it is I was confused in the best way possible same with the ending. On top of that the ambient snow blowing sound effect in the background was cool plus the actual platforming mechanics were super clean and polished",
      "Very very good game! The jumping sound is sometimes slightly buggy but it doesn't matter.",
      "This was one of the most unique entries.  Awesome job on it.  Total was a feature having to toggle spider in the tent :)",
      "one of the best entries of this jam, it was so good that I want to give some feedback :)1. music. I imagine my enjoyability of this game would double if there was some music2. collision mask. some times character is staying in emptiness (as there is a floor)3. i would add some plot. maybe even some horror things. but I know you didnt have enough timeOverall, I love it 10/10",
      "Parsdon my French, but heck this was freakin' good! I had a blast playing this on stream and left a lot of feedback during the playthrough if you didn't watch the playback yet.Love the atmosphere, the unique character, movement and conclusion. Only real complaint/feedback would be to tie the inventory equip/unequip to a key press so I don't have to pause the action. Excellent entry.",
      "One of my favourite entries so far, I LOVED the atmosphere that you managed to make, but I did find the controls a bit awkward.",
      "I love this,I   just wish the leg mechanic was a bit less finicky along with the collision, other than that I love the paper mario like turn and the elasticity of the character, 1 suggestion you should add the option of using the spacebar to jump I often found myself going to the  spacebar to jump lol, ohh 1 more thing having to shift then press the thing to unequip multiple times was a bit much maybe add a unequip and a equip last button?",
      "That was really neat! I think, if continued with as a larger project, it could be expanded with more abilities, like I was thinking \"Claymates\" from SNES while I played it. The one ability in this was really unique how it was done and how it looked, so if you added more abilities, it'd be cool to see more mechanics that are as unique as shown in this one.",
      "Cool level and I loved the neat legs mechanic."
    ],
    "comments_posted": 12,
    "created_at": "2023-01-14 17:49:12",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877462",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ahnaf30e",
      "member_since": "08 January 2021",
      "posts": "285",
      "topics": "5",
      "followers": "46",
      "following": "19"
    }
  },
  "1876991": {
    "overal_rating": [
      "Score*",
      "3.625",
      "3.958",
      "3.958",
      "3.750",
      "3.917"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.625",
      "3.958",
      "3.958",
      "3.750",
      "3.917"
    ],
    "participant": "xsedim",
    "game_title": "Path",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 15,
    "comments_raw": [
      "Played on stream tonight and left my comments throughout if you want to watch the playback. It appeared so simple at first, but I love the slow reveal and careful placement of elements. Really well done.",
      "Wow, love the harsh total contrast. Itâ\u0080\u0099s amazing how much we can get a sense of the space with so little details, and shapes of objects (though also makes it easy to get lost and fall off if youâ\u0080\u0099re like me and intentionally wander). The reveal of the last moment after getting the flower was just such perfect composition, what a good touch. Definitely want to see more of this :+1: reminds me of video game that was about painting and coloring the world, where you started out all white and unshaded like this. I donâ\u0080\u0099t remember the name at all but if you come across it, Iâ\u0080\u0099m sure you could build more on the ideas it was playing with. This is very ripe for some good storytelling.",
      "Excellent idea of having foreground and background elements be the same white color, reminds me of The Unfinished Swan. The level design is also excellent with the intentional slow revealing of new content.",
      "So poignant. A beautiful art piece with such depth for such a simple layout",
      "I love this art style, I think you've done great for your first 3d game! Now I'm really curious to see how the rest of the story unfolds.",
      "A really interesting start.",
      "Beautiful path to walk along, even though it's only black and white I feel like you've added so much depth and detail to the scene. Loved it!",
      "Love the style of the game and the use of white is really good, especially felt good going over the hill and exploring the path",
      "Soooo elegant. Chef's kiss!",
      "It's a very creative story.",
      "love the simplicity but would like a bit of sound. but overall, noice",
      "Very unique, adding sounds or music would have helped me get into it a bit more but I love it anyway. I like the fact that we cant see the tree, only their silouhette, it's was really poetic. Well done !",
      "I really like the simplicity and style of this. Even more so, I like that it all tells a story.",
      "I love the art style! It kind of reminds me of the first few levels of the unfinished swan with white and black objects revealing each other. the game could use sound effects and I did feel the movement was a tad slow",
      "Cool concept.  The story really leaves me wanting more.  Kind of reminds me of Beyond Eyes (without the terribly slow movement issues).  Nice work!"
    ],
    "comments_posted": 4,
    "created_at": "2023-01-14 07:16:26",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876991",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/xsedim",
      "member_since": "11 June 2020",
      "posts": "39",
      "topics": "1",
      "followers": "5",
      "following": "12"
    }
  },
  "1873586": {
    "overal_rating": [
      "Score*",
      "4.375",
      "4.344",
      "3.938",
      "4.344",
      "3.969"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.375",
      "4.344",
      "3.938",
      "4.344",
      "3.969"
    ],
    "participant": "unburntstudios",
    "game_title": "Planeshifter- Enter The Feywilds",
    "platforms": [
      "web"
    ],
    "rating_count": 32,
    "comments_received": 21,
    "comments_raw": [
      "Lovely atmosphere with great narration! Awesome game!!",
      "Had a blast with this one on stream and was so glad you could join me. Love all the effects and visuals and it ran incredibly well for an HTML build on stream on a Mac. Great stuff all around. Can't wait to see what you make next.",
      "Really amazing aesthetic! The atmosphere is great and I liked the narration. The colors are ethereal and convey a sense of wonder. Great work!",
      "Very gorgeous atmosphere, and I like the narration too! Excited to see where you take this.",
      "Oh this is amazing, reminds me of Jungle Cruise at disneyland or something of the sort!",
      "Very beautiful and unique location for sure ! I'm curious to leran more about this place... well done !",
      "Is a really great game! I love the atmosphere!",
      "Visually stunning!",
      "Really pretty game! I agree with the others that the aesthetic is very pretty! I also think that the UI pulls the player out of the game some. Also, I am not sure if other people experienced this, but the game had major performance issues for me. Could be because it is in browser, or I have several things open, or something. It is worth looking into though, as you continue to build and develop this game. Great job!! :D",
      "Unique and beautiful, this concept could pass of as a walking simulator game on its own. One nitpick would be that the UI boxes pull the player out of immersion, I would recommend using diegetic/spatial UI instead, or use simple subtitles like this:",
      "I...I don't even know what to say.  This was just stunning.  A few collider issues.  But you nailed the aesthetic.  I'm gonna be studying this one for a LONG time after the game jam is over.  Great work!",
      "Wow, this is so stunning! The location is really unique, and I am curious to see how the story and gameplay would look in the future!",
      "This is a really beautiful level, with lovely lighting and models!",
      "Such an awesome game! Visually stunning with lots of cool effects and models, and I loved the touch of the narration explaining elements of the world. top Notch",
      "This is beautiful, I love the word,  and I am vary Intrigued to see what this would be like in a full game. I also love when game have voice acting great touch!",
      "The world you made is awesome and I really like that you are giving details about things as I'm moving around such a beautiful place that I want to explore",
      "The aesthetic does it for me. Loved seeing the world you've created. Great job!",
      "Quite a large feyworld youâ\u0080\u0099ve created here! I guess my browser isnâ\u0080\u0099t quite beefy enough for the fullscreen experience, but looking very nice at the default size. Clearly put a lot of thought into the kore and surprisingly a large number of different feeling areas, could have easily felt too â\u0080\u009csameyâ\u0080\u009d, nice work.",
      "Cool environment. I liked the use of fog and particles and color to make it feel very \"other worldly\". The voice overs are also a nice touch and contribute to the atmosphere.Nice entry!",
      "This was so good. Im a sucker for this kind of aesthetic. That coupled with the postition triggered voice overs was really cool! My mac was struggling to play it in the browser but besides that everything was very cool!",
      "This is an incredible entry for the jam. Incredibly polished, visually astonishing, and definitely a 100/10. Nice work!!"
    ],
    "comments_posted": 55,
    "created_at": "2023-01-11 18:46:11",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873586",
    "coolness": 79,
    "participant_info": {
      "profile_url": "https://itch.io/profile/unburntstudios",
      "member_since": "27 February 2021",
      "posts": "223",
      "topics": null,
      "followers": "8",
      "following": "2"
    }
  },
  "1876567": {
    "overal_rating": [
      "Score*",
      "3.343",
      "3.446",
      "3.395",
      "3.395",
      "3.138"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.611",
      "3.722",
      "3.667",
      "3.667",
      "3.389"
    ],
    "participant": "crayonmelon",
    "game_title": "Purgator.io",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 18,
    "comments_received": 9,
    "comments_raw": [
      "Fun bullet hell navigation, itâ\u0080\u0099s now you make the very clear patterns and create some interesting scenarios where you need to be in a certain place on screen to shoot forward yet are blocked and so forth. Nice level.",
      "Streamed while playing this and commented throughout if you want to watch the playback. It's clear how much thought and attention you put into each enemies movement, look and bullet pattern. With a controller, I could easily see myself getting addicted to this one. Well done!",
      "This is amazing. Great art. Great level design.",
      "Very good! The map looks ok but it's very challenging, which is a good thing.",
      "This is sooo good. Love the different movement and attack patterns of the enemies and how varied they are. The last boss took a lot longer to kill than I expected. I like the message at the end too. I don't think I would have got that far if I didn't get stuck in a root. I think if the player is off the screen, it should be game over. On a normal playthrough, I had a lot of fun and love all of the visual elements, animations and how you have to walk around obstacles as well as dodge bullets. This is one of my favorites.",
      "Great art direction.",
      "really loved the style. the gameplay was extremely hectic but fun to weave through massive waves of bullets.",
      "Love the baked art style, with the bright red bullets, it adds a lot to readability. The environment being hard for the player was also a nice touch, while the enemies just went through.",
      "Creepy! But I'm sure that this is what you were going for, so well done!"
    ],
    "comments_posted": 2,
    "created_at": "2023-01-14 22:24:27",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876567",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crayonmelon",
      "member_since": "22 May 2019",
      "posts": "189",
      "topics": "1",
      "followers": "60",
      "following": "13"
    }
  },
  "1875492": {
    "overal_rating": [
      "Score*",
      "4.392",
      "4.099",
      "4.148",
      "3.611",
      "3.806"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.500",
      "4.200",
      "4.250",
      "3.700",
      "3.900"
    ],
    "participant": "wolfenrahd",
    "game_title": "Reinoshima",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 20,
    "comments_received": 16,
    "comments_raw": [
      "Nice work, i love the art style. The mouse control is the only problem for this entry. I like it.",
      "Really bummed I couldn't get this to work out on stream because this is an excellent entry. I love the feel of the dash, and while it took me a bit to get into the boat without falling in the water, I had fun cruising around and I'm glad you included it. All of the dialogue was enjoyable to read and I like the layers of terrain giving the space an organic feel. Great entry.",
      "Nice game",
      "Love the game concept, I saw a devlog and liked it straight away. I see someone else noticed that the dash 'breaks the game', but they say itâ\u0080\u0099s an easter egg. Thatâ\u0080\u0099s perspective I guess :^)",
      "Very cool looking game.",
      "This was absolutely breathtaking.  Reminded me of the aesthetic from old Might and Magic games, but better.  And I'm definitely hooked on the storyline.  I want to know more!  Great job!",
      "Amazing artsyle. love the dash effect. Location is unique. What else to ask for?",
      "Such an awesome style! I love the style of the game and the npc dialogue is cool.",
      "Ah I remember you working on this on discord! Really solid how it turned out. I caught onto the shift-fly mode and found the little temple room across the water, always appreciate a good easter egg for those that explore. The fade out to the background and overall aesthetic works really nicely.",
      "The aesthetic was very nice, although I had trouble with the mouse on the browser version.",
      "The environment you made is seriously good from every angle, even the sky and the portal that drops you down when going in the water. Enjoyed walking around the island and testing out the dash ability",
      "Didn't expect this to run on HTML, yet had ablasttalking toflambÃ© skelly bois",
      "Really gorgeous lighting and really nice atmosphere to it all, awesome work!",
      "Very beautifully stylized, love the dash. Remember to lock the players cursor in the browser version! Looking forward to see how you develop this",
      "Awesome entry, I really love the aesthetic! I could totally see this as the baseline for a horror game or some kind of action/stealth game where you need to collect souls. Not sure if this was intended but I noticed while dashing, I wasn't falling so I could be floating really high up. If that's intended, I can't wait to see how that mechanic might be used!",
      "I am the new reaper!"
    ],
    "comments_posted": 10,
    "created_at": "2023-01-13 07:16:24",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875492",
    "coolness": 81,
    "participant_info": {
      "profile_url": "https://itch.io/profile/wolfenrahd",
      "member_since": "11 October 2016",
      "posts": "134",
      "topics": "2",
      "followers": "57",
      "following": "35"
    }
  },
  "1873202": {
    "overal_rating": [
      "Score*",
      "1.774",
      "1.774",
      "1.389",
      "1.543",
      "1.312"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.875",
      "2.875",
      "2.250",
      "2.500",
      "2.125"
    ],
    "participant": "ahmedbinnabeel",
    "game_title": "RestaHaunt",
    "platforms": [
      "windows"
    ],
    "rating_count": 8,
    "comments_received": 5,
    "comments_raw": [
      "W wouldn't work for me to shoot, but the up arrow did and then I busted all them ghosts! I'm glad I was able to save Mr. Xanderwood's restaurant! Thank you for submitting. Great work.",
      "Pretty nice art and a cool concept. its weird how you could only shoot in one direction",
      "Nice art style!",
      "Nice! Found the controls a bit awkward to shoot but figured it out. Curious to see how your idea expands on the ghosts being in this catering context.",
      "Fun ghost busting game."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-11 13:08:31",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873202",
    "coolness": 39,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ahmedbinnabeel",
      "member_since": "31 December 2022",
      "posts": "3",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1867691": {
    "overal_rating": [
      "Score*",
      "4.659",
      "4.220",
      "4.488",
      "4.293",
      "3.195"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.659",
      "4.220",
      "4.488",
      "4.293",
      "3.195"
    ],
    "participant": "zedrick1435167gmailcom",
    "game_title": "Riri",
    "platforms": [
      "web"
    ],
    "rating_count": 41,
    "comments_received": 28,
    "comments_raw": [
      "Wow I love this level and idea. Great work!",
      "Beautiful.",
      "Nice artstyle, interesting gameplay, the single thing that is missing is a tutorial or something like that because you donâ\u0080\u0099t understand anything at first view. Nice idea tho! :)",
      "Gorgeous art style. I think this is one of the best submissions! Great work!",
      "Amazing art and atmosphere! The mechanic is interesting and unique as well. Great job!",
      "This is absolutely gorgeous.  After the game jam is over, I'm really going to have to just sit and study this.  This is like the direction I want my platformers to go in.  Wonderful entry.  Great work!",
      "I love the way the character can move in different ways throughout the level and the artwork is fantastic",
      "Beautiful art and very atmospheric, the controls were kind of awkward but overall really good!",
      "This game should be a winner, The best one so far",
      "This game should be a winner, The best one so far",
      "Nice work here! Thanks for hanging out on the stream <3",
      "Beautiful game, scenery, sounds, everything! Lots of potential to make really fun levels out of this too, alongside giving access to new animal spirits. Really excited to see where you take this if you build off of it!",
      "Looks like this is going to be the developer to beat. Amazing work!",
      "Absolutely beautiful, and very polished indeed. Took me longer than a moment to realize why I couldnâ\u0080\u0099t jump, but then was quite a click. I do have to say though itâ\u0080\u0099s a bit awkward trying to wrangle such keys, though maybe thatâ\u0080\u0099s part of the challenge to build up some completely new kind of muscle memory. Well done.",
      "Absolutely beautiful, and very polished indeed. Took me longer than a moment to realize why I couldnâ\u0080\u0099t jump, but then was quite a click. I do have to say though itâ\u0080\u0099s a bit awkward trying to wrangle such keys, though maybe thatâ\u0080\u0099s part of the challenge to build up some completely new kind of muscle memory. Well done.",
      "A super polished and nice game. the way you use the powers of the different animals is super cool plus the art is amazing.",
      "Stunning art in this entry, I love the use of different layers to add so much depth to the scenes. Really beautiful work. I know the gameplay is kind of out of scope for this round, but that mechanic is really interesting. Once I had to chain the bird and money to bird again it really clicked and felt pretty great. The different animals also looked fantastic. Great job!",
      "This game is so beautiful, everything about it is just so stunning! I love the main mechanic, it is so unique and fun to play!",
      "Oh man this is amazing, the art's just beautiful and the mechanic's genius...",
      "This game is next level gorgeous. The use of different powers to traverse the level was kind of mind blowing. And the animations you created for each of them worked so well. I'd love to see more of these levels!",
      "I like the art style. great job!!",
      "I like the art style. great job!!",
      "Love the concept, and the art is great, though I have to say the spirit forest location is rather cliche haha",
      "Played on stream with a friend and left feedback throughout, but I think you've seen it. If not you can revisit, but it's pretty much all praise! I'd have liked it if the animals didn't scurry away until I hit a prompt (I'm sad I missed the monkey). Level layout was immaculate. It all felt like it was free-flowing, but you put the player on a deliberate path that was satisfying. Top marks. Really well done.",
      "This is a really cool concept for a game, its a fun twist on the standard metroidvania style. I also love the artwork, its amazing. great job :D",
      "I really enjoyed the game! It was short, but sweet. My only complaint would be that I wish the buttons were located more conveniently.",
      "Such cool mechanics that fit the spirit of the forest theme! perfect artwork and sound design also. Great!",
      "I loved your gameplay. I had to figure out how to use each animal skill but once we understand it just makes sense. Also very simple but well thought level design, I think it's a great proof of concept ! Well done !"
    ],
    "comments_posted": 4,
    "created_at": "2023-01-08 10:58:02",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1867691",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zedrick1435167gmailcom",
      "member_since": "23 June 2020",
      "posts": "1,440",
      "topics": "45",
      "followers": "77",
      "following": "4"
    }
  },
  "1877253": {
    "overal_rating": [
      "Score*",
      "3.087",
      "2.898",
      "2.583",
      "2.583",
      "1.638"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.083",
      "3.833",
      "3.417",
      "3.417",
      "2.167"
    ],
    "participant": "botzo",
    "game_title": "Scabie",
    "platforms": [
      "windows",
      "linux"
    ],
    "rating_count": 12,
    "comments_received": 10,
    "comments_raw": [
      "I, too, am a fan of Vimlark's videos! I'm glad I stuck it out. At first I thought, this isn't so tough. Then I kept falling at the worst points and it just made me want to make it to the goal even more. Well done. I had a really fun time with this.",
      "Fun and challenging game. The art can better and the control a litle less harder at least for the first level. That's a pretty good game rage material for streamers. Good job.",
      "I never thought I'd one day think \"I wish scabies had wings!\"",
      "Cool mechanic! Simple to learn but you could spend hours perfecting how to use it. I think you could make the art look better as well by putting in some textures on the back wall, but overall a great entry - and thanks for playing my game too!",
      "such a fun game. the gameplay was challenging but fair and it was cool finally getting the hang of it and rising to the top.",
      "I beat level 1! I feel like I cheated a bit using the solid red walls to bite and launch haha :)I like this game. Inside the body is definitely a unique environment, lots of room to take this further for sure, and I would definitely be interested in playing more levels. As for constructive feedback, If you want to take this forward I think you could definitely look into what kind of visual juice you can add around background textures/layers, particles (especially things like fluids etc), camera stuff, etc.I know this isn't a gameplay round, but I did enjoy the mechanics, it was difficult but not super frustrating, I think you got a good balance which can be difficult in a gamejam.Great entry! And congrats on your first solo jam!",
      "This was tough, took a while to get used to the mechanics. But it was fun.",
      "Fun concept! Flappy bird level of frustration!",
      "Creative! Unique! Also difficult, ha didnâ\u0080\u0099t make it too far.",
      "The movement in this game was VERY FUN and VERY REWARDING to get the hang of. I'd love to see more levels and the location is super unique and interesting to me. I definitely see a lot of potential in a fully realised game where a parasite uses various means to travel around different parts of a host's body. Very fun gem. If I were to add any constructive feedback, perhaps the visual design (textures, vfx, etc.) could be more \"fleshed out\" (pun intended) to really sell the unique level location."
    ],
    "comments_posted": 9,
    "created_at": "2023-01-14 12:09:22",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877253",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/botzo",
      "member_since": "14 August 2022",
      "posts": "35",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "1877968": {
    "overal_rating": [
      "Score*",
      "4.000",
      "3.500",
      "3.364",
      "3.227",
      "2.864"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.500",
      "3.364",
      "3.227",
      "2.864"
    ],
    "participant": "hermes3d",
    "game_title": "Scrap Planet",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 10,
    "comments_raw": [
      "Ran incredibly well on HTML and I was even streaming it, so doubly impressive. I love the location. I wanted to explore even more and interact with things, but as for the task assignment, I think you nailed it. Great work.",
      "You made No Man Sky in a game jam?? Wow!Playing it on fullscreen led to one slight move of the mouse turning the camera to the sky, but all was a lot better at the window mode.Tried to jump on the big tower balcony for fun, couldn't reach it, but noticed it was hovering a few meters from the ground. Don't know it that was intentional, great use of the textures!",
      "Nice art style. Great",
      "idk, kinda buggy",
      "Cool planet level and nice models. Good job!",
      "I would give 6 stars for the art if I could. I like the way the landscape is shaped so that as you walk it starts to reveal more of the spaceships and machinery and love that you can jump and look inside stuff. Really cool submission",
      "This game looks really awesome. I would love to see some story elements involved. It does break the immersion a little bit when you can see out-of-bounds areas though. Overall, very cool!",
      "I enjoyed this game! the models were nice, and I loved the atmosphere.",
      "I really like this concept, like a starship graveyard on a desolate desert planet or mars or something. I liked your use of the geometry to break up the terrain into a more interesting level layout with culverts and angles and turns. Would love to see this taken forward :)",
      "Love the general feel to your scene! It reminds me a bit of fallout or even star wars. I'm excited to see where you take this, if you continue to work on it."
    ],
    "comments_posted": 13,
    "created_at": "2023-01-14 21:44:38",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877968",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hermes3d",
      "member_since": "14 February 2021",
      "posts": "151",
      "topics": null,
      "followers": "15",
      "following": "42"
    }
  },
  "1878174": {
    "overal_rating": [
      "Score*",
      "4.800",
      "4.686",
      "4.457",
      "4.486",
      "4.114"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.800",
      "4.686",
      "4.457",
      "4.486",
      "4.114"
    ],
    "participant": "spoonsweet",
    "game_title": "Scrapyard",
    "platforms": [
      "web"
    ],
    "rating_count": 35,
    "comments_received": 25,
    "comments_raw": [
      "I got to say I love it  there were only 2 things I saw when you shake the house thing you can see a black line of pixels on the sprite for a second and the second thing is really nothing but I would like to be able to go behind the building along with that maybe make them semi-transparent when walking behind, but other then that nothing bad I love the art I love the sound I love the footsteps only with the keys were a bit bigger because at first idk what they where. anyways good job",
      "When standing on the top of the mountain, the screen is half the sky and half the snow, with the snowflakes flying in the sky, you just exhale. Then I know this is the right game. Awosome work.",
      "Very beautiful game in a great location.",
      "Obviously the art is exceptional. Level design is also so good. It felt like it continued to open up as I learned what I could and could not traverse, even through the level itself wasn't changing. Great design work",
      "Holy frick is that some good art.  Loved the look of the game",
      "Loved it, artstyle, music, overall vibe... I would even have removed the little gameplay for more art  like parallax in the background to enjoy even more this atmosphere ! Well done !",
      "While the girl was \"enjoying the breathe\" I enjoyed awesome art! I imagine this game being in detective or criminal genre xD. Hope to see more levels and full game. 10/10",
      "Gorgeous game, and I love details like the snow prints. Makes me feel warm and fuzzy inside. Definitely a unique location!",
      "Absolutely beautiful art design, I want to see more of this one!",
      "This looks so good. Great pallete, great pace, a lot of small details that add A LOT to the feel. I really liked this one.",
      "Such beautiful artwork as always, spoonsweet <3 really nice environment and attention to detail with the footprints in the snow and the metal scrap noises. Great work!",
      "Such a cute little character in a game with so much polish. I really appreciate small details like the character outline still being visible when they are behind an object. Full marks from me!",
      "This is so pretty, and it has so many small little details, I really love that clang thing when you walk into the bars!",
      "This is a total vibe",
      "really amazing art. I love the little effects like the snow and the footprints",
      "Adorable art and effects. Love the little footprints in the snow! Level looks great and makes me want to explore it. Great work!",
      "Really nice, love all of the details in the level and things like having the outline of the character when behind a building is perfect",
      "Magic, so beautiful and calming, such a great ambiance, really well done !",
      "Great job spoon, you never stop amazing me!",
      "Wow this is brilliant! Really pretty, got a very calming essence to it, this is 100% making it to round 2",
      "what a spectacular piece of art. Very cozy feeling.",
      "Nice art. really great game.",
      "Top marks. I think you know from the stream playback, I loved this entry. Really well done, spoonsweet. Can't wait to see what you have in store for us next.",
      "Um.. I think this is the first game I've ever fully gave 5 stars on everything... Just awesome.",
      "Very beautiful and quaint, nice work. The little ambient sounds are subtle but very nice. I like how sentiments are displayed in the world as you get near them, adds some nice character. And the character avatar is so cute!"
    ],
    "comments_posted": 26,
    "created_at": "2023-01-15 01:09:19",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878174",
    "coolness": 33,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "894",
      "topics": "3",
      "followers": "152",
      "following": "66"
    }
  },
  "1877011": {
    "overal_rating": [
      "Score*",
      "3.765",
      "3.559",
      "3.471",
      "3.559",
      "3.029"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.765",
      "3.559",
      "3.471",
      "3.559",
      "3.029"
    ],
    "participant": "brainfartstudio",
    "game_title": "Shilo",
    "platforms": [
      "web"
    ],
    "rating_count": 34,
    "comments_received": 26,
    "comments_raw": [
      "Great work! As many comments noticed the mechanic was a bit hard to pull of, great idea though! The music and art (as well as story with the koi fish) are sweet!One suggestion would be to not have Ctrl + WASD, as my browser closed the tab many times when I pressed Ctr+W...",
      "Very cute game and very aesthetic! The sound and visuals are sooo good! I couldn't get past the first jump in the game unfortunately, but what I did see was very pretty! I am sure the rest of the game was lovely! The music was very relaxing! Great job! :DI just accidentally got past the first obstacle. Woo! Time to try the game out for real lol. Nvm. I got stuck. lol! Still really cool game!",
      "Visually it looks great and sounds beautiful!  I love the Story about the Koi turning into a Dragon, it adds a great story building element to help explain the very difficult player controls. Your Games Web Page is wonderful put together.  I just relaxed in this game for like 10 mins - TY for making this :)",
      "I had some trouble with the controls, but I really love the art style and ambience of the game! The inspiration and story behind the game is really unique, and I am looking forward to seeing where you take this.",
      "This was really cool! The music and the art style worked extremely well together. The controls were hard, I managed to get a little far but ended up getting stuck in a wall and having to restart. But the times I did manage to advance felt really satisfying. I would love to see this game in Its full form, so please, don't leave it behind and give us a new release!",
      "Great looking level! Nice particles and feel. I couldn't see much as I kept getting stuck on walls and got too frustrated to continue. Controls were hard to use but that doesn't matter as it is ranked on the level design, not mechanics :)",
      "Game looks great and I know what to do but the controls make it too hard unfortunately. Shame. I'd like to see more though, I'm sure you can improve the control scheme in later rounds!",
      "The simple effect of the snow(dust)  make the scene a better level.",
      "Very cool looking. I was not not good enough to get used to the control mechanics and it took me a while.",
      "I LOVE THE ART :DThe level is actually pretty cool lookin, and the music's pretty good too.Overall, a pretty epic concept and cool art. Would love to see more levels btw :)",
      "I like the story and the music is very relaxing. It took me some time to figure out what to do inthis roomsince the water at the top was a bit hard to distinguish from the background. I'm looking forward to playing the version with 100 rooms!",
      "the game seems to be really nice and the artwork is great but the controls are really janky and make te game really hard to play",
      "Really fun gameplay mechanic, I think there's some small tweaks needed to the sensitivity of movement and control input but all in all very fun and a beautiful environment!",
      "I think this game looks really nice and love the whole story about it but I seem to get stuck in the first wall every time I try to get over it with the bubble dash",
      "amazing visuals and interesting gameplay. great job.",
      "good job!",
      "Very appealing visuals and a well-designed level. Moving around is a bit difficult as others already mentioned but it shouldn't matter that much in this round.",
      "The setting is nice and calming, love the inspiration behind the game",
      "The art style and particles look great but since I don't have a controller I found it very hard to play. I couldn't really get the hang of the controls.",
      "Stupidly easy to clip through walls, however I think the art and the theme is quite sweet :)",
      "Pretty world, nice palette. Controls (which is not what this round is being rated on, so no probs!) are a little awkward having to use the mouse and trying to wrangle the bubble at the same time, but can see that as an interesting mechanic.",
      "Nice game with good music and atmosphere. The controls are hard to use. But still a great game.",
      "Loved this. Would be among my favorite entries if the movement was working as you intended, but hey, that's not part of this round, so top marks from me. You can tell how thoughtfully you designed each challenge. Really well done.",
      "Had an issue with the obstacle / jump in the beginning but despite that I think you nailed the prompt.  Great colors and environment, looking forward to seeing future versions of it.",
      "Super interesting mechanic! My favorite part of this game is easily the colors and tilemap! Can never go wrong with some pink and green :p Excited to see what comes next",
      "I love this color palette. The ground terrain sprites, and the leaves are really well done. The waterfalls look great as well. Combined with the particles (Sakura leaves?) and music it builds a very contemplative space, which it sounds like you were going for."
    ],
    "comments_posted": 53,
    "created_at": "2023-01-14 07:47:25",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877011",
    "coolness": 104,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "306",
      "topics": "2",
      "followers": "34",
      "following": "26"
    }
  },
  "1878001": {
    "overal_rating": [
      "Score*",
      "3.655",
      "3.454",
      "3.254",
      "2.954",
      "2.653"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.842",
      "3.632",
      "3.421",
      "3.105",
      "2.789"
    ],
    "participant": "kristinamay",
    "game_title": "Space Botany",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 19,
    "comments_received": 7,
    "comments_raw": [
      "I liked the art a lot. It reminded me of stickers, or like Paper Mario, really cool style. And I like the user bar actions at the bottom of the screen, reminds me of old PC games.",
      "Played on stream and left feedback throughout my play session if you want to watch. Love the concept and would be really interested to see you keep building on this. Great work.",
      "I read the description of the game and it sounds like this is going to be awesome, it's already looking good btw. Love all of the ideas you have for it and the art is looking great. One thing I think would be beneficial is if you can hold a button down to keep moving a tile every second rather than having to keep pressing",
      "Right now the level is very unique but I don't see a bigger idea of how you could make the game fun and challenging. But maybe you know how to make it more fun.",
      "I really enjoyed the art, it was super vibrant and colorful!",
      "I identify with the running out of time! That being said, thankfully the challenge is to create an interesting level/location, and Iâ\u0080\u0099d say this hits the mark. Fun use of colors, without it feeling overly saturated/eye sore. I do hope to see some martian potato growing in the next update :D",
      "I think the location is incredibly unique, but because no gameplay its kinda hard to critique."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 22:24:40",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878001",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/kristinamay",
      "member_since": "03 December 2018",
      "posts": "54",
      "topics": "1",
      "followers": "27",
      "following": "2"
    }
  },
  "1860772": {
    "overal_rating": [
      "Score*",
      "3.087",
      "2.118",
      "2.118",
      "2.179",
      "1.392"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.923",
      "2.692",
      "2.692",
      "2.769",
      "1.769"
    ],
    "participant": "ortris-studio",
    "game_title": "SquaD13",
    "platforms": [
      "windows",
      "osx"
    ],
    "rating_count": 13,
    "comments_received": 7,
    "comments_raw": [
      "I played this on stream and gave a lot of feedback if you didn't watch the replay yet. This was a fun, short experience and I'd love to see what you'll add to it.",
      "My friend is using the same art for a prototype, It is a cool neon art style (although I'm not a fan of their character animations lol)  Really good pixel art title! Love the font and style of that and how you matched it to the assets :)",
      "Great visuals and art style! Needs more content tho.",
      "Pretty cool game. really nice art",
      "Great looking game.",
      "I see you're also a fellow Godot dev! It's nice to see there are more of our kind here lolz :P I like the art!",
      "Nice art style, good combination of colors. Intro screen very compelling with its parallax glory, and solid animations there :D"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-03 01:06:53",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1860772",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ortris-studio",
      "member_since": "17 October 2021",
      "posts": "8",
      "topics": "1",
      "followers": "1",
      "following": "1"
    }
  },
  "1877998": {
    "overal_rating": [
      "Score*",
      "2.557",
      "2.392",
      "2.474",
      "2.227",
      "1.732"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.429",
      "4.143",
      "4.286",
      "3.857",
      "3.000"
    ],
    "participant": "oscail",
    "game_title": "Suncatcher",
    "platforms": [
      "windows"
    ],
    "rating_count": 7,
    "comments_received": 6,
    "comments_raw": [
      "Great use of post-processing, and the moon texture is really nice - keen to see those fish jumping around too! Awesome submission oscail.",
      "I really enjoyed this one! I loved the physics It felt super cool to walk around the planet plus the music felt super chill and the post processing effects were awesome",
      "Very interesting idea and given it's a level design challenge I think this hits the mark! Loved the lighting and atmosphere in particular.",
      "Nice concept, really curious what celestial fish may come my way in the future! Also really managed to make me feel like I was playing in VR without playing in vr with that distortion ha",
      "Really cool concept, loved it all.",
      "the game looks so good, the music is epic, while i did want actual gameplay, the graphics and artstyle and sound made up for it would love to see this idea being expanded upon"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 22:24:39",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877998",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/oscail",
      "member_since": "04 August 2019",
      "posts": "33",
      "topics": null,
      "followers": "12",
      "following": "2"
    }
  },
  "1878076": {
    "overal_rating": [
      "Score*",
      "3.343",
      "3.240",
      "3.240",
      "3.240",
      "2.726"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.611",
      "3.500",
      "3.500",
      "3.500",
      "2.944"
    ],
    "participant": "pepperboi",
    "game_title": "Sword Flight",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 7,
    "comments_raw": [
      "I love the squash and stretch animations on Bob, they were really fun and made it look super polished, and the death animation as well! I found the mechanics a bit confusing, but once I got my head around it, I had a great time jumping all over the place!",
      "I think with some mechanic tweaks, you're onto something really special here. But those don't matter for this round of rating at all. I loved it and had a blast playing. Looking forward to seeing your next submission. Well done.",
      "",
      "The momentum of the character feels good and while I like the ability to use the sword it was very difficult to do across so many spikes, appreciate the respawn though and I like how the level builds up in difficulty",
      "Cool mechanic! Love the snappy respawn!",
      "I love the momentum based movement. it felt super satisfying to build up a bunch of speed then jump to afar away platform. the art is great and the sword swing animations were super clean",
      "Cool scene and great main gameplay mechanic! Took me a bit to get used to and I'm still bad at it, but nice and creative!"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-15 00:04:44",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878076",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/pepperboi",
      "member_since": "27 October 2020",
      "posts": "750",
      "topics": "20",
      "followers": "40",
      "following": "57"
    }
  },
  "1875384": {
    "overal_rating": [
      "Score*",
      "3.217",
      "2.826",
      "2.957",
      "3.130",
      "2.783"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.217",
      "2.826",
      "2.957",
      "3.130",
      "2.783"
    ],
    "participant": "fennecfu",
    "game_title": "Temple Journey",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 15,
    "comments_raw": [
      "Nice one i like it",
      "Great work, FennecFu. Had fun with this on stream and would love to see where you go with the puzzles if we continue these entries in future rounds. Well done.",
      "this game made me smile))) good job, would like to see diverse of controls",
      "A good start! The character art is unique and the puzzle is pretty classic! As others have mentioned a zoom out or some other way to know which pipe I'm affecting would be great. Nice job!",
      "A very classic puzzle, that's what I love.",
      "Loved it! Unique location!! I'd love to see why your character is their in the first place? and what the story is!",
      "I love this concept, and it is a puzzle game that I would love to keep playing! I agree with what the others are saying, to fix the scaling a bit of the art, but I do like the style, it's really unique, and thats so cool how you converted pixel art to vector i didn't even know that was possible LMAO",
      "The art style and level design are nice, but the location can be a tad generic. If you wish to develop this further, it is important in these kinds of puzzle games to show which valve affects which pipe, possibly by color or small pipes connecting them. You can also zoom out so the player can see more of the level at once.",
      "I think the game definitely has potential, like the artstyle, which looks really nice except for some parts where you scaled the objects differently and it looks a bit off. The puzzle in the level is quite simple, but the mechanic of turning on and off water flow could have potential if used in harmony with other puzzle mechanics.",
      "whoa hand drawn! nice! simple puzzles",
      "I always enjoy the personality of your characters! This smile beneath the beard hides a lot... I don't know if I should be scared.",
      "This was a pretty cool game! the puzzles were simple but I enjoyed them, It will be cool to see what more could be done with the mechanics. Plus the art is really nice.",
      "The art is great, this first level showcases how the puzzles will be solved in an easy to understand way and I like how you have ladders to make the movement more interesting, but I do wish for a jump button. I'm sure future levels will have more challenges but the concept is great so far",
      "But now that the water has stopped.... what happens to the pipes??? these questions need answering FennecFu.",
      "Interesting color palette, fun rounded shapes. The level created feels a bit generic, but did at least include one switchback, a staple of puzzle design."
    ],
    "comments_posted": 30,
    "created_at": "2023-01-13 00:16:04",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875384",
    "coolness": 33,
    "participant_info": {
      "profile_url": "https://itch.io/profile/fennecfu",
      "member_since": "26 June 2018",
      "posts": "515",
      "topics": "6",
      "followers": "33",
      "following": "18"
    }
  },
  "1876738": {
    "overal_rating": [
      "Score*",
      "4.032",
      "4.194",
      "4.000",
      "3.613",
      "3.968"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.032",
      "4.194",
      "4.000",
      "3.613",
      "3.968"
    ],
    "participant": "cjtheegamedev",
    "game_title": "The Hyper Pop Collective - GDKO 2023 Round 1",
    "platforms": [
      "web"
    ],
    "rating_count": 31,
    "comments_received": 20,
    "comments_raw": [
      "Digging the vibe, cohesive visuals and spatial audio. I wish the enemies in the training room would have worked out(looked cool in the devlog). Keep up the great work, hope you make it to the next round!",
      "Love this and the dialogue you have with the NPCs!!",
      "Ah man, I was so convinced you donk'd up the audio with it only playing in my right headphone when I started playing! Then I started moving, the music filled out, and the level came together from there! Really enjoyed the music and the neon aesthetic! Great work!",
      "Played on stream and I'm glad I did. I needed that dance break and I'm glad you got to watch the feedback. This is such a, as you put it, \"fever dream.\" It works really well though and I could see myself loving bouncing between relaxing with my agent buddies between sessions of intense missions. Great entry. Loved it.",
      "I really like the palette and simple pixel art. Looking forward to see where this goes from here. Now that song is suck in my head.",
      "The music is banging, such a vibe place",
      "Everything about this is right up my alley.  The bright, flashy aesthetic.  The humor.  SWEET RAVE PARTY!  The whole thing.  I really have no real critiques aside from not having more of the game.  I need more of the game!",
      "This was amazing! The music is what makes it, such a good track that you can't help but bop to and I was smiling and saying \"yes!!!\" the whole time playing lol.  Love the idea of partying agents, kind of silly, fun, awesome tracks to listen to. And the shooting mechanic was fun and easy to see how it could be used in the future. I want to see more!",
      "I have nothing to critic, everything fits perfectly, also I want to thank you for introducing me to the good music artist, been playing it on the loop now XD",
      "Everything about this is great and I want more of it.",
      "love the environment and the humor! my only problem was the music from the RAVE ROOM (which was great) was blasting into only one ear until i got close, so i was basically deaf for the first half of the game lol",
      "stereo *5D* music effect is cool!!",
      "I really like the environment concept here with the starstuff or asteroids etc flying along in the background. A good feeling of momentum and atmosphere. Lots of great visual juice (Musics good too). Nice job!",
      "The colors. Vivid.",
      "The music was so..... dope! This game is simply FUN!! Loved it : )",
      "Great music, was vibing the whole time. Really cool environment idea and im interested in what the it would be like with more gameplay",
      "Really awesome environment, would love to see what this turns into if you keep working on it for future rounds! Especially curious what kind of gameplay you'd have in mind for this.",
      "Great art style, love the dialogue between the characters especially the guy on the toilet lol and the way you shoot in the combat training room is awesome",
      "i love this so so much! the art style is nice and i think your concept is really unique. i also loved the animations on the speaker/radio things that was cool",
      "super fun to explore and talk to the npcs. Liked the sponge bob reference that was cool, plus the music was an absolute blast and the art was on point"
    ],
    "comments_posted": 12,
    "created_at": "2023-01-14 06:48:47",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1876738",
    "coolness": 11,
    "participant_info": {
      "profile_url": "https://itch.io/profile/cjtheegamedev",
      "member_since": "03 November 2022",
      "posts": "59",
      "topics": null,
      "followers": "10",
      "following": "35"
    }
  },
  "1877001": {
    "overal_rating": [
      "Score*",
      "2.006",
      "1.774",
      "1.697",
      "1.543",
      "1.234"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.250",
      "2.875",
      "2.750",
      "2.500",
      "2.000"
    ],
    "participant": "xenoparrot",
    "game_title": "The Tree",
    "platforms": [
      "windows"
    ],
    "rating_count": 8,
    "comments_received": 7,
    "comments_raw": [
      "I liked the gravity, but I did find the gameplay to be a bit basic.",
      "Its a cool game i like it",
      "I really like these 3d planet gravity games they are very cool. I also enjoyed the art for the sun",
      "Love the idea and execution, some more assets to fill the environment or different biome's would have provided a little more variation.",
      "Nice, another fellow godotâ\u0080\u0099r, and also I think you managed a nicer/smoother day night transition than I was able to muster up so nice work on that! Not too much to look around at but still interesting.",
      "A cool idea, looked great.",
      "A nice little calming game where you find the tree. I'm also glad to see someone else using Godot"
    ],
    "comments_posted": 5,
    "created_at": "2023-01-14 07:06:39",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877001",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/xenoparrot",
      "member_since": "07 February 2021",
      "posts": "233",
      "topics": "2",
      "followers": "9",
      "following": "1"
    }
  },
  "1877150": {
    "overal_rating": [
      "Score*",
      "4.120",
      "3.600",
      "3.920",
      "3.960",
      "3.680"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.120",
      "3.600",
      "3.920",
      "3.960",
      "3.680"
    ],
    "participant": "loten",
    "game_title": "The Word Mage",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 15,
    "comments_raw": [
      "If there weren't 100 other entries to play and rate, I think me and my buddy would have gone back and forth with this on stream for hours. Excellent work.",
      "Really fun and I did even better once I started using the Shuffle button. It would be cool if there were powerups on random letters, kind of like multipliers in scrabble. Could be similar kind of thing, like if the powerup is on \"G\" that a skeleton is on and you use the G, then you get a double damage for that letter.",
      "A very fun puzzle game.",
      "Nice mechanics! I played this for a while... haha",
      "Really liked seeing enemies added to a familiar idea.  Fun twist.",
      "Really liked seeing enemies added to a familiar idea.  Fun twist.",
      "The gameplay is a really cool idea.  Would like to have some audio while playing.  But with the jam focused on art/visual design, not as important.  Overall, really like this concept.  Would love to see you keep going with it!",
      "I got a score of 49. This is a really good game, probably one of my favorites. Love the gameplay as well as the art",
      "I got a score of 49. This is a really good game, probably one of my favorites. Love the gameplay as well as the art",
      "I really like the gameplay here! The gradual increase of stress as all the monsters piled up mixed with rapidly finding new words really made me feel like a wizard. The setting is interesting (using a book as a level). I'd love to imagine a version of this game with more vfx and sfx to really sell the feeling of using magic.",
      "One of the more fun games in the jam, got me playing up to a score of 120, you should definitely consider developing it further.",
      "Liked this game a lot!",
      "pretty cool Game. I loved the art and having to spell words on top of enemies to deal damage was very interesting",
      "Fun game, had me racking my brain for long obscure words",
      "i really like this concept, and it was fun to play! the art style was great too!"
    ],
    "comments_posted": 13,
    "created_at": "2023-01-14 19:13:55",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877150",
    "coolness": 40,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "159",
      "topics": null,
      "followers": "15",
      "following": "6"
    }
  },
  "1867862": {
    "overal_rating": [
      "Score*",
      "3.516",
      "3.710",
      "3.645",
      "3.419",
      "3.387"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.516",
      "3.710",
      "3.645",
      "3.419",
      "3.387"
    ],
    "participant": "malek-elsady",
    "game_title": "The mouse, The cheese, And the disembodied arm",
    "platforms": [
      "web"
    ],
    "rating_count": 31,
    "comments_received": 23,
    "comments_raw": [
      "You know I got that cheddar! Love the unique controls and I had a really fun time playing this on stream. Thanks for sharing your work.",
      "Interesting game here. This game is giving me a Hotline Miami vibes, leaving behind all of the corpses. It felt weird to me that I had to stop moving to turn, but yet I can easily spin the gun around and shoot in all directions.",
      "Unique gameplay with just the mouse! Story and location are quite funny too. Nice job",
      "This was fun! The idea of controlling the mouse only with your mouse was a really cool concept. Although I Got promised cheese in the title and didn't see anything at the end  :(Nice game!",
      "Uh, wow. Incredible game. Very good!",
      "lol mousception",
      "I love the art style, and the story is so great!",
      "Pretty cool. Feels a lot like endoparasitic. I like the \"mouse-only\" controls (not sure if thats intended or not), but the mouse should be faster. Also wheres the cheese?  think there should be more cheese lying around or something, since its supposed to be a cheese museum.",
      "Brilliant top-down zombie shooter. The ending text got me lol Awesome job, man!",
      "This is brilliant! I love that the character is a mouse that can control the arm. It's so satisfying to shoot the gun",
      "Great short and to the point introduction of the story, preparing for the comical elements that will follow (as if the name was not a give-away :D )I especially appreciated the starting area being a corridor I had to get familiar with the movement before I could move. While I do understand people's slight frustration with the movement system, after playing through it all I have to say, I now view it as an advantage for your translation between species communication: as a human I can move the human arm with great precision, yet cannot easily walk a mile on a mouse's shoes. That said, I agree with comments about the speed, perhaps having an acceleration added, that picks up speed would allow greater movement through the long corridors. Needless to say, I tried moving with the gun's recoil (beautifully animated and coded by the way, with SFX for shots, and reloading etc.) to some success.",
      "The text when the mouse got the arm xD Loved the funny texts all along, great atmosphere (just missing music, but that's me and my sound design love) Well done !",
      "Awesome game. I love how comically large and powerful the gun feels when it's juxtaposed against the mouse. I also love the use of the mouse to move a mouse, though perhaps accessibility options could have been nice for people who use trackpad.",
      "The game is good, and I believe you are inspired by Miziziziz's Endoparasitic. The way the gory art style when humans are dying and the way the controls feel (if it is better) feels quite similar. I like the level, but I wish you can make the barriers to be a bit more precise. For example, from your second and third examples, those small boxes are one giant wall, but it feels like the player can squeeze through that gap. But the realization hits and apparently it isn't.",
      "I have to say, the concept is VERY EPIC! I love the atmosphere and the game is honestly kinda fun :D",
      "Yeah the controls got in the way for me, I couldnâ\u0080\u0099t play on my laptop [no middle mouse button to press] (Iâ\u0080\u0099ll try again later once I boot up my pc for the other non web entries review). But from what I recall seeing on discord, definitely seems like a fun and very unique concept.",
      "Controls were hard to get the hang of, but it's cool that you can move by firing the gun.This is definitely an entry that I'd like to see more of.",
      "Fun concept.  Like others said, controls are a little odd.  Maybe ASDW to move/mouse to aim and shoot?  Just brainstorming.  All around, I like the idea and would be curious so see it in a full game.",
      "Very cool, loved the Miziziziz inspiration, mouse rotates pretty slow though.",
      "the atmosphere was very cool. The control scheme was a bit weird at first but I got used to it. I kind of didn't like how slow the player rotated but I did like the location.",
      "Finally got there, and now that I could actually use a mouse (to control the mouse ha) itâ\u0080\u0099s fun! I kind of like the way it forces you to choose between movement, turning, and shooting. I always appreciate trackpad-eligible controls and other cross platform ways to play, I suppose you could map to arrow keys for right/left/press both to move forward and it could be about equivalent, but all in fun entry.",
      "I am in love with your shooting mechanics and aesthetics, good job!",
      "Awesome and impressive!"
    ],
    "comments_posted": 11,
    "created_at": "2023-01-08 13:19:30",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1867862",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,031",
      "topics": "14",
      "followers": "44",
      "following": "50"
    }
  },
  "1870157": {
    "overal_rating": [
      "Score*",
      "4.391",
      "3.870",
      "4.043",
      "3.826",
      "3.522"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.391",
      "3.870",
      "4.043",
      "3.826",
      "3.522"
    ],
    "participant": "luthfialdihe",
    "game_title": "This Space of Ours",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 14,
    "comments_raw": [
      "Very cool idea, would love to explore it even further. Hopefully you'll make it a full game someday",
      "More dev mode. More dev mode!!! Great entry. I had a blast with it.",
      "Nice job on this! Will be cool to see how you progress the environment in future rounds.",
      "I enjoyed the game a lot. As a full game, the story would be very interesting.",
      "I like the art style! And the great feeling to the UI and Text!",
      "The level design is excellent, would love to see more. I am conflicted as the location is both very generic yet unique haha, I feel like more could be done to sell that it is indeed a unique space.",
      "I like the minimalistic art style very much! The tutorial was short and precise. Overall, the game has a solid foundation. Great work!",
      "I loved picking up the box and moving it around, and I love the story so far, I'm excited to see how it develops!",
      "Looking good so far, the dialogue is a lot of fun but I think having voice over for the text would make it even better. The ability to grab and move a box is pretty cool too and love the flow of the game",
      "great concept, smooth scontrols, kinda lack some sound effect",
      "what is missing is the sound effects! good job want to play full game! (and I also stucked after dropping the box)",
      "love it and really want to see more. also i managed to get stuck in the floor after dropping the box on my head ._.",
      "A pretty nicely polished dialogue and character intro, and the transitions and all were nicely smooth. Excited to see more of how this conversation develops! (Minor point from an accessibility standpoint though, was hard to read text as it was being typed, moving to the left while also going to the right)",
      "This was a really cool game! the dialogue was very fun, and the story had me intrigued."
    ],
    "comments_posted": 23,
    "created_at": "2023-01-09 14:49:43",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1870157",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/luthfialdihe",
      "member_since": "25 January 2020",
      "posts": "333",
      "topics": "9",
      "followers": "15",
      "following": "3"
    }
  },
  "1877088": {
    "overal_rating": [
      "Score*",
      "4.594",
      "4.406",
      "4.094",
      "4.375",
      "3.844"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.594",
      "4.406",
      "4.094",
      "4.375",
      "3.844"
    ],
    "participant": "lio-lim",
    "game_title": "Uyuni",
    "platforms": [
      "web"
    ],
    "rating_count": 32,
    "comments_received": 25,
    "comments_raw": [
      "Wow, the fog made it quite a lot harder. Very cool game.",
      "While the gameplay is simple, it cannot be understated how beautiful the artwork is, and how great the reflections are, amazing.",
      "so well thought out in level design details! the reflection helping when it gets foggy, the simple jump and dive controls, the sfx and art.. very clean game",
      "Amazing usage of the world blending in with the mechanics, the hearts appearing after the first hit, the SFX and VFX, the fog slowly leading you to use the reflection  more and more... genius! Really enjoyed this experience! Can't wait to see more!",
      "This is just stunning, the art is beautiful, and it's a very relaxing game to play! :)",
      "This looks spectacular, it's awesome that the character is literally running on water and I imagine the roll would be great for smashing something",
      "Gorgeous art and effects! Very calming SFX and music, and the reflection mechanic with the clouds added a nice challenge! Great work!",
      "Amazing, the art style and lake reflections work very well together. The tutorial was clear and the gameplay was pretty unique. Sometimes it was confusing where to roll to though. Great job",
      "Awesome!",
      "this game is truly amazing and unique, the art style is really great and gives an unique mood to the overall game,  really like the idea of the fog, and having to use the salt mirror to see, its truly somthing i have never seen before, controls also feel great. The tutorial is simplistic but really clear, but an indication as to when and how to roll down would also have been good",
      "Gorgeous. The parallax layers and reflection off the salt flats look amazing. Really evocative night time palette as well with the purples. I always appreciate when people add that extra level of polish and juice to jam games like the audio queues for the title card and the particles. Nice Work.",
      "I love the pixel art mixed with the effects. I really like how the water is not just something beautiful, but also comes into play later on in the level. Nice job.",
      "Great work, i noticed that clouds making spikes fully invisible, maybe players shoud have at least some vision of them? waiting for updates",
      "Really cool game! The aesthetic and atmosphere is so pretty! I found jumping to be a bit annoying either due to the game running slowly or the way the mechanics felt. The music is very calming and fits the artistic style you are going for! Great job!",
      "Very visually beautiful and I like how the reflection isn't just there for aesthetics, but also serves a purpose of showing you what's coming up when there's smoke in the way. I love the little character's animation too.",
      "Cool stuff.",
      "OOOHHH BOI IDK WHAT TO SAY FOR THIS!",
      "Really dope game and I love the dust that appears after running for some time. The assets you chose fit perfectly together. Also that water shader doe!",
      "This is such a beautifully simple game. It feels almost Zen just jumping through the level. plus that water effect looks absolutely stunning",
      "For as simple as it is, this is beautifully executed.  Love the fog that comes in the farther you get to make it more challenging.  Gonna have to study the background layering and that water shader once the jam is over.  Great job!",
      "This is a great game ngl! Nice visuals and gameplay.",
      "Whoua that's a beautiful game",
      "",
      "Stunningly gorgeous, hands down my favorite visuals of all the entries! Especially the water and reflections, really impressive.",
      "Beautiful game with relaxing music and SFX, the gameplay is classical but works great and the twist is really cool. It looks like controller worked for me but only for jumping (no rolling/menuing). The location is also quite unite, looking at satellite images I always assumed it was snow!"
    ],
    "comments_posted": 36,
    "created_at": "2023-01-14 16:43:00",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877088",
    "coolness": 40,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "342",
      "following": "28"
    }
  },
  "1875254": {
    "overal_rating": [
      "Score*",
      "4.739",
      "4.609",
      "4.565",
      "4.478",
      "4.391"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.739",
      "4.609",
      "4.565",
      "4.478",
      "4.391"
    ],
    "participant": "jebouin",
    "game_title": "Uzuan Orbital",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 14,
    "comments_raw": [
      "The animations are great, and I love the little sound effects, and how the sound changes once you are inside! The art is absolutely incredible!",
      "really amazing, best game i've played so far",
      "Incredible. I loved so much about this and I'm not usually a bit puzzle guy. The controls were so fluid and the polish was off the charts. I played on stream and left feedback throughout my play session if you wanted to watch. I'm incredibly impressed and look forward to your next submission.",
      "This was a fun unique level.",
      "So polished! The location itself is not amazingly unique, but the amazing upgrade area, the IK on the legs, the sounds, the puzzles,... It's a really well done game! Technically brilliant",
      "This is probably on of the most, if not the most thought out level in this whole jam.Like minedblowing honestly. THE IK animationzzz were SOOO epic :D love the spidey robot guy. AND BOI, the way the gun thingy rotates and moves is just*cheif's kiss*.Honestly can't think of any bad thing to say lol.",
      "The character is amazing and love the artwork for the level",
      "I think I saw a picture or video of this early on in the jam.  Maybe on Twitter?  But man, it is on a whole other level than I expected.  There is so much attention to detail in this.  A few bugs (which others have mentioned) and the puzzles leave you stuck sometimes.  But for a 2 weeks game jam, I'm incredibly impressed.  Will definitely be studying this one more once the jam is over.  Great work!",
      "Thatâ\u0080\u0099s next level! This game is so well made. Good job! 5/5",
      "This is amazing. I love the art style and the animations were really good. The concept is both unique and fun. There were a few glitches with the IK. Overall, amazing job.",
      "Insanely well polished. Great IK animations, love the aim assist, there are excess gears so that the player doesn't need to get them all to complete the game, and the whole concept of the rotating environment is unique and well explored. Full marks from me!",
      "Oh yeah, like others I really enjoyed the animations in this. Even more than the player character's animations I really liked the projectiles swirling in the orbs once they're activated.",
      "The player's animations really did this for me. I also really love that the ship is interactive.",
      "This game is insane. Such Incredible art, sound design, game design. Its basically a full game which is insane. Its one of if not the best game I've played so far"
    ],
    "comments_posted": 5,
    "created_at": "2023-01-14 23:56:43",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875254",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jebouin",
      "member_since": "20 December 2013",
      "posts": "116",
      "topics": null,
      "followers": "106",
      "following": "16"
    }
  },
  "1877910": {
    "overal_rating": [
      "Score*",
      "4.515",
      "4.485",
      "4.242",
      "4.333",
      "3.455"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.515",
      "4.485",
      "4.242",
      "4.333",
      "3.455"
    ],
    "participant": "spacespy",
    "game_title": "Veggie Boy Vs Meat Man",
    "platforms": [
      "web"
    ],
    "rating_count": 33,
    "comments_received": 22,
    "comments_raw": [
      "Nice meatballs! Enjoyed bouncing around in here.  Great art and bounciness to it all.  Will be a great environment to implement whatever the future challenges are.",
      "Very cool level! I mainly love the meatballs you can use to jump higher.",
      "Everything looks great and the controls are nice and clean.",
      "juiiiccyyyyyyy. Wonderful art and gamefeel.",
      "Nice juicy level Space! Cool super meat boy vibes ð\u009f\u0098\u008e",
      "Very polished, hope you make it through and expand on it.",
      "Looks good, feels good. 5 stars.",
      "Adorable character and location! Really like the particle effects and animations, great work!",
      "Great world you've built, disturbing meat-world seems juicy! The effects add a lot and blend nicely with your art!",
      "the game looks so good and i cant wait for more gameplay",
      "Awesome art style. The moving mountains make this look like somewhere inside a ship floating on water or a giant breathing monster and hence all that meat. Regardless of what it is, this is some cool stuff. Good job.",
      "An extremely polished game for a game jam. The art is amazing and the sound effects are really good. The only downside is there isn't more.",
      "Nice controls and art style, I can't wait to see more.",
      "This is really awesome I hope I get to see more of it",
      "A very juicy game. The spring animation is so fluid! Great work!!",
      "I love all of the particles and animations, and I think this is quite a funny and unique location!",
      "Very cute entry, love the animations and sound effects! If you have extra time and plan to continue working on this, I think it'd be neat if you could drop down from the platforms, such as by pressing the down arrow or something like that.",
      "Really nice artwork and I love the swinging platforms, portals and springs",
      "the art is super good! I love the squash and stretch it really makes the game feel polished. plus the sfxs are nice",
      "sound design could use some work but the overall game feel and look is really nice and polished",
      "Really fun to play!! looking forward to seeing what you add to this!!",
      "I'll repeat what I said when I streamed this ... please give me an open room with a meatball so I can bounce away to my heart's content! Great work, Spacespy. An excellent entry."
    ],
    "comments_posted": 20,
    "created_at": "2023-01-14 21:12:04",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877910",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spacespy",
      "member_since": "06 June 2020",
      "posts": "477",
      "topics": "7",
      "followers": "127",
      "following": "140"
    }
  },
  "1878119": {
    "overal_rating": [
      "Score*",
      "2.699",
      "2.858",
      "2.593",
      "2.329",
      "2.117"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.176",
      "2.882",
      "2.588",
      "2.353"
    ],
    "participant": "dead-cassette",
    "game_title": "ViroBites",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 9,
    "comments_raw": [
      "the camera movement when moving the mouse is way too intense/disorienting maybe turn it down a little",
      "the camera movement when moving the mouse is way too intense/disorienting maybe turn it down a little",
      "Nice little puzzle switchbacks - one recommendation for level design is to really make it clear what is â\u0080\u009clockedâ\u0080\u009d, ie reveal the wrinkle so the player knows the goal before they stumble across the solution. I shifted both levers (via shooting through walls/through the gate) before knowing what they even did :) I did beat the big bad cube though!",
      "Played on stream and left feedback throughout the session if you wanted to watch. Enjoyed you thought and care you put into the level design. This was a blast to play.",
      "Nice idea, it would be nice if the virus would be doing something else than standing.",
      "The core idea is definitely in place.  Would love to see the combat implemented.  All around, a good entry.  Nice work!",
      "I like how you can destroy rocks and open gates in the game. I think once the enemies can move and fight back, especially that big boss, it's going to be really awesome",
      "I love this game! the art is cool and the gameplay is fun.",
      "Core gameplay is great, the main character reminds me of that guy from Osmosis Jones! The camera movement was a little jarring, might need a bit of a buffer zone if you want it to move based on where the mouse is. Still really liked it though!"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 23:56:55",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878119",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dead-cassette",
      "member_since": "05 February 2021",
      "posts": "5",
      "topics": "1",
      "followers": null,
      "following": null
    }
  },
  "1877912": {
    "overal_rating": [
      "Score*",
      "3.487",
      "3.027",
      "2.763",
      "2.500",
      "2.105"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.818",
      "4.182",
      "3.818",
      "3.455",
      "2.909"
    ],
    "participant": "jbric",
    "game_title": "VisLevel R1",
    "platforms": [
    ],
    "rating_count": 11,
    "comments_received": 8,
    "comments_raw": [
      "Small little area, but reallllly like how itâ\u0080\u0099s looking. Though not part of the criteria for this round, the character movement is just so fun (even though itâ\u0080\u0099s only a rectangle so far, Iâ\u0080\u0099m sure itâ\u0080\u0099ll be even better once itâ\u0080\u0099s an avatar!)",
      "Absolutely beautiful. I love the use of a layered environment, so cool. Would love to see more levels for sure. My only complaint is not enough people have rated this game!",
      "Really nice Darksouls-esque atmosphere, great job!",
      "This is absolutely beautiful.  The handcrafted feel, the lighting, the particles effects.  Everything.  Very well done.",
      "Kind of reminded me of hollow knight it looks awesome! the art is really great and I love all the effect",
      "Great looking level.",
      "Loved the art style, really clever use of lighting and particle systems. Aesthetically great!",
      "the game looks good, i love the artstyle, just wanted to see some gameplay, but this could make for an epic game"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 22:31:53",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877912",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jbric",
      "member_since": "23 November 2021",
      "posts": "0",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1877974": {
    "overal_rating": [
      "Score*",
      "4.773",
      "4.591",
      "4.500",
      "4.682",
      "3.955"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.773",
      "4.591",
      "4.500",
      "4.682",
      "3.955"
    ],
    "participant": "reillystudios",
    "game_title": "Whiteboard World",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 14,
    "comments_raw": [
      "My personal favorite of the jam. It's brilliance wasn't fully apparent until literally when it ended. Man I want to play more, and in a windows build so it has better performance. How did you make a metroidvania in such a short time? Full 5 stars.",
      "I had so much fun with this on stream. Both playing and analyzing it. Excellent work. Looking forward to what you make next.",
      "This is a really interesting and unique environment, very fun place to explore. What a fun  entry! I love the postit notes and marker pens and other flourishes that really sell this space.",
      "One of the more unique locations that I have come across so far. I really feel like you can go far with this idea. This is the type of game where you can get away with simple hand drawn art instead of blocking out the level like you did. The character art is perfect, why not do this for all aspects of the game? How about adding some in some other colors each with their own effect? How can you incorporate the sticky notes, magnets, and other items in to the gameplay?",
      "great little platformer, would love to see more with this idea",
      "Well Done!",
      "Great game. Hope you make it through to round 2 so we can see more.",
      "this is like if you mix fancy pants, vex 4, and big tower tiny square with white boards. i love it realy want to see more of this game!",
      "Metroidvanias and platformers are where I plan on focusing in the future.  So I always like to take note of good ones.  And this definitely is a good one.  The few suggestions I have are things you already made note of or have been mentioned already.  Really good entry.  Looking forward to seeing this take shape.",
      "This is really good, love the location and the movement in it as well as the effects from the lightning and artwork around the level. There were a few places I fell out of the whiteboard and felt it was unfair to die walking into the side of the crushing bits. It was super fun to play though and loved to explore all of the areas and I got to the end. Look forward to more levels with the dash ability in it",
      "I love this art style ! The location is super unique and I love the little touches like the blue tack, markers, sticky notes, and magnets on the board",
      "Looks like such a good game, a shame that it won't run for me, instead glitches out and says something or rather on my browser is out of date, it isn't, however when I went to go play something else developed in construct it showed the exact same thing, despite me playing games made in construct before yours, there's clearly something wrong there.",
      "this is such a unique location, and i love the art style!",
      "really nice game, premise and great adaptation to the theme, id really like to see a long metoidvaia game in this style"
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 21:51:54",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877974",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/reillystudios",
      "member_since": "30 May 2021",
      "posts": "29",
      "topics": null,
      "followers": "14",
      "following": null
    }
  },
  "1863589": {
    "overal_rating": [
      "Score*",
      "2.481",
      "2.602",
      "2.663",
      "2.360",
      "2.300"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.154",
      "3.308",
      "3.385",
      "3.000",
      "2.923"
    ],
    "participant": "stuckarcader",
    "game_title": "Your Robo Spaceship",
    "platforms": [
      "windows"
    ],
    "rating_count": 13,
    "comments_received": 9,
    "comments_raw": [
      "Nice styling on the environment, reminds me of Antichamber especially with the chromatic aberration. As others have mentioned, the pace of the game is way too slow to start, I can see this with twice the firerate and still having good progression through upgrades. The location is also rather cliche, but it is a great juicy game nonetheless.",
      "I liked the game, although I found it to be a bit too slow.",
      "Cool visual effect and I wonder that you  can still implement traders in your game. Bravo",
      "I'm impressed by many mechanics/ visuals in the game ! My main frustration was the controls of the ship which are super heavy, I could see many props in the space I wanted to check but I just didn't have the time to reach them :') I loved the whirlwind prop that catch and project you so I was curious about the others...",
      "Cool game with a fun mechanic.",
      "Pretty good game. I liked the models and the post processing effects were really cool",
      "Great concept and absolutely love the art style, fits perfectly. Would make a great mobile game IMO!",
      "Inflation even be hitting in deep space, those shop keepers really gonna extort! Nice work, really makes you think carefully as you angle and calculate your trajectory when youâ\u0080\u0099ve got such a low fire rate. Though maybe a little too slow paced lofting in space (at least for the price reward for upgrading).",
      "Wow. this game is great! one thing its lacking is any form of in game lore, instrctions, or tutorial. even just some text saying \"Press ` for controls menu\" would work. other than that, amazing work!"
    ],
    "comments_posted": 19,
    "created_at": "2023-01-05 11:16:31",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1863589",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/stuckarcader",
      "member_since": "20 November 2021",
      "posts": "268",
      "topics": "20",
      "followers": "28",
      "following": "31"
    }
  },
  "1877841": {
    "overal_rating": [
      "Score*",
      "3.858",
      "3.549",
      "3.549",
      "3.292",
      "2.880"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.167",
      "3.833",
      "3.833",
      "3.556",
      "3.111"
    ],
    "participant": "doc-cyan",
    "game_title": "_actiongame",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 11,
    "comments_raw": [
      "The art style is great, and I loved the intro. I found the mechanic slightly confusing but it was a really cool idea, I've never seen anything like it, a platformer where everything jumps, the concept is so unique!",
      "Super interesting indeed. I think you could come up with a less awkward way of selecting or changing what element is getting the jump power, felt kind of awkward, but the nugget of the idea is gold for sure, looking forward to seeing more.",
      "A platformer where you make everything else jump! I love the idea and had a blast playing this on stream and left feedback throughout my play. Great work. An awesome puzzle platformer.",
      "Really cool core game mechanic! The clicking was a little finnicky, especially when there were two boxes to work with, but I still loved the overall idea, style, sound, everything!",
      "Great game mechanic concept! Can make a really interesting puzzle game out of this, similar to Baba is You",
      "Great idea and style, I love it. There seems to be few bugs too but they are not too bad.",
      "Great concept here - I think maybe things would be easier to control if mousing over an object highlighted it so you knew you were about to control it? But in any case, the puzzles were nicely balanced for difficulty I think!",
      "Love it. It's a really cool and unique idea for a game and you've made the first level really well with some interesting ways of using the jump ability",
      "The idea and concept is super cool! I liked having to give stuff the ability to jump and even doing that to platforms was super cool! the confection was a little finicky sometimes though",
      "Having control of different platforms was a pretty cool idea, but I wasn't able to get past the first area. That said, the art and effects are good.",
      "Nice game, unfortunately i got stuck and was unable to comeplete it."
    ],
    "comments_posted": 0,
    "created_at": "2023-01-14 21:39:34",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1877841",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/doc-cyan",
      "member_since": "05 June 2020",
      "posts": "8",
      "topics": null,
      "followers": "4",
      "following": null
    }
  },
  "1872928": {
    "overal_rating": [
      "Score*",
      "2.646",
      "1.953",
      "1.953",
      "1.890",
      "1.701"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "2.583",
      "2.583",
      "2.500",
      "2.250"
    ],
    "participant": "ppgame",
    "game_title": "dino vs country`s",
    "platforms": [
      "windows"
    ],
    "rating_count": 12,
    "comments_received": 8,
    "comments_raw": [
      "I love the leap of faith to the left in the beginning, but then I was just stuck there and I could only restart by refreshing. A really unique idea for a platformer and I enjoyed the pixel versions of all the flags. Well done.",
      "Cool character art and animations :)",
      "Pretty cool concept, and nice art.",
      "As a flags fan, I lived there being flags everywhere.",
      "I like the idea think it just needs some more polishing.",
      "Interesting design! Very international hah. Control-wise (which is not what this round is about, I get it) a little coyote time would help I think.",
      "I think a game based on country flags is interesting! Good job",
      "my game XD"
    ],
    "comments_posted": 1,
    "created_at": "2023-01-11 07:30:56",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1872928",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ppgame",
      "member_since": "31 July 2021",
      "posts": "8",
      "topics": "1",
      "followers": null,
      "following": null
    }
  },
  "1878125": {
    "overal_rating": [
      "Score*",
      "2.920",
      "2.680",
      "2.560",
      "2.040",
      "1.840"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.920",
      "2.680",
      "2.560",
      "2.040",
      "1.840"
    ],
    "participant": "anome",
    "game_title": "ghost platformer",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 13,
    "comments_raw": [
      "Short and sweet. I had fun with this one on stream and left feedback throughout. It controlled well and was a blast to play. Great work.",
      "Huh not unique",
      "Art-style, location and gameplay isn't anything unique, but surprisingly I found myself continually replaying the game! The movement mechanics were just so intuitive and felt .. right.  Compared to a lot of platformers i've been playing on here, this was actually the tightest and easiest to control. Good job on that front! reminds me of the old school flash game platformers",
      "remembered the times when i started with these kinds of games, keep going good job",
      "The character is awesome, I can see wisdom in its eyes.",
      "The controls were well done, the character was easy to control.",
      "I love this game so much. Thank you for submitting this!",
      "Good platforming mechanics.  Would've like a bit more visually.  But it feels very nice.  Good job!",
      "The platformer mechanics were nice and I liked how smooth it felt to play. I think there could have been some more variety in the level like background or different hazards just to spice things up",
      "It would have been nice to have a bit more content with more platforms and detail in the scenery. The movement is smooth like butter though. Good job, it feels satisfying to play.",
      "It's cool that you are trying out Construct 3! The level is well implemented, though I would have loved if you had more detail in your art like you have in your older games.",
      "Controls are very smooth and reactive, but the levels lack some depth and detail to them. I think you have a decent start but it's missing some flavor to it.",
      "The double jump is really well implemented and fits the design of the level really well"
    ],
    "comments_posted": 18,
    "created_at": "2023-01-14 23:59:02",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1878125",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/anome",
      "member_since": "01 May 2018",
      "posts": "50",
      "topics": "2",
      "followers": "1",
      "following": "5"
    }
  },
  "1874614": {
    "overal_rating": [
      "Score*",
      "3.425",
      "3.375",
      "3.475",
      "3.475",
      "2.950"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.425",
      "3.375",
      "3.475",
      "3.475",
      "2.950"
    ],
    "participant": "gamefavorites",
    "game_title": "one-eyed Pete",
    "platforms": [
      "web"
    ],
    "rating_count": 40,
    "comments_received": 26,
    "comments_raw": [
      "Love the music queue haha. As others have pointed out, I had some minor issues with the rope grabbing, but that's not super relevant to round 1. I did finish, but I didn't get the chest.The environment was I think interesting, I really liked how you did the layers of the inside and outside of the ship to make that cut away effect, it's really nice.  Nice entry!",
      "When the music rings, I know I have found the right game.",
      "Made me laugh and really enjoyed the simple-ness of walking into and killing the enemies. Location wasn't unique, but then flying on a rope was unique and interesting. Fun idea with rope jumping and attacking :)",
      "Like others, I had difficulty with the rope, but other than that, I had a blast playing! Nice work!",
      "I really enjoyed this :)",
      "The moment I climb that rope and got away with the parrot and the music: EPIC",
      "Enjoyed it, i would a bit work on rope climbing engine, however it looks really unique :)))",
      "The only problem was how both the timing and the location of grabbing the rope with Up are way too precise. Regardless, this was fun!",
      "I enjoyed the game, though I did find it to be a bit tricky.",
      "amazing game! grabbing on the rope the parrot held didn't work sometimes, but other than that, amazing game! now enjoy this picture of a wall.",
      "Pretty cool take on the 2D platformer genre.  The hitbox on the ropes is a little small.  But overall, really solid entry.  Would love to see you keep going with this game!",
      "Nice pirate themed level! Grabbing the rope is a bit tricky but the mechanics are well thought out, well done!",
      "I feel like its cheating to use pirates, everyone loves pirates!  :^)",
      "The art and level design is great, the rope on a parrot has the potential to be an entire game on its own. If you wish to extend this concept, it would be great to allow the player to grab on to the rope if they have the up arrow held down, instead of only when it is pressed over the rope.",
      "Solid gameplay (and especially solid pirate heads!)",
      "I really like the art style! Plus the way you maneuver on the rope to doge the cannon balls was cool",
      "The game is very engaging and fun to play! Grabbing the rope was difficult, but apart from that everything was awesome!",
      "Clever game, finnicky controls but the adventure was really fun, especially the parrot rope section with the cannon balls.",
      "Love the core concept of the game! The controls are quite a bit finnicky, hard to grab onto the rope properly and I also think the cannonball hitboxes could be adjusted, but these are pretty minor things. All in all it was very fun!",
      "this is a great game, great concept and execution, only little problem was that the rope controls were anoying as you couldnt get on a rope and press another button at the same time",
      "Great and chalenging in the same time. Like it.",
      "Great and chalenging in the same time. Like it.",
      "Great and chalenging in the same time",
      "This has so much potential! I wasn't able to beat it, even after watching the walkthrough, but I had fun trying. I'm not sure if anyone else said this, but I had no idea the initial cannonballs were cannonballs and I got killed right away. I couldn't tell if they had momentum coming towards me, so I thought they were collectables. I think the parrot could say something when you grab the first rope, something about avoiding the cannonballs up ahead. But still, really good start!",
      "Great work, GameFavorites! I played this on stream and while the rope grabbing took some adjusting, I had a really fun time and loved the humor and style throughout. But I have to know ... how on Earth do i get to that last treasure chest!",
      "As others said, I loved the music and liked the layout! once I got familiar with the rope grabbing mechanic I was able to clear.  Really nice entry."
    ],
    "comments_posted": 69,
    "created_at": "2023-01-12 15:45:05",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1874614",
    "coolness": 74,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "786",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "1873928": {
    "overal_rating": [
      "Score*",
      "2.435",
      "2.699",
      "2.435",
      "2.276",
      "2.170"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.706",
      "3.000",
      "2.706",
      "2.529",
      "2.412"
    ],
    "participant": "ultranochos",
    "game_title": "platformer 14",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 10,
    "comments_raw": [
      "The character is really cute, and I love the floating mechanic!",
      "good job, I like hardcore  games like this",
      "I played on stream and left feedback throughout if you want to watch the playback. I found myself frustrated a bit with the controls, but that doesn't matter for this round, you made a world and level I wanted to keep exploring. The characters were all cohesive and charming. I really wanted to beat the level, but kept getting tripped up on the chains ... I wasn't sure what was killing me. Great work here.",
      "Cute platformer but it glitches out for me on respawn.",
      "Very cool game. The hitboxes seems to be slightly off.",
      "I see a small triangle with legs and I am instantly captivated by this little guy - I want to see what happens next to him.",
      "I like the float ability and the light effects are good. I think if the crystals acted as checkpoints it would make a major difference",
      "The lighting effect is cool, though becomes unforgiving as you tiptoe through the world. I suppose that could be part of the mechanic though, needing to rush to not be hit by spikes but still be careful to not fall in a pit. As others said, maybe some health could work (or, treat spikes as a wall instead of damange when touched from the side?",
      "The lighting is awesome.  Reminds me of Thomas Was Alone.  Super cool.  I think the health system mentioned by others would be a good addition.  Overall, nice entry!",
      "The lighting is good, the main character is cute. I think the jumping was a bit finicky as I wanted to float through some of the shorter hallways but bounced off the ceiling instead. Save points or a health system might be good as the level seemed pretty hard to me. Thanks!"
    ],
    "comments_posted": 5,
    "created_at": "2023-01-12 02:36:03",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1873928",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ultranochos",
      "member_since": "10 January 2023",
      "posts": "17",
      "topics": "1",
      "followers": "6",
      "following": null
    }
  },
  "1875614": {
    "overal_rating": [
      "Score*",
      "4.533",
      "3.833",
      "4.067",
      "3.700",
      "3.100"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.533",
      "3.833",
      "4.067",
      "3.700",
      "3.100"
    ],
    "participant": "just-a-mooshroom",
    "game_title": "trAPPed - GDKO 2023 Rounds 1/2",
    "platforms": [
      "web"
    ],
    "rating_count": 30,
    "comments_received": 19,
    "comments_raw": [
      "What a unique location i think you are 100% in the theme.          Exelente job.",
      "Interesting concept, I think I would have stuck with it for a little longer if it was less arduous to navigate around though (seems like with a mouse and pointer, could have naturally been a mouse navigation instead of a platformer!). Fun writing, and I do like how it leads you to go downwards, and also self reference partial hint/bad guesses.",
      "Really creative and unique location! I really enjoyed the writing and hunting down clues and riddles was a fun experience. Great job!",
      "Please don't judge me for the capslk incident!! That moment made me switch back to my normal keyboard for streaming, clickety clacky noises be damned! We had a lot of fun with this, if you couldn't tell from the stream. I enjoy your writing, as evidenced by me wanting to read notes that weren't part of solving the code. Great work.",
      "Cool and interesting game, but it's quite slow.",
      "Cool riddle game, and certainly a unique location. Only thing I didn't like was the movement, I think the player should have more gravity because it is a bit slow at the moment",
      "Wow! This was such a fun, chill puzzle experience. I really liked the movement and discovery of who the person was. Funny and intriguing.",
      "Amazing, but password having to be in bold makes no sense. Still haven't beaten it!",
      "Really cool game, do you have to click on the link to find the password?",
      "Very interesting usage of the cursor mechanic to move around the notes, felt weird but oddly right.",
      "Excellent concept! Had me intrigued and hoping I can see more of this game. Awesome job!",
      "this game was amazing but there is a small bug where if you put any random sequence of numbers into the password it tells you that it is helpful to find the clue",
      "Interesting to read all of the little notes",
      "Hints and Instructions helped a lot! Cool and truly unique game",
      "oh this was great! id love to see more of this concept",
      "Hahahahaha I loved this so much! Congrats on your first jam! Def one of the most unique locations! BOB AND DWAYNE SUCK! I wanted to explore more. Theres something so fun about going through someone else's reminders!",
      "",
      "Definitely a unique location, and I love the general puzzle/riddle idea! One small thing is the movement could be a little faster, but other than that really great!",
      "The concept for an APP as a setting is really cool. some of the notes are really funny and it was cool seeing some of the ones I suggested in there lol. the art style is also really nice and clean"
    ],
    "comments_posted": 50,
    "created_at": "2023-01-14 20:03:40",
    "game_url": "https://itch.io/jam/gdko-2023/rate/1875614",
    "coolness": 54,
    "participant_info": {
      "profile_url": "https://itch.io/profile/just-a-mooshroom",
      "member_since": "31 August 2022",
      "posts": "165",
      "topics": null,
      "followers": "7",
      "following": "20"
    }
  }
}