{
  "2511291": {
    "overal_rating": [
      "Score*",
      "4.073",
      "4.200",
      "4.267",
      "4.467",
      "3.700",
      "3.733"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.073",
      "4.200",
      "4.267",
      "4.467",
      "3.700",
      "3.733"
    ],
    "participant": "halfsmore",
    "game_title": "A Dark Room",
    "platforms": [
      "web"
    ],
    "rating_count": 30,
    "comments_received": 22,
    "comments_raw": [
      "cool concept but I really wish it there was more, but for criticisms, everything was done well there was like 1 I think that was unclear it was the image that had the pet store sign what was that?  also the use audio queue was unclear so I just guessed for the first 2   until I decided to click on the sound icon",
      "This is honestly a really cool game! the story is really in-depth and the sound mechanics were used very well. I also really enjoyed the message and the ending",
      "Its a really good game! Really love the idea of using the match, and having the auido que's help you remember your memories!",
      "Wow, yup - this one hits. Excellent all the way through, somber story told in a way that wasnâ\u0080\u0099t too heavy handed but also not too abstract to understand either. I also love how tactile it felt as I quickly spread the picture around as if on my task before putting in order. Great use of the theme as well, top marks from me.",
      "Oh man, I wasn't ready to get hit by the feels. Really compelling and well done, with clear and well-made audio cues. Fantastic job!",
      "This is a great game with a great but sad story. I loved it.",
      "You raised up the bar ! Great atmosphere, storytelling and emotions. Well done.",
      "amazing little game! some of the pictures were a bit hard to figure out but most were easy so i could fill in the gaps",
      "Really great. I love the woodwind sound when you place the cards in the correct order.",
      "Amazing work on this! Great use of the theme and the little stories.",
      "Really creative use of the theme! I love how it turned out, my favourite one I've played so far :)",
      "Really good storytelling ! Everything fit well together great job !",
      "So, so good! Great use of audio cues, great story, great everything! Way impressive for two weeks.",
      "Great game, I already played it before the deadline but for a fair rating I just played it again. Still amazing after the second go. Thanks for making this nice experience!",
      "The game feels really polished and all the visuals are great. The atmosphere is awesome and discovering the story was captivating. One minus is that it made me sad :(",
      "The audio cues were clear and organising the photos was a nice challenge. The pixel art was great and I liked how easy it was to understand the game and I enjoyed unraveling the story",
      "Wow dude this was super well done.  Excellent storytelling!  Interesting puzzles with the audio, too.  I feel like it was just clear enough to have to think about it but not so much that it was guesswork.  Great job!",
      "Not the direction I was expecting anyone to go in this round.  But beautifully done.  Good story.  Audio was very fitting and helped tell the story.  Took me a moment to figure out I could click for the audio to play.  I'd recommend communicating that to the player.  But that's a pretty small thing overall.  Really solid entry.  Great work!",
      "Creative use of the theme. I really like the simple gameplay and how it fits so well with the audio. I canâ\u0080\u0099t wait to see what you come up with for the story round. Also, I enjoy the simple pixel art, works well with the audio cues. Great job.",
      "I really enjoyed it, and it also fits the theme. Great job!",
      "An excellent moving game with beautiful story telling - maybe you can have an auto click on the audio button on the first scene to show dummies like me how to do it :)",
      "All 5 stars from me! Really simple to understand but engaging gameplay. VERY impressive that you wrote the music and did the pixel art. If I had to make a suggestion, it might be to use a little less text, to leave the scenario a little more mysterious."
    ],
    "comments_posted": 33,
    "created_at": "2024-02-04 05:23:01",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2511291",
    "coolness": 34,
    "participant_info": {
      "profile_url": "https://itch.io/profile/halfsmore",
      "member_since": "01 August 2022",
      "posts": "61",
      "topics": null,
      "followers": "5",
      "following": "1"
    }
  },
  "2527367": {
    "overal_rating": [
      "Score*",
      "4.476",
      "4.333",
      "4.048",
      "4.571",
      "3.524",
      "3.333"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.476",
      "4.333",
      "4.048",
      "4.571",
      "3.524",
      "3.333"
    ],
    "participant": "lio-lim",
    "game_title": "A Whale's Cry",
    "platforms": [
      "windows",
      "osx",
      "linux",
      "web"
    ],
    "rating_count": 21,
    "comments_received": 16,
    "comments_raw": [
      "Another great game with a good educational message - I wont lie when I first located mama I hoped i would thrust the the darkness and see a murky whale shape.",
      "last time I check, we we're in a game jam game, not E3, wth is this so polished! definitely round 3 material, also I think you can resubmit this on round 3 since it's going to be focusing in story, this is certainly qualified there.",
      "Would it be possible to put up a downloadable version of the game? I think the stereo audio is not working for me on the web build. For example, on the intro screen where it shows headphones and the two clapping sounds, they sound like the same volume on both left and right channels (tested by removing one side of my headphones - I could still hear both left and right sounds at equal volumes).",
      "Excellent job on this.  It was also an incredibly effective way to inform about noise pollution!  I love when games are interesting and fun but also can be a platform to discuss real issues.",
      "Well done.  Simple and effective game with a really solid narrative.  I always love when real world issues are portrayed so well and you have definitely done that here.",
      "Great game, very impactful but sad.",
      "Really well done, another fantastic entry! Also very sad to see how much noise pollution we really cause",
      "Love the idea. Nice idea to have the visual help because it helped me a lot but i'm stilled having hard time finding the whale and some cues are creeking. The idea and design is really excellent !",
      "A great but sad game. I really enjoyed it and it puts the player into a position to feel for the baby whale.",
      "This game is perfect! all 5*! I didnt know that noise pollution was this bad, never looked at it the way you presented the information. I think a lot of people miss the point of this game. Its supposed to be reall difficult to find the mother, and its supposed to be a lot louder that the crys of the mother, because you play as the baby whale that cant find its mom. Lovely story, good presentation. The amount of polish is insane! Thanks for making this experience, I really learned something :)",
      "bro always makes the most polished games!! I love the simple artstyle you got going on and also the sound desigin OOOOO really good",
      "Lovely graphic design and typography, but I was confused about the audio cues. I kept trying to narrow in on the whale song, but it sounded similar volume to me, even on headphones. And I would hear clicking sounds, but I wasn't sure if that's what I was trying to listen for? If it's not just me, might be good to add a little more to the page description to help folks know what to listen for. And one side suggestion, instead of sort of the \"page rustling\" sounds for text transitions, would be neat to experiment with underwater sounds, like splashing or \"swooshing\" haha does that make sense?",
      "That's an incredibly polished game (as always :P), I adore all the little details, including the story bits. Unfortunately, I didn't find the whale sounds very clear to understand, so I really struggled to get through the levels. The radar sound was easier to pinpoint though. Overall, a hard, but very impressive game!",
      "I'm just beyond myself at how you're able to make such an amazing game, I really love seeing what you make and play the games!!",
      "I don't know how you manage to cram so much polish in every game. The whale sounds didn't feel like they were changing much unless you were pointed right towards them, but I still did pretty whale. Pretty sure those explosion sounds have permanently damaged my eardrums. Very well done.",
      "The quality!"
    ],
    "comments_posted": 0,
    "created_at": "2024-02-13 18:57:57",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2527367",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "343",
      "following": "28"
    }
  },
  "2524713": {
    "overal_rating": [
      "Score*",
      "3.889",
      "3.300",
      "3.300",
      "3.064",
      "3.182",
      "3.064"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.125",
      "3.500",
      "3.500",
      "3.250",
      "3.375",
      "3.250"
    ],
    "participant": "game-dav",
    "game_title": "Alec Kirsty's Vault - GDKO 2024 - Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 11,
    "comments_raw": [
      "!!!!! Broooo~haha loved it",
      "Phenomenal work on this, really enjoyed the minigames and I also got a nice surprise (thanks to all commenting that left it vague enough XD). Very nice complexity and all around the same theme of lock-picking. The \"Tab\" for instructions really helped. Congratulations! Also, I was impressed with the complexity of your 1,2,3 tasks, making more and more use of the audio cues. Amazing work all around!",
      "DAMN IT, I did not expect that ending! Really fun and well designed puzzles, the audio cues are very essential. I like that all vault mechanics are clearly explained and that I could check the explanations at any point. Well done!",
      "Fun game, love the narration. Struggled with the mechanics as my ear is not really good and had a hard time identifying trigger. Fun idea, congrats for submitting !",
      "Great game. I liked the variety you put into the puzzles. It was a lot of fun.",
      "Dude you really killed this.  The little surprise at the end was hilarious, too.  The voiceover and tutorials really brought it all together.  One small nitpick is that the option to progress dialogue seemed to be on a consistent timer, so there were times there was a long pause after dialogue or you could progress fast enough to have dialogue overlap.  Small enough thing to not dock you any points, though.  I can see this being top ten!",
      "I loved the intro and writing, especially the four finger joke which I just found hilarious. If I had a suggestion it would be to try some more click samples or more \"safe picking\" sounds ... haha not that I'd know what that would sound like, but the beeps were a little generic and exploring some things that might fit the theme closer would be interesting. Thanks for submitting! I personally loved the pixel art.",
      "Yay, you got it submitted!",
      "Great game, at first I didnt realise that you still got to submit your game. Had a lot of fun playing it, thanks for making this nice experience and you got me good with the storyline :)",
      "Love the game play! Couldn't believe what I found in the safe!!",
      "HEYYYY YOU GOT TO SUBMIT XANDER LET YOU IN!!, cool game btw!!, a simple game of hot and cold"
    ],
    "comments_posted": 10,
    "created_at": "2024-02-14 11:44:58",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2524713",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/game-dav",
      "member_since": "23 January 2021",
      "posts": "934",
      "topics": "19",
      "followers": "24",
      "following": "14"
    }
  },
  "2524740": {
    "overal_rating": [
      "Score*",
      "2.772",
      "2.345",
      "2.246",
      "2.558",
      "1.777",
      "1.777"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.545",
      "3.000",
      "2.873",
      "3.273",
      "2.273",
      "2.273"
    ],
    "participant": "bromelee",
    "game_title": "Blind",
    "platforms": [
      "windows"
    ],
    "rating_count": 11,
    "comments_received": 6,
    "comments_raw": [
      "As a concept I really loved this.  I wish there was a little more explanation as to what was going on or what my goal was, but echolocation is really cool and I liked the idea of overhearing things as I walked around to learn about what was going on.",
      "I managed to walk around a bit, which was only really possible while spamming Q to see anything. I got pretty stuck and couldnâ\u0080\u0099t do much, since no matter how I tried, the game wouldnâ\u0080\u0099t â\u0080\u009ccaptureâ\u0080\u009d my mouse (cursor still visible and moving within bounds of overall monitor screen). Muse movements were affecting where I looked, but I could only look as far left/right as my mouse could until it reached the edge of my monitor. Likely missed a fair bit due to this.",
      "Didn't manage to get to the end. Not sure what to do and combine with the difficulity i was a bit lost. The idea is really cool and the sonar type of view when clapping is really well done. Congrats !",
      "Very tough to make it through this one. I think at least an indicator for whether the head is pointing up or down or level would help a lot. I tried not to clap around the people or to stand in front of the guy watching TV, but it also didn't seem to matter in the game.  Very well done and it was fun.",
      "This is really difficult. It definetly made me feel blind as I was stumbling through the map :D",
      "Pretty difficult, but I made it through to the end. Very solid use of audio cues!"
    ],
    "comments_posted": 0,
    "created_at": "2024-02-12 03:07:39",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2524740",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bromelee",
      "member_since": "17 June 2021",
      "posts": "158",
      "topics": null,
      "followers": "13",
      "following": "26"
    }
  },
  "2512990": {
    "overal_rating": [
      "Score*",
      "4.643",
      "4.714",
      "4.571",
      "4.607",
      "4.500",
      "4.821"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.643",
      "4.714",
      "4.571",
      "4.607",
      "4.500",
      "4.821"
    ],
    "participant": "hugbug",
    "game_title": "Cat Burglar!",
    "platforms": [
      "web"
    ],
    "rating_count": 28,
    "comments_received": 18,
    "comments_raw": [
      "Got stuck on felonious fish  - ill be back l8r to finish this game -This was amazing !!",
      "I thought it was going to be easy, got stuck a while at level 3, lol, pretty eye candy game as always @hugbug! totally will go to round 3.",
      "Purrrrfect game very impressed with your work, such a complete and well thought out game where audio cues are very much essential.",
      "No idea how you crammed so much charm and polish into this game. Really great. The voice audio you generated with elevenlabs sounds amazing. I will have to give that a try for future projects. If you plan to make any updates, it might be cool if you add more sounds as the levels progress.",
      "Holy Cheese on a Holy Cracker this might be one of my favorite games from the jam. The writing is quite fun with all the names and the dialogue for the chief. I also really enjoyed the gameplay and the tutorial which explained everything super well. And on top of all of that the game is so polished you could release this and no one would know it was made in 2 weeks. just amazing",
      "Super polished and super fun!",
      "Wow, that's incredibly polished and looks great! I am in awe of how much there is in this game. Like, 9 LEVELS? That's a lot! And the gameplay is very unique, it's really challenging, but fun to track the cat movements. Such an awesome entry!",
      "Wow so polished and love the art ! Really fun game, congrats !",
      "these puzzles were a lot of fun to solve, and like before it had great presentation.the tutorial was nice, but i also liked that you left a sound for us to figure out.",
      "Wow, absolutely wonderful and polished! Really impressive, especially for 2 weeks, in how you managed to get all of this polish in there.",
      "beautiful graphics, good SFX, sticks to the theme, and is, pretty unique",
      "I have nothing but pawsitive things to say about this game. Itâ\u0080\u0099s a lot of fun trying to figure out where the cats could be, especially as they keep moving around. The variety of audio cues were great and I like how each cat burglar gets introduced",
      "Such a great entry again. I always love your game Pages they look soo good! The art is always amazing and every game you make has something new and inspiring :) Sometimes it didnt feel like I solved a puzzle, more like I guessed my way to the solution. I think its because there were so many food positions with the same tiles next to it, so it felt like the cat could be anywhere. But still a amazing game! Minimum 5/9 levels were great :D",
      "I really liked this one. The puzzles were fun and challenging and the audio was spot on. Really great game.",
      "You put us all to shame! Incredibly well polished, and really nice presentation, 4th wall breaking with how you set it up with the itch page. Top marks from me.",
      "Holy crap..what a great game!! I loved every round and you really had to pay attention to see where the bad cats were!!",
      "First all 5's rating for the round!  I will be shocked if this isn't top 3.  You did an unbelievable job with this.  The combo of the audio cues with the process of elimination puzzle was super good!  AND 9 LEVELS.  Amazing work for two weeks.",
      "The art style is so cartoonish and cute I love it. The game was very fun overall, some minor nitpicks include that some mostly symmetrical levels it felt like 50/50 odds, but I felt like a genius every time I caught the cat.  Poor kitties, just wanted some food :(. Having to listen after every single move was a bit annoying, but once again super minor issues. Very polished, great job."
    ],
    "comments_posted": 33,
    "created_at": "2024-02-13 08:24:56",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2512990",
    "coolness": 33,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hugbug",
      "member_since": "30 June 2022",
      "posts": "397",
      "topics": "8",
      "followers": "88",
      "following": "33"
    }
  },
  "2528025": {
    "overal_rating": [
      "Score*",
      "3.830",
      "3.601",
      "3.510",
      "3.487",
      "3.201",
      "3.430"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.941",
      "3.706",
      "3.612",
      "3.588",
      "3.294",
      "3.529"
    ],
    "participant": "malek-elsady",
    "game_title": "Dug-Up",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 17,
    "comments_received": 14,
    "comments_raw": [
      "Cuddos for making a multi player experience , very impressive. The art is really cute, i was not sure to understand the scoring but i think you have to look a the flag. Fun game !",
      "I had fun & I enjoyed playing it - I'm gonna to find a player 2 & play it again. The crash's and clangs from objects hitting thing sounded great & the music helped keep me in the zone when playing.  Gameplay was well done.  Art was well done.  Audio was done well.  Great job",
      "Well done this was so much fun even when I couldn't play the game due to no second player. What could have been better an AI friend to play with :)",
      "This was great!  I feel like it's impressive that even though most of us played it by ourselves and couldn't fully experience it, there's enough there even just running around and throwing things at an idle player 2 to see that it's a fantastic game and meets the criteria well.  I'd absolutely buy and play a game full of minigames in this style!",
      "Pretty cool game! being multiplayer I couldnt really play it to the fullest because I don't have an external controlleror friendsso I could only play the tutorial, but the art is good and I really enjoyed the sounds!",
      "Dude what an accomplishment to do a multi-player game in two weeks!! Really had fun playing this!",
      "Gutsy move making a multi-player only experience - layout wise, I feel you could have made left hand/right hand side keyboard work! Thankfully I did have a controller and was able to play with my significant other, had a fun time! (Not sure if I missed there was a purpose or some kind of goal to work towards).",
      "",
      "Had to ask mu wife nicely to play to test this out, but it was worth it. A cool idea, and I love the multiplayer aspect of it.",
      "Ah shoot I don't have a controller so I can't play it, but the graphics have awesome charm, the tutorial is great, and it's very impressive that you pulled it together in only 6 days! I'll try to dig up a controller before the end of the round so I can play and rate it. :D",
      "I played this game with my girlfried. She destroyed me .. with my own castle xD Great game, really funny multiplayer game. I only found one issue, if youre dead and you press the pickup key, I slid over the ground.",
      "cant play it but seems good you are malek elsady so it has to be good tho, 5/5 stars",
      "hmmm this game assumes the use of friends, of which I have none. Grounds for a 1-star rating.",
      "It's great that you made a multiplayer game as it always makes things more fun. We played in the browser on 2 gamepads and it works great. The impact sounds were great but there was one that I didn't like when uprooting a tree.  The different metal detector sounds were appreciated and its cool to see the different things that can be dug up and thrown around. I particularly liked being able to throw the other player and fight each other with the trees. On a side note, getting stuck in the holes for a few seconds after digging was kind of annoying and interrupted the flow of gameplay and I didn't like the underwater or dark levels but the other 2 were good fun"
    ],
    "comments_posted": 1,
    "created_at": "2024-02-13 23:42:01",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2528025",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "",
      "posts": "",
      "topics": "",
      "followers": "",
      "following": ""
    }
  },
  "2514698": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "ricotv",
    "game_title": "Dungeon pulse",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": "",
    "comments_raw": [
    ],
    "comments_posted": 19,
    "created_at": "2024-02-05 22:57:33",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2514698",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ricotv",
      "member_since": "",
      "posts": "",
      "topics": "",
      "followers": "",
      "following": ""
    }
  },
  "2528050": {
    "overal_rating": [
      "Score*",
      "3.469",
      "2.130",
      "2.130",
      "2.617",
      "2.507",
      "2.191"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.800",
      "2.333",
      "2.333",
      "2.867",
      "2.747",
      "2.400"
    ],
    "participant": "jhice",
    "game_title": "Ears wide open",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 9,
    "comments_raw": [
      "easy, pretty enjoyable even my one side of my headphone isn't working. GJ!",
      "I like that you explored 3 different games and 3 different styles of audio cues. I found the ski game to be the easiest and most fun. The submarine one was really hard for me ... might be nice to give the \"hitbox\" of the sub a larger area at least at the beginning. The skull one was fun, but I had this weird behavior that every round was the same pattern, so there might be a bug in there. Nice work!",
      "This was a fun set of mini game with decent audio. GJ",
      "Minigames are always a fun idea. Like others have already said, it was more than a bit rough to get into the games. Fun game though.",
      "Fun idea to have a couple different mini games, although it felt that each of them could use a little more instruction or guidance to knowhowto play, along with the feeling of them being a bit disjointed. Something to tie them together, or focusing on just one of them, could give more depth and lead to a more engaging experience.",
      "Minigame idea was neat, but the minigames were missing something to transition between them or an overall goal. I wish a little more instruction had been provided but managed to kind of figure them out nonetheless. Good job!",
      "I like that you focused on the audio challenge. Favorite was the sonar minigame. Really nice concept.",
      "I liked the minigame idea!  I wish the instructions were a little more clear, or maybe a tutorial level, but besides that cool take on the theme!",
      "2 minutes and 30 seconds before the deadline!?  You were cutting it close!"
    ],
    "comments_posted": 5,
    "created_at": "2024-02-13 23:57:30",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2528050",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jhice",
      "member_since": "25 May 2015",
      "posts": "121",
      "topics": "2",
      "followers": "18",
      "following": "21"
    }
  },
  "2528327": {
    "overal_rating": [
      "Score*",
      "4.462",
      "4.269",
      "3.808",
      "3.823",
      "3.462",
      "3.115"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.462",
      "4.269",
      "3.808",
      "3.823",
      "3.462",
      "3.115"
    ],
    "participant": "dev-pirates",
    "game_title": "Escape From Crunkle",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 19,
    "comments_raw": [
      "Great game love the gameplay and prince of Persia nod (you really nailed the jump from it). Beautifully crafted and super creepy.",
      "Love how atmospheric the sound and visuals are. I didn't see them all but I like that there are multiple endings.Edit: nevermind, just did another playthrough and got the perfect ending.like some others have said, the audio cues didn't feel very essential because of the visual cues (but from a game design view that's goodÂ¯\\_(ã\u0083\u0084)_/Â¯",
      "Great atmosphere with the audio and graphics. Would've been cool if the safe spots emitted some sound that would help you locate them and sense how far away they were.",
      "This entry was so cool! it was insanely atmospheric and I loved how tense it could feel when the monster was coming. I also loved this as a continuation of the round on game and dug the Gameboy esq art. Like others have pointed out I thought the jump was a little clunky and hard to get the hang of",
      "Cool aesthetic and atmosphere, nice continuation from round 1. The movement felt a bit off though, kinda awkward to control. Good game!",
      "I really like the gameboy-like visual style, so I am glad you kept it from the previous round. The movement could use some improvement, because it feels kinda janky. I also think that the spider audio cue isn't so essential since it also shows itself every time before attacking. Despite that, I am impressed by how much you managed to do in this short time frame. Well done!",
      "I recognize your art from previous round and i really like the ambiance you created. Control were a bit stiff but i managed to get to the end. Fun game, congrats !",
      "good job",
      "Well polished and great visuals! I managed to escape in the end, though the last section was rather trying as you kind of had to get through the first couple sections perfectly, otherwise you knew you may as well hide back at your pipe as thereâ\u0080\u0099s an implicit timer thatâ\u0080\u0099ll get you before the next checkpoint. Hm itâ\u0080\u0099s tough from a design standpoint, if you have pipes in too many places thereâ\u0080\u0099s little fear. But maybe a shorter loop for the monster showing up could pair well with that. For this roundâ\u0080\u0099s category though, the visual indicators negated a decent chunk of how essentially the sound was though.",
      "Very fun and a bit stressful, but in a good way! Had a couple close calls that made me jump a bit, so well done!",
      "The Gameboy palette works so well for horror, and the sound effects you used went great with it as well.  Really glad you were still able to submit!",
      "",
      "This is a really good game. I love the creepy atmosphere. The soundeffects are great and very fitting. I like how we kinda used the same mechanic, but your game is so different :) Thanks for making this nice experience",
      "LOVE IT LOVE IT LOVE IT! So creepy and consistent. The pixel art is spot on, and I really appreciate how much depth you created in the levels with so few colors. The music is haunting and the sound effects are nice and visceral. Very nicely done. If I had a suggestion it would be to make the sound the cockroach bugs make be a little more distinct from the giant monster ... though that also added to the dread I felt, as I wasn't sure when to hide every time.",
      "Spiders.... why does it always have to be spiders... A good game!! Love the atmosphere, the audio cues were great!",
      "I was very surprised by how unnvering the atmosphere you've managed to create. That thing really scared me, multiple times. I think the audio cues were used well and definitely contributed to the atmosphere too, well done. Only nitpick is how slow it is to jump onto a ledge and then hoist yourself up, but that is very minor and does also contribute to the suspense. I liked the opening scene too, definitely up there of all the games I've played so far.",
      "i didn't have arachnophobia, key word DIDN'T. the art was really well done with the pet being fucking terrifying every time it killed me, and the old style game controls were really cool as well :)",
      "I escaped and it was an exhilarating experience (Deaths: 3, Time: 3:13). The artwork brought the environment to life, especially with the creepy crawlies coming out of the walls. The beast itself was terrifying and awe-inspiring. The ledge hangs and strategic hiding places added a satisfying depth to the gameplay. The artwork deserves another shoutout. It sets such a truly atmospheric and unsettling mood and thereâ\u0080\u0099s so many details and textures. The audio is perfect too and that opening scene is really cool",
      "good game and scart game"
    ],
    "comments_posted": 36,
    "created_at": "2024-02-14 13:21:29",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2528327",
    "coolness": 37,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "540",
      "topics": "1",
      "followers": "11",
      "following": "13"
    }
  },
  "2504210": {
    "overal_rating": [
      "Score*",
      "3.400",
      "3.200",
      "2.700",
      "2.600",
      "2.750",
      "1.850"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.400",
      "3.200",
      "2.700",
      "2.600",
      "2.750",
      "1.850"
    ],
    "participant": "hermes3d",
    "game_title": "Fire, Crackle, Sword",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 11,
    "comments_raw": [
      "I like the 3D environment and moving the ingots around felt intuitive. I was able to make some swords but took a little while to realise I had to left click when the ingot is on the anvil. The sound effects from hammering and when the ingot was ready were nicely done and the visuals were all great",
      "Had a lot of fun playing this on stream!  I hope we get to see more of this world!",
      "I like how this game came out, and like others have said making a 3d game in such a short time is very impressive! The audio cues aren't tied to any mechanics, but they still made hammering at the ingots very satisfying and fit the visual style of the game. I'd love to see where this game goes in future rounds!",
      "Always impressed when I see a 3D game in a jam. And with a web build, too! Unfortunately, I am not sure where the audio cues are supposed to be, because I didn't get any hints after heating up an ingot. But I managed to make a sword! I felt like a blacksmith, so great job on that!",
      "Visuals were fun, nice relaxing atmosphere, but indeed not much game to it right now. Reading below though, I realize you could say you still had some ideas â\u0080\u009cheating in the fireâ\u0080\u009d!",
      "Oh man I love the look and feel you've gone for with this game! I've always been a sucker for blacksmithing games since that old flash game Jacksmith, and this brought back some memories of that. Really ambitious game to go for this whole setup, but I think you did a great job for only two weeks. I'm not really sure how the audio cues factor into this that much, but I still loved it. Would love to see you add on to this!",
      "As always, I like the look of your games. Would have liked to have more to the game, but it was fun.",
      "Hey Hermes! Great work on this! loved the low-poly world! Super nice to be able to move stuff around and forge blades!Considering the theme, I was waiting for some mini-game(s) where the use of audio cues would be more apparent (e.g., hammering just at the right time if you heard the correct noise, or pull a crucible from the fire etc.). What were your ideas regarding this?",
      "low poly, game is good",
      "I like idea very much, but I was a little confounded by the pick up mechanic. I think it's because I kept trying to grab ingots in the middle of the table and they wouldn't come along with me, like maybe the physics were fighting what I wanted to do.",
      "The game looks very nice and feels nice to play. I do have a couple pieces of advice though. I think the UI could be much improved. To be honest I think just replacing the default Unity UI with just plain slightly transparent white boxes and finding a better font looks so much better. A crosshair would be really useful for interacting with small objects, especially with the lack of feedback. The gameplay itself was enjoyable and I appreciated the little tutorial at the start. Great job!"
    ],
    "comments_posted": 22,
    "created_at": "2024-02-13 03:56:54",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2504210",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hermes3d",
      "member_since": "14 February 2021",
      "posts": "151",
      "topics": null,
      "followers": "15",
      "following": "42"
    }
  },
  "2508297": {
    "overal_rating": [
      "Score*",
      "4.000",
      "3.550",
      "3.700",
      "3.470",
      "3.200",
      "2.900"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.550",
      "3.700",
      "3.470",
      "3.200",
      "2.900"
    ],
    "participant": "gamefavorites",
    "game_title": "Four Bent Fingers",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 16,
    "comments_raw": [
      "A clever game that was fun and challenging...... and painful lol",
      "unorthodox kinda gameplay but in a good way, also a construct user!, you got my 5 stars my man.",
      "This game was surprisingly challenging, had me twisting my keyboard around in directions I never had before! I ran into the key rollover for one word, but managed to cheese it by using an on-screen keyboard (I played the other words legitimately, promise!).",
      "Haha love the idea ! Really challenging and unique. Congrats !",
      "I couldn't try out the microphone bit, but it's cool that you implemented that.The gameplay was really fun and unique, and definitely challenging. Had to really stretch my hand to do those last words. Would make for a fun party game.",
      "This is such a cool idea, I love the gameplay, although its a hard exercise on the fingers. To be honest the word \"easy\" wasnt that easy xD",
      "This was a super unique idea!  I've legit never seen anything like this and it was really cool.  Great job!!",
      "This was a fun game and idea! I also got stuck at a certain game level, but had a good time contorting my fingers till I got there. On the theme, yes you did technically make audio cues essential to play, but canâ\u0080\u0099t help but say that it felt like a way to pushing that in via technicality, since the actual mechanic of what we were doing was less to do with audio (Iâ\u0080\u0099d probably have just as much fun if the word to write out was up top of the screen). Still, had a fun time playing!",
      "Fun and physically challenging game. Had to get to my desktop to finish it as my laptop didn't seem to able to handle all the key press combinations.",
      "Clever idea and surprisingly hard. Maybe I just have small hands, but I found some of them close to impossible. Haha.",
      "My keyboard only registers three letter keys at once, so I had to do the ol' switcheroo. After playing through I really enjoyed it, but wish the audio cues were more incorporated. It felt more like a game idea with audio cues slapped onto it than a game based off that theme. However, it was very well made, so good job.",
      "Great idea for a game! Small technical issue, not a big deal, but I got stuck on the fifth word because my keyboard didn't register the combination of keys. I could only press 3/4 of the required keys. The game would've been just as fun with text. Would've been nice to tie in the audio a bit more - maybe you have to press the keys to the beat of the music. Overall really cool.",
      "Really neat game idea! I had a lot of fun trying to put the right fingers on the right positions and the difficulty curve was greatly designed. There could be more polish, for example some sounds when pressing the keys, but overall, an awesome entry!",
      "lol, I had to try 3 different keyboards before I could actually play.  I thought most keyboards had a limit of 6 simultaneous inputs.  Apparently all of mine are 3...  But I finally got it!",
      "My hand hurts now, thanks. I may or may not have cheated to finish the game. Neat idea for the theme, I had fun playing it.",
      "It had small bugs. but, other than that it was a lot fun actually. It fits greatly the theme. Great job!"
    ],
    "comments_posted": 15,
    "created_at": "2024-02-02 14:37:48",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2508297",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "786",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "2527903": {
    "overal_rating": [
      "Score*",
      "2.394",
      "2.142",
      "1.953",
      "2.016",
      "1.638",
      "1.575"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.714",
      "2.429",
      "2.214",
      "2.286",
      "1.857",
      "1.786"
    ],
    "participant": "samagana",
    "game_title": "FreeMe",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 7,
    "comments_raw": [
      "I was really lost in this one, the world is cool and visuals are great but i think some indication are needed when you're on the right path to keep you going.",
      "I enjoyed the visuals in this game moody and dark - Overall the sound design was just okay. The footsteps where a bit abrasive and sounded the same weather I was running walking or crouched but I like the scary goans and general vibe. I like that there was a stamina timer when running.  I think the words on the screen could have been clearer when they change. I Enjoyed my playthrough of this game. Good Entry",
      "Thank you for sharing this! The mood is very creepy and the graphics are beautiful. My suggestions for a future version would be to 1) soften the footstep sfx ... they are a little harsh to the ear. 2) give the ability to run, so you can traverse the map faster. I also really like you game thumbnail. It's evocative and the font and color are really cool.",
      "This was a bit fun but like others have already said, a little more guidance and/or more persistent sound cues would have helped a lot. Looked great.",
      "Nice spooky mood for sure, though I think it was a little too dark in areas such that it became hard to navigate. Agreed with others, a little more guidance would be good in the text as well and in terms of what youâ\u0080\u0099re even looking for - expecting that the persistent audio sound was to clue me in to where to go, it might have helped to exaggerate the left/right ears, as even with headphones it was hard to make sense of the direction.",
      "First of all, the graphics look really nice, especially for a game jam and how well it runs in the browser. Aside from that, I was unsure what I was supposed to be doing for most of the game. I think I managed to figure it out, though, but some guidance would have been nice. The text popups on the screen felt a little out of place and abrupt. However, I do think it had a really nice mood and overall feel and enjoyed the gameplay decently once I understood it. Good job.",
      "I knew your name looked familiar!  When I was playing this, I was like \"wait a minute...this feels familiar...\"  I remember Forest Treasure from last year!"
    ],
    "comments_posted": 0,
    "created_at": "2024-02-13 22:48:48",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2527903",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/samagana",
      "member_since": "21 September 2022",
      "posts": "14",
      "topics": null,
      "followers": "7",
      "following": "2"
    }
  },
  "2527492": {
    "overal_rating": [
      "Score*",
      "3.430",
      "3.144",
      "2.973",
      "2.721",
      "2.172",
      "1.886"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.529",
      "3.235",
      "3.059",
      "2.800",
      "2.235",
      "1.941"
    ],
    "participant": "spoonsweet",
    "game_title": "Fried Pigeon",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 9,
    "comments_raw": [
      "Wow what a beautiful game. Intro and sounds and pixel art were just masterful, and I love how it's starting to create a whole feel and world with your last entry.  But I struggled to understand the gameplay loop. You might want to put some of your clarifications below in the itch page itself. (You said to look at the GIF for clues, but I'm not sure what you meant by that?) Anyway, I really hope this gets through because I can't wait to see what you'll do in the next round! Thank you so much for sharing.",
      "Pretty Cool game! I liked the art and the sounds were pretty fitting but I was pretty confused as too what I was doing. from what I understood I thought that I needed to wait until there were enough pecks to shoot the laser but I did that 5-7 times and nothing happened. still pretty cool",
      "I love frying pigeons.",
      "Love the art and that you extand your first round entry to this one. But totally lost and how and what to do, i'm curious to see explanation on that. The intro cinematic and palette are really nice !",
      "I think the others have said it well: what I played, I know not, but it was a beautiful experience! I couldnâ\u0080\u0099t tell what each section of the onboarding was meant to convey, or whether I was doing anything correct. Your visual design is amazing (sounds were good and fit well too), I do think you could reinforce gameplay by pushing the design to give clarity to specific mechanics. Itâ\u0080\u0099s sort of just directing that effort so it all fits together more. For instance on the scene showing the birds on the cubes, I couldnâ\u0080\u0099t tell if my clicks were doing anything or what it meant for them to be â\u0080\u009creadyâ\u0080\u009d. Some kind of visual indicator (or distinct audio cue, I guess for this round) to know when would help, and equally distinct some kind of audio/visual cue that it was missed.",
      "Great art as always. The game was fun, too bad about the soda.",
      "Love your art like always!!! The birds are super cute.. I didn't want to lazer them!!",
      "Your art is always insanely good.  I think a little more tutorial or description would have helped this one!  It was hard to figure out what I was doing exactly",
      "The art is gorgeous (as expected) and oh my gosh those cutie little birds why do I have to fry one I want to grab one and then squeeze it until it pops. The gameplay needed a little bit more explanation, and I think a better font would have been nice, instead of the heavily compressed font that didn't really fit the game. The audio cues were a little tough to understand at first but I got the hang of it. Very well done!"
    ],
    "comments_posted": 8,
    "created_at": "2024-02-13 23:34:17",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2527492",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "894",
      "topics": "3",
      "followers": "152",
      "following": "66"
    }
  },
  "2526383": {
    "overal_rating": [
      "Score*",
      "3.536",
      "3.241",
      "3.241",
      "3.241",
      "3.182",
      "3.005"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.750",
      "3.438",
      "3.438",
      "3.438",
      "3.375",
      "3.188"
    ],
    "participant": "magicalmcboss",
    "game_title": "Ghoul Grabbers",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "Very cool! I have a couple of suggestions. The first one is easy ... I liked how with the computer I could activate by clicking on it in addition to E. (or maybe it's possible that I just ran into the computer and it activated?) Anyway, being able to click on the recharger thingy would be a nice addition. The other one was a bigger deal for me though it's probably rare. I do everything with a track pad instead of a mouse, and on my trackpad you can't right click and hold left click at the same time, so I was able to vacuum the ghosts but not actually catch them. So a setting to change the right click to \"E\" or something would be awesome. Nice work!",
      "Really fun! I think the ghost detector sound could be tweaked to make it easier to find the ghosts by sound. As it is, I found it easier to look at the meter at the bottom left. Maybe instead of beeps you could have some constant sound that gets louder as the ghosts get closer. Overall great entry!",
      "Great game, I can see that you put a lot of work into it. I really enjoyed hunting those ghouls :)",
      "Really liked this game ! I was lost the first time when capturing, i think a feedback is missing when pressing the right mouse button to make you understand that you are doing it right and need to be done three time. The tutorial is well made (a bit too much text imo but the way you explain each step is nice). Congrats !",
      "I like the way different mechanics interacted in this game - going from searching for a ghost to trying to reactively shine the flashlight on it. Although the sound effects weren't essential to play, I do like that they were paired with visual cues as well, and the sounds definitely made the ghost catching more engaging. The game was also just fun in general!",
      "I like the way different mechanics interacted in this game - going from searching for a ghost to trying to reactively shine the flashlight on it. Although the sound effects weren't essential to play, I do like that they were paired with visual cues as well, and the sounds definitely made the ghost catching more engaging. The game was also just fun in general!",
      "A solid entry! Appreciate the detailed tutorial level, and had a nice game loop that made you want to be efficient and avoid having to make extra runs back. Minor nit from me is I always find games that require pressing down both the left and right mouse buttons at the same time a bit awkward (and, on one of my machine setups, actually impossible to do due to the trackpad). I donâ\u0080\u0099t think I quite understood the tidbit about ghosts possessing phones or tvs, but didnâ\u0080\u0099t stop me from beating both levels",
      "This was fun to play after getting used to the controls. Even with the tutorial it was a little rough at first. The music was fun and fitting.  I caught like 20 ghosts in the first level before it would say that I got all three and returning to van after only three light uses got a bit repetitive. Overall though I had fun, good work!",
      "Who you gonna call??? haha Love the idea and game play!",
      "really cool vibes!! Good job!!",
      "I had a lot of fun with this! The tutorial was a little bit much to take in all at once, a better method may have been to slowly introduce mechanics through multiple levels. Luckily still managed to figure it out, good job!",
      "I really enjoyed playing this!  Really good Luigi's Mansion vibes.  I liked your use of sound with the ghost scanner and the process of catching a ghost was well taught with the tutorial.  I think for the sake of the jam, maybe reducing the number of steps to make a little less complicated would be nice (maybe skipping the right click to progress ghost catching) but your tutorial taught it well so it worked out.  Great job!",
      "Kinda reminded me of Luigi's Mansion meets Zombies Ate My Neighbors.  In all the right ways.  Cool take on ghost hunting."
    ],
    "comments_posted": 3,
    "created_at": "2024-02-13 08:42:38",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2526383",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/magicalmcboss",
      "member_since": "16 November 2021",
      "posts": "27",
      "topics": "2",
      "followers": "3",
      "following": null
    }
  },
  "2521441": {
    "overal_rating": [
      "Score*",
      "4.167",
      "3.833",
      "3.878",
      "3.722",
      "3.778",
      "3.889"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.167",
      "3.833",
      "3.878",
      "3.722",
      "3.778",
      "3.889"
    ],
    "participant": "joszs",
    "game_title": "Hello Secret Agent Q",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 13,
    "comments_raw": [
      "This is one of my favourites well done on such an epic adventure and such a good use of sound cues.",
      "I really can't believe that this is a two week game! I really love the old style TV screen effect along with the audio cue's!! Will there be more of Agent Q, tune into next weeks episodes! lol",
      "Impressive work for two weeks, really well polished and lots of variety in mechanics with a nice little story. Congrats !",
      "The mechanic receiving intel on a mission was a great use of the audio challenge! I also loved the visual presentation, and the variety of locations that Q goes to during the mission. The parachuting segment gave a bit of trouble the first two tries, so I think having Q fall a bit slower would make reacting to the mines easier. The dark section was especially good, since it emphasizes how much you rely on your handle to guide you through the level.",
      "nice post-process",
      "I really liked this one. The secret messages were great and the game was fun. Well done.",
      "Good Job :D Much variety of gameplay mechanics. and the crt screen is a cool effect. Really enjoyed the different audio effects and enviroment sounds",
      "This was great!  My only nitpick is that the Hello Agent Q for every single audio was repetitive but I really don't have any other feedback to give cause this was super fun and creative.  From the audio voice to the old tv screen effect you really nailed this!  This feels like a top ten entry to me!",
      "All 5s for me! Super clever little game that was immediately engaging and fun to play. I struggled FOREVER to find the target, but once I saw it I couldn't believe I'd missed it.",
      "The blend of gameplay styles was fantastic and I particularly liked uncovering the secret passages. The stealthy infiltration and finding the audio messages to guide your path was really intriguing",
      "Cute game, excellent use of the theme. I could easily see this being expanded on. I really enjoyed playing this.",
      "I had fun watching you share your progress in the Discord.  Solid platformer.  Good use of the audio cues to give instructions.  I think the \"Hello, Secret Agent Q\" at the beginning of every audio cue gets a bit repetitive, but it's a pretty minor thing.  Good use of multiple play mechanics with the parachute, sniper, darkness...just a wide variety all around.  Nice job.",
      "Super fun! I love the variety in gameplay of all the different levels, and the artistic style is super fun."
    ],
    "comments_posted": 1,
    "created_at": "2024-02-10 11:03:44",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2521441",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/joszs",
      "member_since": "19 January 2016",
      "posts": "45",
      "topics": null,
      "followers": "93",
      "following": "15"
    }
  },
  "2526196": {
    "overal_rating": [
      "Score*",
      "4.826",
      "3.913",
      "4.000",
      "3.913",
      "3.652",
      "3.696"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.826",
      "3.913",
      "4.000",
      "3.913",
      "3.652",
      "3.696"
    ],
    "participant": "q34dev",
    "game_title": "Hercules Hears Hazards",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 16,
    "comments_raw": [
      "A really good game the cues where essential and I see that with time you can have taken this game much further. I loved the art style and really the whole concept.",
      "Very simple but well made. I would have let the player play a bit more with each mechanic before introducing the next one. The art style is really cool !",
      "Very simple yet well polished and fun! Bit of a learning curve on a couple of them, namely the jumping ones as the bull is really quick and the two snakes needs pretty precise timing on the jump, but overall great and really fun!",
      "Really good game! The audio was incredibly well designed. The gameplay was quick and addictive. I got good at catching all the sounds and dodging everything accept that damn bull who ran my ass over like every time. Very kool GJ",
      "Amazing work on this one Q34! The audio was essential to everything, required quick reactions and also the whole game had such a nice theme and style to it. Really nice added complexity as well, step by step, and then the healing apples—just wow! Still, the bull always gets me. Plus, the animations are so well done, you feel bad for poor Hercules getting jumped on from every corner.",
      "I really like how many sound effects there are to listen for, and they all require different reactions! Each of the hazards are also tied together so well by the ancient greek theme. I think all of the hazards are also fun to react to (except the short hop hydra one, that one always got me).",
      "Pretty fun game! the art is super cute and the sounds are also super intuitive. The only thing that was tricky for me was the bull as it was hard to time hearing the sound to jumping but that is probably just me",
      "Loved this one! The silhouette art combined with the texture is perfectly on theme, and the game does a nice job of teaching you the cues as you go, while mixing it up enough to keep you focused. The colors and font are well chosen and the animations are well done. If I had to make a suggestion, it would be to explore a longer music track, as the current one gets a little repetitive, and it doesn't feel as theme-matching as the other elements. It would be neat to add some more humor to Hercules' reactions. I wonder if he could make little comments or maybe flex or dance when he gets through a sequence. I predict this one will sail through to the next round and place well!",
      "Simple artstyle and gameplay. I really enjoy it and it's a really hard game to time it right. It's a great game, with little controls but good game design.",
      "Great game with not only great audio cues but a nice graphical style as well.",
      "Love the art seriously!! This remindes me of Hurcules the movie!! and just roman times as well! Such a great idea and implementation of the audio cues!!",
      "Loved the art style!  This game was super cool.  It took a while for me to get to a point where I was able to keep up, but the cues were clear and fair so it made it a great challenge.  Excellent job!",
      "The use of animal sounds as a warning to the hazards is brilliant and kept me on my toes. I love the mythical theme a lot and the gameplay challenges are a fantastic and fun way to test reflexes",
      "REALLY COOL!!, kinda confusing the sound sounds really similar, this would probably do better in the art round tbh it looks simple and sweet",
      "Really cool use of red-figure pottery style!  My wife was an art history minor, so seeing unique styles brought is always a plus in my book.",
      "The art is so cute and fun. There were a few too many keybinds to absorb all at once, though. However, I did manage to get the hang of it and was having fun. Well made and very polished."
    ],
    "comments_posted": 22,
    "created_at": "2024-02-13 23:15:15",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2526196",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/q34dev",
      "member_since": "26 January 2022",
      "posts": "311",
      "topics": null,
      "followers": "13",
      "following": "8"
    }
  },
  "2524823": {
    "overal_rating": [
      "Score*",
      "4.316",
      "4.263",
      "3.811",
      "3.789",
      "3.526",
      "3.158"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.316",
      "4.263",
      "3.811",
      "3.789",
      "3.526",
      "3.158"
    ],
    "participant": "tenifayiga",
    "game_title": "It's High Noon",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 12,
    "comments_raw": [
      "not to flex but, I'm fast  \"0.298\"",
      "I was very impressed with this, well done on keeping the scope small and executing excellently. the only feedback I can give is some of the effects layer show outside the game screen this can be easily tidied by chucking on an overlay border.",
      "Beautiful unforgiving game, reflecting the theme well with the duels in the west.I especially appreciate the animations you've put in place, the extra audio in the background and the added difficulty of enemies in each round.",
      "I can't believe I didn't think of a western shootout game, that's an amazing idea for this task! And the execution is wonderful, I really adore the simplistic visual style. The audio cue is very clear and the game ramps up in difficulty pretty well (I got to round 10 in my first try, I don't know how good that is though) And I just want to say, at first I thought I could just fire when the clock shows noon, so I was pleasantly surprised when you subverted my expectations. Really great job!",
      "Damn i missed the opportunity to make a western game ! Love the idea and the visuals are simple but fit perfectly. Smart and simple, i loved it !",
      "What an amazing idea! Loved how each round you started throwing in different audio distractions! Simple but very effective game!",
      "Simple, but well executed - theme fit well, and the aesthetic pulled it all together. Made it to round 9 before that cheeky guy got me on midnight chiming a quarter clockface early ;)",
      "This was great!  Simple idea, excellent execution.  You had just the right amount of tutorial, too.",
      "Great concept and well executed. This was fun.",
      "I know it's an audio round, but the graphics are really nice, too. Simple to understand and play. I love that the clock is just a distraction, but it really helps onboard players. One nit: I'd press space to advance after each round, and then instinctively hit space when the \"Round 4\" type of window appeared, and I'd end up shooting into the ground (I think?) So it might be better to require the player to click space to start the clock going. Also, some old timey music could be fun to experiment with to up the atmosphere. Nice work!",
      "The bell audio cue instantly ramps up the tension and the race to draw before the opponent is really fun. My reaction time was usually around 0.28 and I managed to get pretty far and glad to see the changing backgrounds keeping the experience fresh. The aesthetic is really cool and while the clock element adds an interesting layer, I found myself relying more on the audio cue rather than actually checking the time. Perhaps a specific draw time on the clock which is at different times in each round would encourage both timekeeping and reaction",
      "Pleasently surprised by this one! The art style is super polished and it sounds really nice. It gets a little repetetive after a while, but still enjoyable. A leaderboard would have been cool (this tool makes it insanely easy with unity) but all in all I enjoyed it quite a bit. Nicely done."
    ],
    "comments_posted": 8,
    "created_at": "2024-02-12 22:02:29",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2524823",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/tenifayiga",
      "member_since": "03 December 2018",
      "posts": "69",
      "topics": "1",
      "followers": "8",
      "following": "1"
    }
  },
  "2519522": {
    "overal_rating": [
      "Score*",
      "3.771",
      "3.594",
      "3.477",
      "3.406",
      "3.123",
      "3.064"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.813",
      "3.688",
      "3.612",
      "3.313",
      "3.250"
    ],
    "participant": "charlie-oh",
    "game_title": "LAIKA",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 10,
    "comments_raw": [
      "Really liked your entry ! The coherence is perfect and it totally feels like a rover simulation. Congrats !",
      "This was a really phenomenal simulator!  All the visuals and UI were perfect.  One thing I will say is that I wish there was a little more wiggle room on the location of things, since I feel like there's a close enough point where the player has effectively found what they're looking for and it can be frustrating to have to lock it down to a closer point, but I can also see the argument that it's more authentic to a simulation.  Really cool entry!",
      "This is awesome, felt like I was at NASA controlling the rover and it made sense on the controls as it's on mars and you're not. lol However it did take me some time to realize that i had to open the list of frequences for the list! but other than that I really did enjoy it!",
      "My play through was a fun experience. You executed sound design & gameplay very well.  I got to admit after the first few mins I turned it into RC racecar game- I was trying to see how fast I could get the rover to go, well trying to steer clear of hazards. - The visuals made it really feel like an old computer Terminal program from the 70's.  Hell of a good entry!",
      "While I definitely wonâ\u0080\u0099t be earning the â\u0080\u009cterraformed marsâ\u0080\u009d award based on where I got to, this was a neat entry. A nice combination of visuals to fit together in a unique setting that made it make more sense for why sound radar would be necessary. It was rather slow to play which fed into why I stopped where I did, and though the awkward controls I realize (I gather) part of trying to simulate the difficultly of controlling a rover millions of miles away, it did feel cumbersome enough that I was wishing there was a more traditional way to feed inputs. The radio tuning was a nice idea, though the text was a little hard to read, I actually thought some of the letters were masked off and I had to guess or unlock them or something at first.",
      "fun game :) great aesthetic",
      "Great game! I loved controlling the rover with the limited controls and inputting the codes and activating things felt like some games back in the day. The retro style interface and graphics worked great with the theme of the game and the audio mechanic.",
      "Love the graphics and the overall idea. Figuring out the UI was part of the fun, as it wasn't too obscure or frustrating. I was soon traveling around and looking for stuff. In a future version, I think a quick tutorial that walks you through the first object would be a good idea, just to make it clear how to read the radar sounds and how to know when you've succeeded.",
      "",
      "Took a while to get used to and figure out. The game felt a little clunky overall to play but the visuals look amazing. The audio cues are a bit lacking, but that's alright. A little tutorial at the beginning would do wonders for this game. Overall, nice job!"
    ],
    "comments_posted": 4,
    "created_at": "2024-02-09 15:34:42",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2519522",
    "coolness": 37,
    "participant_info": {
      "profile_url": "https://itch.io/profile/charlie-oh",
      "member_since": "14 March 2020",
      "posts": "46",
      "topics": null,
      "followers": "8",
      "following": "1"
    }
  },
  "2503406": {
    "overal_rating": [
      "Score*",
      "4.731",
      "3.885",
      "3.808",
      "3.962",
      "3.538",
      "3.385"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.731",
      "3.885",
      "3.808",
      "3.962",
      "3.538",
      "3.385"
    ],
    "participant": "brainfartstudio",
    "game_title": "Melovania",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 19,
    "comments_raw": [
      "a perfect example of less is more!, quite hard for my small brain but after a lot of bÌ¶rÌ¶uÌ¶tÌ¶eÌ¶fÌ¶oÌ¶rÌ¶cÌ¶eÌ¶  thinking I got the answers.",
      "Honestly i was playing at random, those tone thing are hard for me. The fact that brick move when jumping on it was a bit frustrating. Like the idea and simple visuals.",
      "A fun game once I got my head round it, visually and acoustically really lovely the platform controls where very nice too. I got stuck on room 4 lol.",
      "I didn't get the mechanic in the first room (I just pushed the purple block around until the door opened), but I was hooked once I realized how the deafen mechanic worked! It is such a clever way of tying sound cues to a puzzle game, and the additional element of needing to use the blocks as platforms led to some great level design.",
      "Really great entry! Definitely one of my favorites this round. Might be cool if each colored block played a different scale. I noticed on the instructions screen it says you can press 'J' to deafen, but that didn't seem to work for me (mouse button did work).",
      "Got 3:42 in the end, took me quite a moment to realize I needed to press and hold (and thenkeepholding) to hear the door tone. Could nicely hint to this by just auto playing the full door tone shortly after entering the room, and displaying a right mouse down button while itâ\u0080\u0099 still playing (a nice show vs telling a bunch of things up front which wontâ\u0080\u0099 make sense till you see it).",
      "Super fun concept! the platforming felt a bit off as you could move blocks while on top of them, slightly frustrating.also sorry, i broke the leaderboard",
      "Simple yet fun! Only small thing was it took me a couple levels to realize I had to hold down the listen button to hear the other colors: maybe you could include a small mention of that? For a good few minutes I thought I just had to match the note in a different octave and was very confused. Other than that though, great entry!",
      "Super fun! So fun in fact, that I didn't stop playing until I was at the top of the leaderboard!",
      "Very fun game. I'm usually not that great with the tone stuff but I was pretty Ok with this one.",
      "The core mechanic of pushing blocks that trigger different pitched sounds to open the door created a satisfying loop of exploration and problem-solving. I liked the gradual increase in difficulty and it kept me engaged and challenged throughout",
      "It tooks me a little time to get to maintain the Deafen key to ear the complete melody. Apart from that, I quickly get into the feel of the game and wanted to open more doors (but didn't finished all the levels !). Great game !",
      "The atmosphere is the best of the games I've played so far. The scales from the blocks were satisfying and matched the background music. Though I'm still confused as to what exactly I had to do to advance each room. Probably because I'm whatever the opposite of \"perfect pitch\" would be. Takes me ages to tune a guitar haha.",
      "Such a fun game seriously! Really love the puzzle part!! love how you have to have a certain Audio tone to open the door!",
      "Yay, it has instructions now! ð\u009f\u008e\u0089",
      "This is a great entry, fits the theme nicely and the puzzels are cool. I got the hang of it pretty quickly. Good Job! Hope to see you in the next Round :)",
      "Really neat idea for a puzzle platformer and it fits the task perfectly! The level design is great, I like how I have to make myself a path first and then focus on the sounds.",
      "cool game lags like hell tho when i do the zoom in thing??, yeah it lags so much and my laptop isnt that old",
      "I know you also struggled a lot this round but honestly this turned out really good!  I liked the puzzle of using blocks for both sound and platforming.  Good job!"
    ],
    "comments_posted": 13,
    "created_at": "2024-02-13 18:54:46",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2503406",
    "coolness": 27,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "306",
      "topics": "2",
      "followers": "34",
      "following": "26"
    }
  },
  "2526640": {
    "overal_rating": [
      "Score*",
      "4.125",
      "2.982",
      "3.123",
      "2.887",
      "2.416",
      "2.357"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.375",
      "3.163",
      "3.313",
      "3.063",
      "2.563",
      "2.500"
    ],
    "participant": "steven-the-gamer",
    "game_title": "Morse Code Machine Practice",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 11,
    "comments_raw": [
      "I wont vote as I couldn't get into it like Jonqs I struggled with fixing the machine. I saw others get pass this hurdle and have a good time so I will take take some of the blame for this :)",
      "I don't know how to fix the machine so my experience is a bit frustrating, i started to interpret morse but get stopped every time. I think i would have liked the morse code part alone. I like the feeling of being responsible of important message and just watching at the machine (kind of like paper please), the setup was well made.",
      "I'm mostly tone deaf, and so I wasn't able to fix the machine, but that's probably just me. Haha. Might be nice to ramp up the difficulty more slowly, like start with some single letter clues, and let the player have some success early on and get the hang of it. And I agree with some below comments that it was surprisingly hard to figure out how to get under the machine. Maybe have a persistent area at the bottom so there's a sense of what to click on, or another sticky note? I also was baffled by the switches on the fix screen. I spent a lot of time assuming those were related to the tones, only to find I couldn't flip them anymore, so the sensation I got was more of feeling confounded than \"fun.\" But I really love the idea you have here, and I think with a little more onboarding even folks like me could have a great time. So I hope you'll take my feedback in a positive light! There's a lot of great ideas and creative thinking under this, and none of us had much time for playtesting. I appreciated that you put some on-screen clues. Thanks so much for sharing! Maybe something in my ramblings will be helpful. :D",
      "I'm a huge fan of this game!  There were a few things I wish would've had a little more instruction.  I didn't know how to get under the machine, and having the arrow only appear when you move the mouse over it made it easy to miss.  Once I got down there, though, I really liked how the audio guided the puzzles, and getting the hang of the morse code felt really rewarding!  One of my favorite games of the jam for sure.  I was slow with it and had to bust out a notebook, but I would absolutely play a full game of this with a few tweaks!  I would love to see a game where you have to relay messages with morse code, and being the message guy means you learn a lot about what's going on and have to decide what to do with the power to change or delay messages to affect the outcome.",
      "I am not good at this at all. To be honest, I still don't know how to fix the machine. Despite that, I can see that there are a lot of interesting mechanics here and that the gameplay could be really fun. Not bad!",
      "Definitely nailed the essential to gameplay part.  No way you could brute force it with the audio off.",
      "Wow I am so bad at interpreting morse code. Regardless of that though, I can still tell you've done a great job with this, there's a good amount of polish in the maintenance mechanics as well. Great job!",
      "I would suggest making the down arrow button that you use to go under the machine visible even when youâ\u0080\u0099re not hovering over it, because I thought â\u0080\u009ccheck under the machineâ\u0080\u009d meant that you had to click on a part of the terminal to do that. Otherwise, good interpretation of the theme, and the gameplay was nicely challenging!",
      "well made only 2 morse code games here and thats suprising!",
      "A fun and interesting game. Though I'm terrible at it.",
      "Although morse code isn't an especially original idea, this game was executed fairly well and I still enjoyed it. Well made!"
    ],
    "comments_posted": 2,
    "created_at": "2024-02-13 07:01:44",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2526640",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/steven-the-gamer",
      "member_since": "28 November 2018",
      "posts": "297",
      "topics": "22",
      "followers": "103",
      "following": "25"
    }
  },
  "2528004": {
    "overal_rating": [
      "Score*",
      "4.333",
      "3.900",
      "4.458",
      "3.833",
      "3.667",
      "3.208"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.333",
      "3.900",
      "4.458",
      "3.833",
      "3.667",
      "3.208"
    ],
    "participant": "h4zm4tt",
    "game_title": "Mr. Monocle's Maniacal Mayhem",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 16,
    "comments_raw": [
      "Really happy to see Sir Spectables again and i already like the little Tim with his sound effects. Simple and fun. Looking forward for the next adventure !",
      "Oh wow this game is incredible. The effects you have to mimic that old cartoony style from the voice over to the screen filter to the sound effects were just amazing and I love how you are continuing the story for your last game (Please keep it going, I need to know what happens next!). I would say the game felt a tad short, which is definitely understandable for the time we had, but nonetheless it is amazing",
      "I love that you once again went with this retro style, because it's awesome! The movement feels really smooth and both audio cues are very clear to understand. I can't wait to see what will Sir Spectacles get into in the next round!",
      "Was hoping you kept going with this one, and you did!  You've nailed the old-timey feel in both rounds quite well.  Even the alliteration in your script.",
      "Can't wait to see where this will go in the next round!",
      "A great continuation of the series. Love the audio and visual effects. Can't wait to see part three!",
      "Love to see the return of Sir Spectacles! Great thematic as usual, love the old-timey feel to everything. I think the gameplay could use a little more to it, maybe some obstacles to dodge in addition to the laser off of the audio cue, but it was still great!",
      "The use of the whistle as an audio cue made it very clear what to do and it was good switching between the platforms to dodge the laser. Itâ\u0080\u0099s also good that you made it possible to stay on the top platform the whole way and time the jumps over the laser for another type of challenge. Itâ\u0080\u0099s great to see Sir spectacles return and I already feel invested in his journey. Also I like the visuals and starting audio very much and it adds to the playful charm",
      "It could have been a hard choice to keep the same universe that round 1 and you did well :) The overall ambiance really fit the game style, and the fun is everywhere (I like how the character runs !). Only the gameplay is perhaps a bit simple, but it's very well done anyway !",
      "The artstyle is still amazing. The radio voice turned out great. I think it was a bit to loud compared to the rest. The slidewhiste was a really funny addition :)",
      "Nice to see the chaps back! Love the narration working as instructions with the common \"oldies\" theme.",
      "your games are really good!! I love thr artstyle of this, and love to see it in the next rounds!!",
      "I still love this art style, story, and humor. I giggled and felt like I was back with old friends. The game play is a little simplistic, but it did meet the requirements of the jam, imo. Hope to see further adventures in a future round!",
      "Really fun! It's super cool that you decided to continue the story you started with your game last round!",
      "It's great that you took the time to do a voice over to explain the story and how to play the game. If I were to nitpick anything, I'd say the laser sound was a little too similar to the up/down sounds. But overall really great, and I think it suits the round 2 challenge very well.",
      "Poor Mr. Monocle, he's not maniacal, just misunderstood ): Anyway, I'm glad you managed to get something together! A few more obstacles that you actually need to move around to avoid while listening to the whistle would have been fun. The art is super cute and fun, yet again. Tell Tim thanks for the help."
    ],
    "comments_posted": 34,
    "created_at": "2024-02-13 23:20:48",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2528004",
    "coolness": 37,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "200",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "2515541": {
    "overal_rating": [
      "Score*",
      "3.278",
      "3.389",
      "3.111",
      "3.278",
      "2.944",
      "3.200"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.278",
      "3.389",
      "3.111",
      "3.278",
      "2.944",
      "3.200"
    ],
    "participant": "jonqs",
    "game_title": "Nap at the musuem",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 11,
    "comments_raw": [
      "Great game impressive you built so many experiences into it :)",
      "Cool environment to explore, lots of great sounds and audio cues. Like others I was a little confused on how to get some of the noise to stop, but the overall goal is there and seems like it'd be very fun with a bit more polish!",
      "I enjoyed walking around being a docent at a museum, flipping the lights on and off, looking at the art, I try to swat the fly but it didnt work and I popped the red ballon thing on the ceiling and I tried to take a nap in the chair but couldnt figure out. Audio cues where there and good but I didnt know wut to do with the information. Nice Game TY for sharing.",
      "Really liked the concept here, and it was fun exploring the space and figuring out how to make things quiet.  I also ran into the freezing fly and some lag, but it was really good besides that. I liked the combo of the sounds with the visual helpers!",
      "Really great job designing a game where audio cues are essential and the main focus of the gameplay. The game didn't run very well on my computer, but I can understand with the limited time frame it's difficult to optimize performance. Attention to detail was very good too. I threw the ball to pop the balloon and when it landed it broke one of the vases. Nice touch!",
      "Really fun game, I really enjoyed the vibe of the level! I didn't get to sleep due to the fly freezing after hitting it, but it looks like i'm not the first to find that. However, its still a great game!!",
      "Fun entry, simply but did it all well. Didnâ\u0080\u0099t over-explain and let you discover a few things in the world. It took me a moment to understand that the voice recording cue was being triggered by being next to the chair (maybe I skimmed too fast, didnâ\u0080\u0099t really know what my goal was, I just jumped into messing around with things - I did get to sleep eventually)",
      "This was a solid, well-executed entry.I think (?) I may have found a bug, haha no pun intended. I swatted the fly, but it froze in place and continued to make noise. Maybe there was another step I needed to take.",
      "This was a great concept well executed. It was a lot of fun. The art was well done and the sounds were great.",
      "Super fun idea, I actually really like the text that pops up for sounds. Took me a little to understand what to do but once I did I had a lot of fun. Also the graphics look really nice, well done! Just wish it were a little less laggy.",
      "idk it lags, good and really cool but the sounds arent really needed cuz they are visible"
    ],
    "comments_posted": 31,
    "created_at": "2024-02-12 19:07:36",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2515541",
    "coolness": 37,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jonqs",
      "member_since": "29 March 2016",
      "posts": "210",
      "topics": "1",
      "followers": "10",
      "following": "4"
    }
  },
  "2526170": {
    "overal_rating": [
      "Score*",
      "3.611",
      "3.444",
      "3.278",
      "3.444",
      "3.322",
      "2.833"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.611",
      "3.444",
      "3.278",
      "3.444",
      "3.322",
      "2.833"
    ],
    "participant": "potatuetata",
    "game_title": "Orca Attack",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 14,
    "comments_raw": [
      "You did a really good job on creating your creatures and world, I really enjoyed it and found it very cute until blood started spraying everywhere. The only feedback I can really give is extending your tile set to allow curves and smoother edger also could have been some under water tunnels etc to hide and travel through.",
      "I like this idea, remind me of echo the dolphin. The orca attacking through walls is a bit frustrating. Background music is really nice ! Congrats !",
      "I love how self-explanatory the game controls are, and the music and bubbly sound effects built some nice atmosphere. The layered instruments and music that changed with the story are a very nice touch.",
      "Solid little game - Avoiding the whale felt good & the audio design was  good. Well done",
      "I really enjoyed this entry! I loved the background music and how it changed depending on what was happening in the game (pretty subtle effect but adds a lot - it was interesting to read about how it works in your description). The music and relaxing game play made me want to keep playing. I thought the orca sounded more like a monster than a fish, but to be honest I don't know what they're supposed sound like. I could definitely see myself playing more of this if you expand on it in the future. Really nice.",
      "Pretty cool game! the swimming mechanics were pretty fun and the music was super relaxing. There was a strange bug where my score text wasn't displaying and It was just a black block",
      "I really like how thereâ\u0080\u0099s some strategy to positioning yourself to quickly gobble up some fish after the orca passes through. Fun title, sound was definitely essential! Though was almost too easy to ward off the orca, given as soon as you touch the seaweed youâ\u0080\u0099re already in the clear (slightly limiting how critical hearing the audio ahead of time is)",
      "cool, sticks to the theme, fun to play",
      "The orca growl captured the tension of needing to hide and made for a very suspenseful experience. The background music was tranquil and it is awesome how quickly the tone of the game can suddenly change when you need to find that seagrass. The leaderboard is a great addition and adds to the competitiveness, it hasnâ\u0080\u0099t displayed my name for some reason but itâ\u0080\u0099s still awesome. An idea for expanding the game would be adding a way for the seagrass to deteriorate the longer you stay in it, changing colour to indicate it so you have to keep moving to other areas until the inevitable happens when you face the orca",
      "This was really good!  Swimming around was fun, and the growl cues to hide were good.",
      "This was a fun game, I really liked the music and and monster queue.",
      "i love this game just like how i love tasty planet, idk eating stuff just feels good, and i think if the beaver gets bigger everytime he eats and when he eats to much he gets TOO BIG and now can eat the orca, maybe a role reversal where now you have to chase orcas as an engame thingy?? also good job for doing a leaderboard i dont know how to make one of those",
      "Ha!  I'm actually the top of a leaderboard for once!  Though I know it will be short lived oncesomebodyfigures out there's one here...",
      "The adaptive music was something I didn't even notice my first time playing but wow it sounds so good. Did you make it yourself or find all the different instruments in the track online? Took me wayyyy too long to realize how to catch fish, but once I did it was super satisfying. The art (specifically the colors) were a little offputting, would reccomend finding an easier color palette on the eyes (lospec has a lot). I was pleasently surprised, nicely done!"
    ],
    "comments_posted": 19,
    "created_at": "2024-02-12 23:59:36",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2526170",
    "coolness": 34,
    "participant_info": {
      "profile_url": "https://itch.io/profile/potatuetata",
      "member_since": "02 December 2018",
      "posts": "123",
      "topics": "1",
      "followers": "9",
      "following": "4"
    }
  },
  "2527336": {
    "overal_rating": [
      "Score*",
      "2.236",
      "1.938",
      "1.714",
      "1.863",
      "1.565",
      "1.863"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "2.600",
      "2.300",
      "2.500",
      "2.100",
      "2.500"
    ],
    "participant": "redionion",
    "game_title": "Pchizophrenic",
    "platforms": [
    ],
    "rating_count": 10,
    "comments_received": 4,
    "comments_raw": [
      "Iâ\u0080\u0099ll have to admit pure jump-scare games donâ\u0080\u0099t do much for me, but even so, it did have a cohesive overall atmosphere. Not sure how essential audio clues were though. I couldnâ\u0080\u0099t tell why I the third chore didnâ\u0080\u0099t seem to be completable, but alas.",
      "I loved the jump scares and the creepy atmosphere. I had trouble surviving because I wasn't fast enough with the water and curtain, but it was fun.",
      "The tension was really good. I was really paranoid, that I heard something. The ghost jumpscared me the first time xD",
      "The washing machine making noise added some great tension because it was harder to hear if there was a noise that would require you to turn off the water. I thought it was funny that you have to do chores while taking a bath!"
    ],
    "comments_posted": 2,
    "created_at": "2024-02-13 16:12:04",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2527336",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/redionion",
      "member_since": "30 January 2023",
      "posts": "4",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2526284": {
    "overal_rating": [
      "Score*",
      "4.053",
      "3.632",
      "4.211",
      "3.674",
      "3.526",
      "2.947"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.053",
      "3.632",
      "4.211",
      "3.674",
      "3.526",
      "2.947"
    ],
    "participant": "wolfenrahd",
    "game_title": "Pizza Orders",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 15,
    "comments_raw": [
      "Its no secret I really liked your game :)",
      "no wonder why delivery guys throw their packages throw their deliveries. they got it rough out there, pretty hard game if you close your eyes, sometimes it doesn't time well you have to wait until the letter P in jump, but still a really different game from other than I played so I commend you with that, GJ!",
      "yellow light me at 10% going down,  red light at 2% are you even paying attention lol, but All in all love the game and would play if there is ever more added.",
      "A very neat idea! I had a lot of fun playing, despite the game being crazy hard! Especially when like all 4 ninja turtles in a row decided to peek out of the sewers - I think a bigger delay between attacks at the beginning would be nicer. But to be honest, there is a lot of stuff in this game, I am impressed by how much you got done in so little time. Well done!",
      "Nice game ! I would have like the game to go full chaos on audio, mixing instructions and confuse me with funny events. I had fun anyway. Congrats !",
      "Great entry! I like how you took the time to do voice-overs for the game instructions and the beginning countdown. Might've been cool if the voice was more integrated into the game. Maybe it could be the pizza shop owner talking on a radio to the driver. I found the game pretty difficult but might just be because I'm bad. Overall really nice!",
      "Really fun game! Loved how every time you messed up the text was different.. Don't know if that gives away that I was pretty bad at this haha. Regardless I had fun with it!!",
      "Felt a little heavy handed to just be saying the words to do, but hey it works and actually made for a fun experience! I got all the way through, maybe I was just lucky and never got any of the fakeout words? And indeed, a really nice detail how the music stops and doesnâ\u0080\u0099t start again till you start moving. Interesting choice of making it a right-to-left game, way to break tradition on the sidescroller genre!",
      "Great Job, I like how the mechanics get introduced one after the other. Also the fact, that you stop the music when its red light gives it much more impact. The anticipation got me killed a couple of times when you said fakeouts. Thats the only Issue I had, the fakeout only appeared in level 2, where it isnt introduced, in the leves after the introduction it didnt play at all. Just a minor thing, because the rest was so good. Keep up the good work :)",
      "Just the right amount of chaos, I loved it. Sometimes there were certain situations in which it was impossible to not die, but those were fairly rare so never had a huge impact. I appreciate how the mechanics are slowly introduced, giving the player time to get used to it. I also like how the music goes at the same speed as you, it's a really nice touch.",
      "I killed Michelangelo too many times lol.  This was a really good game!  I liked the variety of cues and the different things you could do.  Felt like a good level of chaos.  One nitpicky thing would be that I'd maybe recommend simplifying the game by taking out acceleration and braking?  It was possible to be going at a speed that made the audio cues come too early.  Good job!",
      "I LOVE THIS GAME!!!!!!!ITS SO SILLY and cool, the announcer sounds silly anda this is a very good game",
      "Fun and challenging game. The audio kept things interesting.",
      "Surprisingly challenging for me! But I kept trying and the difficulty curve wasn't too insane. Overall, a very strong rating for me, as it mixes a lot of audio cues that keep your brain buzzing.",
      "I managed to complete the game and I had a blast playing it. The motorbike is incredibly cool, especially with the sliding. The trick audio cues were a good touch too and I totally got duped by them lol. If I could suggest one thing, maybe adding unlockable skins after each level"
    ],
    "comments_posted": 3,
    "created_at": "2024-02-13 22:31:48",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2526284",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/wolfenrahd",
      "member_since": "11 October 2016",
      "posts": "134",
      "topics": "2",
      "followers": "57",
      "following": "35"
    }
  },
  "2510364": {
    "overal_rating": [
      "Score*",
      "4.400",
      "3.800",
      "3.700",
      "3.500",
      "3.450",
      "3.350"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.400",
      "3.800",
      "3.700",
      "3.500",
      "3.450",
      "3.350"
    ],
    "participant": "14rry",
    "game_title": "Play By Ear",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 13,
    "comments_raw": [
      "I really liked this one it felt super engaging and was cool you used minimal visuals for it.",
      "I'm so bad at this... The music is really cool !",
      "The music is a BANGER. Huge props for making it yourself! I had so much fun keeping track of the rhythm, also the whole idea of a game with no visuals at all is incredibly interesting!",
      "So I couldn't get passed the first round as Im not good at audio cues like this game. So, I grabbed my wife who is a pro in this and really enjoyed playing it with her and watching her play it!! Great game, it would be nice to have an some kind of indication of missing the mark.",
      "All 5 stars for me! It's so awesome that you wrote the music, and it fits the round perfectly, IMO.",
      "This game is awesome. It told me that I'm amazing because I got the perfect score :) Loved the experience, the music is great and really catched me with its vibe. Definetly a top game this round! Keep up the good work :)",
      "This was a lot of fun. I liked the mechanic and the music was great.",
      "The game was a ton of fun! The music was fantastic, really upbeat and positive. I loved timing the press and the audio feedback and the cheers from the crowd were great",
      "This was really well done!  I feel like I maybe could have used a visual cue to know when I'd missed it or something but maybe I'm just bad at it haha.  Really fun idea and really cool little game.",
      "Ooooooh myyyyyy god I really liked it :) I jump right into the game, needed 1 round to understand it and playing back again. The music is enjoying, the five notes series are fun to hear ! The game is so simple but so addictive that for me it's a hit. I saw you have other games based on music and rhythm, will take a look sometime ! You just gain a follower ;)",
      "Simple but certainly enjoyable. Felt a little disconnected with a lack of feedback from your actions, but still enjoyable. It's pretty short and there isn't much content, but what's there is polished well, good job.",
      "Nice game, it reminds me of Doctor Rhythm. You really push the theme to the theme to the extreme here. I really enjoying playing it. I would like to have a bit more feedback on how I did, but overall great job.",
      "Simple but effective rhythm game.  Cheesed it by just tapping on EVERY beat.  Would like to see a score system of some kind (aside from just the end validation) just to give a bit of replayability.  All around, solid entry for the criteria.  Good job!"
    ],
    "comments_posted": 19,
    "created_at": "2024-02-13 15:53:41",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2510364",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/14rry",
      "member_since": "19 February 2022",
      "posts": "215",
      "topics": null,
      "followers": "10",
      "following": "18"
    }
  },
  "2503885": {
    "overal_rating": [
      "Score*",
      "3.716",
      "3.830",
      "3.544",
      "3.453",
      "3.316",
      "2.858"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.824",
      "3.941",
      "3.647",
      "3.553",
      "3.412",
      "2.941"
    ],
    "participant": "evengy",
    "game_title": "Q",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 17,
    "comments_received": 12,
    "comments_raw": [
      "Really cool idea and mix of genra. I think being able to interact while not seing things would have been a game changer. It would really make you feel like you leanrt the layout of things and doesn't need to see it anymore. Overall realisations is really good ! Congrats !",
      "Really strong and consistent atmosphere. Beautiful VO and the choice to go with whispers was very relaxing. The shader was BADASS and really evocative. Gameplay wise, it might be nice to the game to start with just one order, and wait until you'd made it ... the orders keep piling up, and that stressed me out rather than making me feel all zen like the other elements. And then when you've gotten the player up to speed on the basics, it would be cool in a future version to have different voices for different customers, instead of this one REALLY HUNGRY dude whispering at me. Hahahaha. But none of that affecting my rating. Very, very strong entry.",
      "This game provided a relaxing atmosphere. Very clear audio cues & gameplay was easy to pick up and understand after only a short time playing.  I very much enjoyed my time playing this game. Solid entry",
      "That's a really neat idea and a very cool effect with the echolocation visuals! I think the gameplay could be more interesting if I could interact with stuff while being blind, because I was just spamming Q. Wait that's the name of the game, I just realized that! Anyways, I also like the atmosphere, it's pretty relaxing. Good job!",
      "Awesome entry! I think this game really has potential. Two things that would improve it for me are:",
      "You got a lot of really cool stuff right with this!  The echolocation was a super cool idea, and having a little bit of fade time helped stay oriented in the space.",
      "Fun asmr experience, and cool shader style. Definitely would be good to have some in-game instructions, though you do spell it all out in the description.",
      "Fun and relaxing game, I like the system you have set up a lot! We ended up with a very similar base mechanic (blind, with echolocation) but I think you executed on that much better than I did. There's plenty of room to expand on this  further so I hope you keep building off of it!",
      "",
      "Fun game. I really like these kinds of games, but the blind twist added something fresh. Well done.",
      "Super fun little game, I love the effect when you snap your fingers, it feels so satisfying for some reason. Very well made!",
      "I really love the way the snap seems to radiate outwards, and the audio as a whole made the experience surprisingly tranquil for a game that would normally be hectic. My only critique is that I wish E and LMB were consolidated into a single input."
    ],
    "comments_posted": 1,
    "created_at": "2024-02-01 08:12:58",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2503885",
    "coolness": 37,
    "participant_info": {
      "profile_url": "https://itch.io/profile/evengy",
      "member_since": "15 April 2021",
      "posts": "43",
      "topics": null,
      "followers": "20",
      "following": "1"
    }
  },
  "2517297": {
    "overal_rating": [
      "Score*",
      "4.087",
      "3.609",
      "3.739",
      "3.704",
      "3.522",
      "3.565"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.087",
      "3.609",
      "3.739",
      "3.704",
      "3.522",
      "3.565"
    ],
    "participant": "theduckcow",
    "game_title": "Racin'Paper",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 23,
    "comments_received": 15,
    "comments_raw": [
      "I really had fun with this one. Beautiful art style and nice implementation. For some reason the repeated sqweeching (yes that's a word) of the rubber band just had this absurd and delightful quality. Thanks for sharing a bit in the description about the deadline misunderstanding. Totally understandable and happens to the best of us. I wonder if your next round game will be more paper stuff? Haha good luck!",
      "First of all, I loved your Q&A section :D",
      "So happy to see your artsyle from round 1 extended to this one. I really like it. The toy feeling is great, like you said the game miss some feature to keep playing but what you did is really well made and polished. Congrats !",
      "I really liked this game! Having the rubber band snap and madly mashing the space button to reattach it is a great mechanic. I managed to get around the track on my second go without snapping the band, but I was playing pretty safe when I did; it would be interesting if the car goes much faster if you really stretch the band, to incentivize taking more risks (maybe even being necessary for shortcuts if you add more tracks).",
      "What a cute game, really awesome job! Great utilization of the theme too, didn't realize I was snapping the rubber band at first but that audio cue was on point there.",
      "Great job continuing from your first entry. The elastic band mechanic is great and it feels satisfying getting the boosts and that it can snap too is a good risk balance. My best time was 27:471 seconds",
      "i love the art, so unique and cute! It controls a bit funny, I wish the car rolled around a bit more.",
      "I love your art style so much.  The game was simple but fun and fit the criteria well!  Good job!",
      "I didn't have \"the chance\" to play your game at round 1, it's done now ! The gamefeel is very good. I snapped the rubber band many times but managed to cross the line in about 30s ^^ The audio fits the theme :+1:",
      "Great game, there was still the money counter in the top right, from round 1 but I didnt mind :) It was cool charching the rubber band and seeing the car shoot forwards. Definetly a polished car-controller!",
      "Great idea integrating the audio cues into a racing game. The controls and physics felt really good. Would've been nice if there were some goals, maybe gold/silver/bronze medal times like in trackmania.",
      "I still love the art. The rubber band mechanic was fun and well done. Great work.",
      "Definitely missing some features, but was very fun to play around with. I'd love to see it updated it a later round, as driving around felt so satisfying. You can absolutely tell the time was put into fine tuning the driving rather than fleshing out the game, and to be honest, I don't mind as it's plenty fun.",
      "That is a really original concept for a racing game! I adore the paper aesthetic and that all the sounds fit the style. Also, the driving mechanics are perfect for the task, because playing without the audio is practically impossible. Really great entry, it's a shame there was no time to add more features, so I am waiting to see what you'll do for the next round :)",
      "Okay very fun, once again!!! I can easly see where you were going with the money option and also were you thinking of a score board for the times???  Great game with great Audio cues! Really love the detail when you snap the rubber band,  you can install a new one!"
    ],
    "comments_posted": 24,
    "created_at": "2024-02-13 19:32:04",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2517297",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/theduckcow",
      "member_since": "30 January 2021",
      "posts": "269",
      "topics": "3",
      "followers": "23",
      "following": "9"
    }
  },
  "2509101": {
    "overal_rating": [
      "Score*",
      "4.050",
      "3.950",
      "3.900",
      "3.550",
      "3.690",
      "3.000"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.050",
      "3.950",
      "3.900",
      "3.550",
      "3.690",
      "3.000"
    ],
    "participant": "loten",
    "game_title": "Reel Rhythm",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 13,
    "comments_raw": [
      "Not really a fan of rythm game but the fishing setup made this one original.",
      "Well great! Another good game that I am bad at! For real, though, that's a really unique rhythm game. Also, all the visuals are beautiful (as usual in your games :P) and everything feels so polished and satisfying! And the music is a banger! Definitely one of my favourites from this jam.",
      "Ooooh yes I love rhythm games, finally something I can top score on! Great game, only thing I'd like is more songs! Maybe also some extra points for catching fish with \"perfect\" timing, especially since as of now myself and two others have what I assume is the highest score possible on the leaderboard.",
      "I really enjoyed this! A very satisfying and cute rhythm game. It might be nice to have a little bit of audio feedback when you click just so you can hear how in time you are. Also after a couple of attempts, I did run into a problem where the fish would stop spawning. But overall really awesome job :)",
      "Cool idea making a fishing themed rhythm game. Really makes a lot of sense to combine the two. It's super fun to play and the art is great. I did have the same problem as Hermes where the fish stopped spawning about halfway through the song. I also think it might've been even better if the music matched the fishing/water theme. Overall really great!",
      "Love the game, its odd because at home the game broke and wasn't showing the fish but at work I got to play the whole game and get on the top 10 muhahaha.  Also love the feature of using two buttons for the long snake like fish lol",
      "A fun rhythm game. The press an alternate button while holding the button down took me a while to understand what that meant since there's only one hook, but I liked it once I figured it out. I'd like a keyboard only or joystick version, but the mouse was nicely done.",
      "So first of all the game image is one of my favorites of the jam. Super cute octopus and very inviting. I was able to understand the overall gameplay well, and I'm a rhythm game fan. I thought the \"sensitivity\" of the timing was just right. Often these kinds of games you have to really tune your brain to figure out the \"attack\" of the virtual instrument, and I didn't feel that frustration at all. It would be really neat to have a pure keyboard control scheme in a future version. Nice job!",
      "great rhythm game! only complaint is the mouse controls for moving the the hook were a bit awkward",
      "Iâ\u0080\u0099m happy that I reeled in a â\u0080\u0098passâ\u0080\u0099 and scored a spot on the leaderboard. The rhythm based mechanic is super engaging and the fish are synced to the musicâ\u0080\u0099s beat really well, which feels satisfying when getting it right. The combo system and visuals are all great too. The soundtrack compliments the game well and while I enjoyed the controls, personally for me I would have found having the added option of using arrow keys for the hook movement to be more intuitive to me",
      "cool creative idea for a rythm game",
      "This was rad as heck.  Fantastic take on a rhythm game!",
      "Your games are always so â\u009c¨juicyâ\u009c¨. It may be a skill issue though, but sometimes I felt like the hook wasn't moving completely with my mouse. Terrible at rythm games, but still enjoyed this one. Very well made."
    ],
    "comments_posted": 10,
    "created_at": "2024-02-12 21:34:10",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2509101",
    "coolness": 30,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "159",
      "topics": null,
      "followers": "15",
      "following": "6"
    }
  },
  "2517176": {
    "overal_rating": [
      "Score*",
      "4.455",
      "3.518",
      "3.364",
      "3.182",
      "3.409",
      "3.182"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.455",
      "3.518",
      "3.364",
      "3.182",
      "3.409",
      "3.182"
    ],
    "participant": "spookyrobloxman999",
    "game_title": "SPACE Border Control!",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 11,
    "comments_raw": [
      "Polished / Clean / Juicy,  Audio 10 out of 10 I don't think there's anything else to say other than what other already said, pretty great entry! definitely deserve to round 3.",
      "Was a fun game and I enjoyed the Zany voices and sound effects. Had some cool juicey dynamic effects which really amped up the visual appeal.",
      "Lots of 5 stars for me! It has a really lovely audio scape. Playful but a little creepy. I liked that the audio cues weren't 100% what you'd expect (at least not for me) to define \"good aliens\" vs \"bad aliens\", and the little sound effect WHOOooooooo at the beginning of the level was spot on. The music felt on brand (like sorta retro?) but not typical. ... for some reason it reminded me of some old animations I watched on youtube for Hitchhiker's Guide to the Galaxy, and I dunno I just found myself with a smile on my face. Also nice font (hahahahaha). If I had to provide a critique, I'd say it felt a little frantic, though I know that was what you were going for. The movement of the avatar felt a little too \"floaty\" ... and I'm not sure the movement is necessary to the game, since you can shoot in any direction with your mouse. It might be interesting to try a button for shooting and reserve the mouse just for letting aliens \"through\"  ... I struggled remembering the correct mouse button, and it might have been easier for my brain clicking space to shoot exclusively, or something. But overall a very solid entry!",
      "Pretty fun game! I liked the different sound effects for good and bad and the art was also pretty appealing!",
      "Fun game! Good polish in all departments, with a simple but effective game mechanic. I think it could use another layer of gameplay if you have the time to add to it, something like needing to move not just shoot, but as is it's still great!",
      "good sound, good graphics, polished, and actually follows the theme pretty well.",
      "Interesting concep. You turned the category \"Were the audio cues clear to understand\" on its head :) I like it",
      "I'm slow so it took a second go to figure out how to play, but I got amazing on my second try. The audio queues were great. Fun game.",
      "Really engaging gameplay after understanding how to sort the monsters (I got the cringe rating at first try, then amazing++ at the second lol). All visuals are very polished and the audio cues are essential and pretty clear to understand. Great entry!",
      "I liked this one a lot!  The variety of sounds was really well done.  There was enough variety to have to really pay attention but not so much that it was confusing.  Great job!",
      "The game looks super eye-catching but is really confusing. What I got from it is that you have to listen to the aliens make their sound, and then decide whether it's good or bad? I might be missing something, but a couple quick fixed before the jam would be:"
    ],
    "comments_posted": 20,
    "created_at": "2024-02-10 09:46:27",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2517176",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spookyrobloxman999",
      "member_since": "12 November 2022",
      "posts": "103",
      "topics": "3",
      "followers": "5",
      "following": null
    }
  },
  "2524854": {
    "overal_rating": [
      "Score*",
      "3.544",
      "3.716",
      "3.521",
      "3.487",
      "3.430",
      "3.430"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.647",
      "3.824",
      "3.624",
      "3.588",
      "3.529",
      "3.529"
    ],
    "participant": "aerial301",
    "game_title": "Scraper: Black Gold",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 12,
    "comments_raw": [
      "Really fun ! Everything felt clear to undestand and the mission was well balanced. I had a bug with the music stopping every time another audio play. Overall it was a fun little adventure !",
      "Freaking love this game, it's just the right amount of exploration and puzzle solving!!",
      "This was a really nice little puzzle and exploration game. The searching was fun, and the audio puzzle was satisfying. Really nice job :)",
      "I REALLY liked this one.  Something about finding the audio recording, wondering what it was, and then realizing it was the clue to the chest really hit that just right spot of mystery and puzzle solving for me.  The audio cues were really straightforward and you managed to have a lot of functionality that's easy to imagine expanding into a larger crafting and exploring game.  Great job!",
      "I am glad that you continued your game from the previous round, because it's really fun. And there are a lot of new features here! I like how the audio cues are used in different ways. Unfortunately the game froze when I inputted the right melody to get the pickaxe from the chest. Despite that, I think this is a great entry!",
      "This is really nicely polished, and the UI is great, especially how the radar kind of shatters when you find an item. I like how the title screen music is a version of the code to get the pickaxe, too! So far, this is my favorite entry of this round.",
      "Was fun using the radar! Though would have been good to tip off to use that, I was wildly breaking down blocks left and right while I could. Super nice to have a whole end to end game though with a real sense of an ending, felt like a pikmin echo in a way. Nicely done, and well polished!",
      "Such an ambitious game for a 2 week jam! Has lots of features and polish. It took me a while to figure out the controls (might be good to put an on-screen reminder of using the right mouse click to break blocks ... there are a lot of controls to learn and it's nice that the keys had simple, prominent indicators on screen.) Of the \"use the sound to find a hidden object\" games I played so far, I thought yours was the clearest to understand. Nice work!",
      "I had a lot of fun with this one! Using the radar was really fun and I enjoyed the sound puzzle to get the pickaxe. Only advice would be that the crafting menu and ship fuel aren't really necessary until the end, so removing them until then could be good to avoid getting overwhelmed at the start and to avoid cluttering the UI. Overall, very well made, good job!",
      "Fun game. The locked chest took me a long time because I don't have a good ear for the tones.",
      "nice game :))",
      "Good Job. Im happy for you that you got to use a lot of your project from the first round. I likes the music puzzle at the chest and the radar was implemented really good. Its nice how the music continues to play after solving the puzzle :)"
    ],
    "comments_posted": 0,
    "created_at": "2024-02-13 10:04:16",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2524854",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/aerial301",
      "member_since": "12 November 2022",
      "posts": "312",
      "topics": null,
      "followers": "9",
      "following": "7"
    }
  },
  "2494813": {
    "overal_rating": [
      "Score*",
      "3.960",
      "3.640",
      "4.000",
      "3.560",
      "3.520",
      "2.680"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.960",
      "3.640",
      "4.000",
      "3.560",
      "3.520",
      "2.680"
    ],
    "participant": "sijilum",
    "game_title": "Spooky Notes",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 16,
    "comments_raw": [
      "Cool one. Curious about why up is not mapped to up arrow and down to down arrow ? that confused me xD The idea of disappering notes is really good and works well with the little ghost.",
      "tell me you're a fnf fan without telling me your a fnf fan,good game enjoyed it!",
      "I had a real good time with this one, nicely done where the music was the hero. Loved your theme song and I thought the fading out ghost was a nice touch :)",
      "Simple but fun game! the song is super nice and I really enjoyed the art! though I did feel the audio cues weren't super essential",
      "As stupid as this sounds, I spammed my arrow keys and easily breeze through the game without caring about the combos. I like the music, although it feels like the audio cues are not essential for gameplay and leaning more on the visuals.",
      "Awesome rhythm game! Would love to see a high score system, and maybe being rewarded for more precise timing (like a \"perfect\" vs a \"good\" on each note). Well done though!",
      "cool game, a lot of polish",
      "Great rhythm game. The music and sounds were great.",
      "Great rhythm game, loved the art with clear red/white colours, and the additional complexity of the monsters fading.",
      "Nice! Might be good to show a results screen at the end to give feedback on how well you played or how many were missed. I liked the ghost section. Would've been nice to see more of that. Really great entry!",
      "I want more, I don't care if the round is over. Please make more, literally after the 3rd note I was just hooked. Such a good music track. Also reallly love the art and what you did with the end of the song!!",
      "Yay Rhythm game! I found this fun an easy to play, once I got the timing down. Very nice for 2 weeks of work! If I had a couple of suggestions it would be to 1) start with a slower, easier song and ramp up from there. The first track got pretty hectic! 2) I'd echo that the controls should be up/down to match the visual layout. Cool game!",
      "Very simple, but fun rhythm game! My feedback is that I would prefer having the key bindings be top-bottom (for example W and S), not left-right, because they didn't feel intuitive. Also, I could play most of the game without the audio, because all notes are visible on the screen (except the ghost ones, they are a really neat idea!). I love the concept of hitting enemies in rhythm, though. Very solid entry!",
      "Nice clean art style. Timing felt great. Iâ\u0080\u0099m disappointed that it was so short, I want more. Fun little game. One minor thing I noticed is that you can just spam the buttons and hit all the notes. Overall great job.",
      "A simple idea very, very well executed.  Great job! I could see this being top ten!",
      "Enjoyed it a lot, the music is a bop. I love the amount of options provided too, just wish another control scheme was availible that had up/down bindings as I kept on forgetting which directions was top or bottom. The visuals are simple and clean, nice job."
    ],
    "comments_posted": 6,
    "created_at": "2024-02-12 21:48:12",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2494813",
    "coolness": 27,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "111",
      "topics": null,
      "followers": "35",
      "following": "10"
    }
  },
  "2450428": {
    "overal_rating": [
      "Score*",
      "2.617",
      "3.043",
      "2.860",
      "2.629",
      "2.252",
      "2.373"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.867",
      "3.333",
      "3.133",
      "2.880",
      "2.467",
      "2.600"
    ],
    "participant": "zedrick1435167gmailcom",
    "game_title": "Starblitz",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 8,
    "comments_raw": [
      "Looks cool but i'm really bad at it. Kept lossing my mouse pointer.",
      "This was very kool and well done - my wrist hurts from clicking so much so fast.  lol  I enjoyed this way more than expected.  I will be playing this on my phone later forsure.",
      "Solid entry! On my computer it was easy to play and a good time. I appreciated that the graphics were animated to the music and the rhythm sensitivity seemed just right.",
      "Good game well done. I would have liked a better pointer for where the mouse was than the default arrow because it was easy to lose where the mouse was when trying to watch the things coming down. The art and polish were great and the songs were bangers.",
      "pretty generic but awsome really good, love it",
      "I was bad at this but it's a good rhythm game!  It felt complete and polished as well.",
      "Incredible amount of polish and content for the amount of time it was made it. Sometimes it felt like the notes didn't really line up with the music but that's just a mild nitpick. Probably a skill issue ð\u009f\u0098\u0085. Great job!",
      "You really nailed the look and feel of rhythm games. The large variety of songs and unlock system is fun. I like how you muffled the song on a miss, thatâ\u0080\u0099s a good way to communicate the miss. If you need some help to find some good royalty free music for future jams, just ask around the discord."
    ],
    "comments_posted": 10,
    "created_at": "2024-02-08 11:42:33",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2450428",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zedrick1435167gmailcom",
      "member_since": "23 June 2020",
      "posts": "1,440",
      "topics": "45",
      "followers": "78",
      "following": "4"
    }
  },
  "2526429": {
    "overal_rating": [
      "Score*",
      "2.579",
      "2.316",
      "2.947",
      "2.579",
      "2.737",
      "2.316"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.579",
      "2.316",
      "2.947",
      "2.579",
      "2.737",
      "2.316"
    ],
    "participant": "projectpaddy",
    "game_title": "SuperSneakySteven",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 11,
    "comments_raw": [
      "Overall i found the game to unforgiving and the start a bit too hard and doesn't let you understand the mechanics. Fun idea and original palette and art !",
      "Nice art style and I enjoyed the music, Steven's parents eyes in the back of the head confused me until I noticed the sensor. It was a little unforgiving when walking and losing pips, I still haven't made it through by I intend too it my Everest.",
      "Loved the easter egg!! A good entry  everyone below me has already said what I saw and felt could help this feel better! In my opinion this is a great base to start, very good first steps!!",
      "Nice entry. It might be good if there was an audio cue to indicate that you're going too fast, and a little grace period to allow the player to slow down. I know you can hear the footsteps, but it's not clear where the limit is before you start taking damage. I like the art style :)",
      "I love stealth games, and this one is pretty well designed. I also really like the style of the game. It is kinda hard though so I didn't get far. But, great job anyway!",
      "Solid little stealth game, I like the art style and thematic you have set up here! As others have said, the health/pip system is a bit unforgiving, by the time I noticed my health was decreasing I'd already lost 3 pips. I ended up doing a bit of move then stop, then move then stop, in quick succession, but it felt like cheating the system a little bit. If you can tweak that to be more reactive though, then I could see more levels being added to this to great success!",
      "I liked the ideas behind it and the art style. I think the health should have been a bit more forgiving and easier to see, because I would blast through two dots from the time I noticed health being lost and releasing stopping moving. But this was a fun game.",
      "Love the style of this game a lot!  I do think that for this round having something where you had to listen for the mom would have been a little stronger since I found myself using visual cues more than anything else, but I really liked sneaking around!",
      "I really loved the theme and the art style. The palette was beautiful, and I understood the core goal right away. I was a little confused by the sound effect choice. It felt like the visual cues were more helpful for avoiding detection than the visual cues, and the movement of the character felt very slow (which I get was the point, but that was my reaction at the time.) But overall great entry!",
      "The game was fun but very, very punishing. You lose if you get caught, you lose health by moving too much, lose the dot things by moving too much (which you cannot regenerate to my knowledge?) and the lose state will cause you to restart. You move so slowly and then the game punishes you for moving anyways. However, there are some neat ideas here. I like the stealth part, have always enjoyed stealth games. Still a little unsure where the audio cues come in (are they the little slurp sound things always playing??) Tbh, I think is looks pretty good. The lack of color and blocky cartoonish objects create a cool feel. Overall, a lot of good ideas, but needed some more planning and prototyping to improve the implementation.",
      "by the critierias this is a pretty good game!!, just needs the player to be faster at base speed, i feel like a slug, also punishing the player for walking fast?? VIA A STAMINA BAR??, ok i think it would work better as parent gets more active the faster you are bcus you are making more noise or smtn"
    ],
    "comments_posted": 13,
    "created_at": "2024-02-13 04:26:24",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2526429",
    "coolness": 34,
    "participant_info": {
      "profile_url": "https://itch.io/profile/projectpaddy",
      "member_since": "24 November 2020",
      "posts": "177",
      "topics": "3",
      "followers": "22",
      "following": "186"
    }
  },
  "2527798": {
    "overal_rating": [
      "Score*",
      "3.750",
      "3.600",
      "2.750",
      "3.170",
      "2.800",
      "2.950"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.750",
      "3.600",
      "2.750",
      "3.170",
      "2.800",
      "2.950"
    ],
    "participant": "keltfire",
    "game_title": "The Echo Experiment",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 11,
    "comments_raw": [
      "I started feeling disoriented toward the end of my play time - I like I was trying to escape a burning building or something. It was an unsettling feeling of fear of whatever something might lie in the darkness. I real like the unintentional horror of this game and the sound design was great too. very nice work",
      "Really like the idea. I found it a bit too difficult, not sure what could be done but something that would help map the level would be nice. The echo effect is really cool ! Congrats !",
      "Really unique game, but I am so bad at spatial orientation that I was really struggling to get through it. If that's how bats see the world, then I am sorry for them and I am glad I am not a bat. Anyway, the game! Really cool visual effect with the circles. Also, I love the atmosphere and the voice acting. Very impressive!",
      "This was a lot of fun to play on the stream!  Super interesting concept, and I'd love to play it as a full game with a few tweaks to help keep the player a little more oriented in the space.  Great job!",
      "The visual effect and overall vibe of the game are very cool. I think it would've been great to add some kind of audio cue to help guide the player, like a background sound that gets louder as you get closer to the goal.",
      "Awesome concept, and implemented fairly well Iâ\u0080\u0099d say! Definitely a bit trippy to play, and got a bit dizzying after awhile (I must admit that I cut my losses once I was first sighted by another person, as once they found me I just couldnâ\u0080\u0099t orient quickly enough to know where even to go).",
      "Great game. I had a similar idea but didn't go with it. You did better than I would have.",
      "Ah so cool! My only big suggestion would be to add a mouse speed calibration setting. On my computer the sensitivity was super high, so I'd move my mouse just a little and suddenly be looking the other direction or at the ceiling, etc. But I love the music and ambience and think it hits the prompt very well.",
      "Very neat idea. I think the echolocation effect could be improved a bit more, like in theevengy's gamewhere there's a lasting effect. The shortness of the burst made it hard to see and punishing to use. However, I did find that it was still effective at conveying what it needed to, and I appreciated the narration and story. Well done!",
      "Love the echolocation visiual! Such a good twist! It is a bit difficult as I feel like the enemis can find you really easy, but again it might just I suck at the level lol",
      "PRETTY CONFUSING, tbh the echolocation should last longer,may be a skill issue tho"
    ],
    "comments_posted": 16,
    "created_at": "2024-02-13 22:13:29",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2527798",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/keltfire",
      "member_since": "13 June 2020",
      "posts": "312",
      "topics": null,
      "followers": "12",
      "following": "3"
    }
  },
  "2527950": {
    "overal_rating": [
      "Score*",
      "2.701",
      "1.919",
      "1.777",
      "2.047",
      "1.990",
      "1.848"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.455",
      "2.455",
      "2.273",
      "2.618",
      "2.545",
      "2.364"
    ],
    "participant": "nuker0s",
    "game_title": "Void Synth",
    "platforms": [
      "windows",
      "osx",
      "linux"
    ],
    "rating_count": 11,
    "comments_received": 6,
    "comments_raw": [
      "I'm not really good at that type of game and got stuck on the second puzzle. Trried brute force by mashing the all button but could'nt pass the blue barrier. I really like the absurd world but at some point i was not really understanding what was happening. It also made me very curious and really wanted to understand the world.",
      "This was a cool concept, but I think you made the puzzles a little too difficult with not enough explanation or tutorial, especially considering how blind the player starts.  I played and gave up a few times before going back to it and figuring it out.  Really cool idea, still!",
      "Minor callout it lists being for windows, mac, and linux - but the build appears to be fore windows only. Iâ\u0080\u0099ll give it a try playing later when I have my pc machine booted up.",
      "Interesting game. I'm terrible with notes, so that last one took me forever. Great concept, even though you ran out of time I think it has enough interesting content unless there was more of a variety of puzzles. It was fun.",
      "Unfortunetly I didnt understand anything. I was in a dark place with stars at the sky and a \"jukebox?\" couldnt figure out what to do or where to go besides falling off the map :/",
      "This was a really ambitious idea, which might have led to not much time for polish. But the further I got into the game, the more invested I became in finishing it. My largest criticism is that it was sometimes hard to see which color note you were supposed to play as it would be inside the itemâ\u0080\u0099s model (especially for the larger items). I think I got to the end, where there was the 3 higher beings at the end of the sandy area, but I wasnâ\u0080\u0099t sure if I was supposed to do anything further."
    ],
    "comments_posted": 7,
    "created_at": "2024-02-13 23:27:42",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2527950",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nuker0s",
      "member_since": "13 November 2020",
      "posts": "17",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "2500926": {
    "overal_rating": [
      "Score*",
      "4.125",
      "3.359",
      "3.170",
      "3.182",
      "2.652",
      "2.534"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.375",
      "3.563",
      "3.362",
      "3.375",
      "2.813",
      "2.688"
    ],
    "participant": "gryyre",
    "game_title": "Xenon EX",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 10,
    "comments_raw": [
      "Trippy game but it was fun ! Not sure how i solved it but i got the ending !",
      "This was a trip :D very kool aesthetic and how u implemented the audio into gameplay was well done. Good Job - Good Game",
      "This game was just delightfully bizarre.  It was a little confusing to figure out at first, but I can't decide if more instruction or guidance would be good or if it's the just right level of obscure.  Either way, really cool entry!",
      "This definitely feels like a dream made into a game! Simple concept but well executed, loved the abstractness of the box player character, and nice to have a tangible uhh ending hehe, I hope youâ\u0080\u0099ve recovered mentally.",
      "fun game, follow the limitation, creepy the right way",
      "good game its awsome, but the backgrounds does not screen clear itself, idk why, love it and the visual style tho",
      "Awesome! The distorted text is a great idea to convey you're in a dream. Gameplay fits the challenge really well. Might've been cool if the direction of the rotating arrow corresponded with the position of the number of the lock.",
      "Loved this. It's so weird and yet fits and is fun.",
      "The graphics and surreal atmosphere are fantastic, and i was able to navigate to the correct square (I think) correctly. You might want to consider putting the controls in the game description as well, as it took me a few refreshes to understand the controls. To me all of the clues sounded the same, so I think I missed something and wasn't able to get through the door. Haha. But overall a very lovely entry.",
      "Weird but also fun? Only piece of advice would be some way to tell which number was the first, because if you forget or accidently press the button then you don't really have a way to get the code, unless I'm missing something. Ending made me laugh. Visuals look great. Overall, well done."
    ],
    "comments_posted": 6,
    "created_at": "2024-02-13 20:46:51",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2500926",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gryyre",
      "member_since": "24 October 2021",
      "posts": "37",
      "topics": "3",
      "followers": "13",
      "following": "2"
    }
  },
  "2528041": {
    "overal_rating": [
      "Score*",
      "2.003",
      "2.003",
      "1.650",
      "2.062",
      "1.886",
      "1.921"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.125",
      "2.125",
      "1.750",
      "2.188",
      "2.000",
      "2.038"
    ],
    "participant": "crimson-wolf-games",
    "game_title": "bat game",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 9,
    "comments_raw": [
      "now I know why batman is overpowered lol, the audio is pretty annoying but the mechanics is cool, would have been cool if the sound bounce instead of going through the objects.",
      "Cool mechanic - got a little confused with the environment but I could see where you were going with it :)",
      "Hey awesome that you got something submitted! This is an entry that has potential and a cool underlying idea. With some more time and playtesting it could be great! Huge kudos for getting it in, and I hope you'll keep working on it.",
      "Was very confused at first, I think the first time I loaded the game I either escaped unwittingly or there were just no barriers or enemies created/loaded? But on a refresh, I did get things to show up. To â\u0080\u009cechoâ\u0080\u009d what others mentioned, feels a bit work-in-progress as sometimes I would die the moment something showed up, and it didnâ\u0080\u0099t clearly explain the purpose too well. But as a mechanic, thereâ\u0080\u0099s definitely something there to work with.",
      "I like the concept. I don't have anything to add that wasn't said already.",
      "This game feels just like a prototype rather than a full project. That's not to say there weren't some good ideas. I appreciate the way you use your echolocation and had fun navigating around the tunnels. With a little bit of art or just a color palette change, along with some polish, I think it could be a lot better. The echolocation sound it really annoying though, especially when used repeatedly. I personally think that the simplistic art style would have worked a lot better had you not used the pixel art bat. Overall, it has some good ideas and decent execution, just needed a little bit more time and care. Hope to see you next round!",
      "feel janky this really feels like a prototype created in a day or two, i think if you just continued your round 1 game and make the dancing you dancing to the notes, it would probably be better, BUT i like echolocation",
      "Echolocation is really cool.  I liked your visual representation of the sound, too!  I'd agree with Brainfart that I was a little confused what I was doing, though.",
      "Cool concept.  I considered echolocation, but couldn't actually think of a way to utilize it.  This was a really clever take on it!  I would like to see a little more explanation of what's going on.  Maybe a little more explanation in the game page description?  I'm assuming you need to avoid the walls?  Eat the enemy bat pellet?  Still managed to make it past a level or two, though.  Nice job."
    ],
    "comments_posted": 2,
    "created_at": "2024-02-13 23:45:56",
    "game_url": "https://itch.io/jam/gdko-2024-round-2/rate/2528041",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crimson-wolf-games",
      "member_since": "23 July 2019",
      "posts": "180",
      "topics": "2",
      "followers": "6",
      "following": "4"
    }
  }
}