{
  "2582618": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "jonqs",
    "game_title": "A grain of sand",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 10,
    "comments_received": 6,
    "comments_raw": [
      "Very neat visuals with all the effects and stuff. I kinda didn't know what was happening though, I tried following the flying plant thing, but the floaty movement made it challenging and I have no idea what the purple portal on the ceiling does. I also tried going up and down from the beginning, but none of the paths seemed to lead me anywhere. But I must say that the audio design is great and overall vibe is really intriguing and well made!",
      "Really excellent look and feel and environment. I missed that you could go up and down from the big entry room, so I got to the end with only the plant and that was a little confounding. A simple fix might be to add a clear \"up\" and \"down\" arrow to the signs or some environmental path guiding with little glowy thing to pick up along the way. But overall a solid entry!",
      "This was a fun little game!! Loved how you had to build the little robot and then got to fly it at the end!!",
      "A fun game. I'll have to try the download when I'm done with all the other games. I think the camera could help a little by tracking ahead of the movement. It took me some time to get used to the movement, but the game itself was fun enough to keep me engaged without getting frustrated or bored.",
      "Indeed a fun way to start out, even though a simpler image would have worked, somehow have the feed of the human hands just worked so charmingly well. I will admit I didnâ\u0080\u0099t get to the end full end (or at least, not with all the features unlocked), after the starting tutorial area it seemed to be less of a storytelling arena and more just obstacle course. Iâ\u0080\u0099ll admit to some confusion as which ways were valid paths, there definitely was some good nudges with the signs but I found myself bouncing against walls where I thought the game was nudging me to go.",
      "This was really cool!  I liked the assembly line to start out.  A few of the areas felt a little more difficult than needed for a game this short, but it wasn't to the point that the game wasn't fun.  Great job!"
    ],
    "comments_posted": 6,
    "created_at": "2024-03-14 02:03:42",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2582618",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jonqs",
      "member_since": "29 March 2016",
      "posts": "217",
      "topics": "1",
      "followers": "10",
      "following": "4"
    }
  },
  "2557427": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "hugbug",
    "game_title": "BattleMage",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 13,
    "comments_raw": [
      "I'm a big fan of your art and all your design, very polished. Maybe better to first focus on gameplay and then focus on art. I think your art probably already looks great when you do 20% of the work.",
      "Game is short but art is really amazing ! Excellent work on the integration in the itch page.",
      "Stellar work! Really sold the style well, and as always your itch.io presentation is on point. Pretty awesome what youâ\u0080\u0099re able to accomplish with straight html/css/javascript so kudos there.",
      "When is the next comic coming out? Okay the art is by far the best I've ever seen, holy crap you are amazing! You can easly follow the story, such a good idea!I need the next chapter!!",
      "Amazing art, it just jumps at you! Do you do this professionally lol? I wished i could turn the pages back to read it again hehe.",
      "super cool idea, wish it were longer! (also i keep being impressed by the game pages alone, great work)",
      "Great game, I'd love to see more.  The art and playing inside the comic was awesome.  Very well done.",
      "The artstyle is awesome, I love the comic pages and their animations, they're so cool! Really unfortunate that there was no time for more levels, but I get it, real life always gets in the way. The story was pretty clear, but as I said, the highlight for me is the way the story is presented. Really great entry!",
      "",
      "Damn HugBug you set a real high standard, was a beautiful game and I loved your comic experience (as a big comic fan myself). Game part was nice and very effective though I was looking forward to the next pages (of game), great job!",
      "I love the aesthetic and the art is really good. The attention to detail is immaculate, and I love how you described your art process. I'd love to see a post-jam version with more levels (or an update later in the tournament). Very well done!",
      "As always, incredible job.  I like that you described your art process in the description as well!  The little details really came through on this one as well, with things lighting up when you hit the lightning button, the sound effects and shake when the gate opened, etc... Your games are always so good it's hard to find things to give constructive criticism on but you always give good feedback so I'll see if I can pass on some advice about platformers I've been given.  The jump animation while moving was really great, but there wasn't a jump animation for jumping while standing still, which made the jump feel pretty stiff.  Endmark gave me the advice last year of using a little vertical stretch on jumping and horizontal stretch on landing, and I've found it gives a really natural jump look even without a unique jump animation.  In some ways I think the limited animation kind of fit the comic book aesthetic, though, so I wouldn't complain if it's an intentional choice.  Big fan of your work!  The comic book aesthetic is fantastic!",
      "Your game is incredibly well-presented and the comic book art style looks very professional. I really liked moving across the level and using the lightning bolts, also really great seeing the comic book come to life"
    ],
    "comments_posted": 21,
    "created_at": "2024-03-14 03:54:36",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2557427",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hugbug",
      "member_since": "30 June 2022",
      "posts": "420",
      "topics": "8",
      "followers": "94",
      "following": "33"
    }
  },
  "2581199": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "dev-pirates",
    "game_title": "Crunkle's Debt",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 10,
    "comments_raw": [
      "All five stars for me! Very excellently done.",
      "Solid entry, and love seeing how this saga continues! Also you did a great job retelling the story of the prior rounds without it being over kill, the sequence of several very short scenes told the story very well. I also think having the choices of what to do during the game helps reinforce the idea of the storytelling being central. I got at least two endings, and thanks to your tip on how to beat the boss, I figured out the detail of standing underneath to get the spider to do my dirty work.",
      "What a great game! love the art style, and that you had the option to choose which path to take. That is such a good idea! I will say the beginning story part was a little fast but other than that it was a great game!!",
      "You've always done great with Crunkle but this one especially I really loved.  Having the player choice impact the story was a really smart move, and it was REALLY satisfying to get different endings based on what I chose instead of just a pseudo choice.  Based on the other comments I think there's a general consensus that the intro cutscene moved a little fast and I'd agree with that.  I felt like I was struggling to follow.  Some of your cutscenes had a button input to progress them and I think it would have been good to see it there as well so the player could progress once they felt they understood the current scene.  No critiques besides that, though.  Great game and great entry!",
      "I MADE A NOTE SO I WONT FORGET: \"comment on the logo having no letters to comply with the round's theme\"",
      "The story is very engaging, I like how it is told between levels and how I can make choices to influence it.",
      "Yay, another installment of the Crunkle series! I love the stealth elements of this one and enjoyed being able to pick my path. Only advice would be slower cutscenes, but that's a small nitpick. Very well done!",
      "Fantastic continuation of the Crunkle series. Excellent story seamlessly fitting all three games. Great art and gameplay as always. I had to play through twice to make sure I got all of the different options. One of my favorites this round.",
      "Itâ\u0080\u0099s fantastic to see the continuation of your game and the extra levels are really awesome. I think itâ\u0080\u0099s really clever using the beast to defeat Crunkle and I like the other bad guys too. The cutscenes throughout the game capture the story perfectly and prove that a picture really is worth a thousand words",
      "I like how I can pick the route I want to go, and how every level had multiple routes to colplete. At first I went to the police, but I didnt like that ending, so I tried to fight crunkle, but I couldnt damage him.Still a pretty good entry, I like the short cutscenes that tell the story, and how its tied to the leves and gameplay. Good Job!"
    ],
    "comments_posted": 21,
    "created_at": "2024-03-13 08:11:00",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2581199",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "574",
      "topics": "1",
      "followers": "12",
      "following": "13"
    }
  },
  "2583041": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "spoonsweet",
    "game_title": "Disturbed Cats Tell no Tails",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 10,
    "comments_raw": [
      "i managed to get three endings of the endings (somehow unlocked all four on the menu tho?) and it was really cool trying to figure out what i needed to do :D and as always the art is absolutely amazing! (also are the things on the menu from septembit? cause i feel like I've seen them before lol)",
      "More beautiful pixel art! Nice sound effects and incredible color palette choice.",
      "Continues to be a fun art style! I will admit that I still only have a light grasp of what actions are happening and how one thing relates to the next. After seeing one of your tweets, I realized there was more than what I initially encountered. I went back and was able to unveil the glitchy red book, but still Iâ\u0080\u0099m definitely not getting all of what you showed off.",
      "I will always love your art style!! Also, can't get over the books flipping pages!!I had to get the evil kitty ending!",
      "As always, love your art and style.  I keep going back and forth on if i think the story/gameplay are too obscure or just the right level of obscure.  Certainly a fascinating game to explore!",
      "A very confusing title. The gameplay was interesting, and I loved the way every object sounded. Finding the corrupted ending was really fun. I got 3 different endings.",
      "Always love your art style and game entries. I couldn't get the second of four endings it looks like. I'll try again when I'm done playing and rating the rest.",
      "All the art and animations are awesome. The gameplay is confusing, but fun to play around with. I didn't quite get the story, but I still enjoyed picking up and moving cats. Also, I love the pun in the title!",
      "I played through the whole game twice and still don't really know what was happening? The art and animations are superb and adorable. A bit more instruction or direction for the gameplay would have been nice. Overall well done.",
      "The animations, particularly the way the books open and shut are awesome. I also liked the ability to pick up the cats and basically clicking on everything to see what it did was fun. Best of luck in both jams"
    ],
    "comments_posted": 15,
    "created_at": "2024-03-14 05:22:38",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2583041",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "942",
      "topics": "5",
      "followers": "153",
      "following": "68"
    }
  },
  "2576186": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "sijilum",
    "game_title": "Frame by Frame",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 12,
    "comments_raw": [
      "I really like this approach to a point and click. It gives a nice \"documentary\" feeling to it, and lets us wonder about who took these pictures. Nice work!",
      "Very clever take on a horror film! And paired with good, intuitive controls, I was able to get make my way to the monster and subsequently die. No nits from me!",
      "Such a good game, using polaroids to tell the story is a great idea and on top its a horror theme! I was expecting every time something was going to reach out and grab me lol.",
      "the only comfort I had while being torn to pieces in the basement was that my expensive polaroid pictures were being recycled once I reached a cap.",
      "Well done story and game. Top marks and no notes from me.",
      "Wow, a really polished and unique horror game! I got stuck at some points, but I made it to the ending. I like how the story is told through environment. The visuals and audio create a very creepy mood. Great game!",
      "simple and to the point :) I love the atmosphere you've created!",
      "",
      "A little bit confusing with what to actually do, sometimes I didn't realize I could go in a certain direction or had access to something. However, I love the framing with the photos. The sound design was really good and the game overall is very polished. Great job!",
      "The polaroid photo style is absolute genius.  I'd for sure play a longer game in this style!  My only feedback is that a little instruction at the beginning to know to check the edges for being able to turn in a room would help, and maybe some different types of keys?  Nothing was to a point that I didn't figure it out pretty quick, though, and this was a five stars across the board entry for me.",
      "the framing for the game is amazing! love how the polaroids limit your movement and vision which makes things more tense, this could definitely be turned into a full game :D",
      "Using photos to tell the story and navigate the house is a great idea. Finding the key to open the door felt like a classic and satisfying click-adventure game and itâ\u0080\u0099s presented really well throughout. However, after reaching the car, I felt a bit lost so Iâ\u0080\u0099ll have to play again another day to see if I missed something"
    ],
    "comments_posted": 6,
    "created_at": "2024-03-13 22:01:21",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2576186",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "119",
      "topics": null,
      "followers": "37",
      "following": "10"
    }
  },
  "2576774": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "spookyrobloxman999",
    "game_title": "GDKO GAME",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 6,
    "comments_raw": [
      "I love how simple the gameplay is but quite challenging at first. Great job getting something submitted even if you weren't able to find time to do everything you probably imagined.",
      "Really fun game! I think the level design isn't bad and the movement feels good. But in terms of story, I wouldn't catch any of it if not for the text in the description. The art looks great though and I like how every level has different colors, mechanics and music. Well done!",
      "I liked the game, but I didn't see much in the way of narrative. This is a fun game and you did a good job with it.",
      "The mechanics were neat. I think the story could have been implemented a bit better and the level design could have been improved a bit at some points but overall, a nicely made game.",
      "Regarding the round theme, Iâ\u0080\u0099ll have to admit I didnâ\u0080\u0099t get much of a story vibe - there was certainly some character to the different levels though, I got to someway through the third where the orange orbs were introduced.",
      "The inclusion of checkpoints to collect was great and I liked the dash orbs too. The player movement and music were good and I managed to get to level 3"
    ],
    "comments_posted": 0,
    "created_at": "2024-03-13 12:49:45",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2576774",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spookyrobloxman999",
      "member_since": "12 November 2022",
      "posts": "129",
      "topics": "3",
      "followers": "6",
      "following": null
    }
  },
  "2578171": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "charlie-oh",
    "game_title": "GROUND-ZERO",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 9,
    "comments_received": 7,
    "comments_raw": [
      "The game was a bit difficult and I died a few times, some checkpoints would be nice to have instead of starting again from the beginning.",
      "Really nice aesthetic that adds to the story. I love the LCD effect and the nostalgic FPS vibe.",
      "Um holy crap, you can easily turn this into a full game and sell it! Before entering the building you know the story and such an awesome visual effect. Dev Pirates is right, this made me feel like I was a kid again and playing one of my Playstation games!",
      "Um holy crap, you can easily turn this into a full game and sell it! Before entering the building you know the story and such an awesome visual effect. Dev Pirates is right, this made me feel like I was a kid again and playing one of my Playstation games!",
      "Loved everything about this game! The art style and filter and the gameplay were all a well done representation of the first 3D games from the Playstation era.",
      "The atmosphere and filter and everything fits together really well!  This was a really good entry.  My only complaint is that the mouse sensitivity started super low for some reason but after adjusting that the controls felts nice.",
      "Wow, feels like a complete game! Well polished, everything fit together nicely. Definitely telling a story through the environment. Maybe thereâ\u0080\u0099s some fuzziness on the exact details, but I donâ\u0080\u0099t think thatâ\u0080\u0099s a real problem."
    ],
    "comments_posted": 0,
    "created_at": "2024-03-11 20:01:28",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2578171",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/charlie-oh",
      "member_since": "14 March 2020",
      "posts": "57",
      "topics": null,
      "followers": "14",
      "following": "2"
    }
  },
  "2579314": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "ricotv",
    "game_title": "Laszlo",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 13,
    "comments_raw": [
      "Love the pixel art and animations. This is a great start despite a rough round, real-like wise. So many of us didn't find the time to achieve our visions, and you're a hero to community to follow through! Thank you. :D",
      "Kind of a story to it (and with a happy ending) ! Congratulations and have fun moving in !",
      "The hardest part is always submitting, you got over that and submitted good job on that! Regardless if you finished your game or not, it was a good start and I'm curious to what's going to happen as soon as I turn that corner!",
      "Good for you for putting life over the jam, there's always next year. It's really nice of you to submit despite everything, you will probably make someone very happy with that. Congratulations on finding a new home!",
      "It's not much, but it did intrigue me. I'd love to see what happened in the story. I get the decision to prioritize life. I hope to see more of you in the future.",
      "Life is always more important than a game jam. Hope your new home suits you well. Best of Luck",
      "Came for the story, saw the amazing art, got the feels...",
      "Sorry life was chaotic for you this round!  Honestly the first bit of this was so dope and I'd love to see more!",
      "Not going to rate this but just going to wish you luck and thank you for all you've done for GDKO â\u009d¤ï¸\u008f",
      "",
      "Iâ\u0080\u0099m just going to say ð\u009f\u0092\u0099 and best of wishes, life definitely comes before jams",
      "Itâ\u0080\u0099s good that you managed to submit your game and I hope youâ\u0080\u0099re settling well in your new home",
      "On the off chance I make - I would continue on I feel there is only up from here. I will continue to play and comment and hopefully make Vids of the Jam till the end."
    ],
    "comments_posted": 9,
    "created_at": "2024-03-12 07:51:29",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2579314",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ricotv",
      "member_since": "21 March 2021",
      "posts": "715",
      "topics": "7",
      "followers": "13",
      "following": "15"
    }
  },
  "2583436": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "tenifayiga",
    "game_title": "Learned Aggression",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 8,
    "comments_raw": [
      "Okay, when the poor little scientist guys were screaming in terror, I laughed out loud. Nice little puzzle game and just the right length for a jam game.",
      "It was pretty fun and like Patrick has said, totally got the Portal test subject vibe and really enjoyed that!!!",
      "Good job!  I like that the story wasn't so much handed to the player as figured out along the way.",
      "This put a smile on my face. I immediately got the Portal â\u0080\u009ctest subjectâ\u0080\u009d vibe. I was starting to mentally collect some of my thoughts about the puzzling and how to phrase a lack of story, when I saw the cheeky cracked walls - and then the humans running around with the siren, ha got an out loud laugh from me as I made my way to the end of the hallway with some carnage along the way. Sort of felt like a classic â\u0080\u009cdistract you thinking one thing, when it becomes anotherâ\u0080\u009d.",
      "Fun game with a good story. A tiny bit of juice would have made a lot of difference, but it is a good game regardless.",
      "A fun little game! The graphics are nice. I think a little more could have been done with the levels as they didn't really ever feel challenging, just like a chore, even though they were building up to the end part. I think the story was good, but could have been alluded to a bit earlier so you understand what's happening better. As others have suggested, just having a little end card or something would be so much better than just restarting, but overall, nice job.",
      "I tried to find an alternative ending/play method but couldn't find it (if there is one), the SFX and graphics were a highlight. As GameFavourites suggested and ending would have added some to the game.",
      "Breaking the blocks and flipping the switches is great and the sound effects add a nice touch to the experience. I think the game might benefit from having an end screen as it could be more rewarding than starting at the beginning but all in all, itâ\u0080\u0099s pretty good"
    ],
    "comments_posted": 0,
    "created_at": "2024-03-14 07:55:19",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2583436",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/tenifayiga",
      "member_since": "03 December 2018",
      "posts": "69",
      "topics": "1",
      "followers": "8",
      "following": "1"
    }
  },
  "2582515": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "gamefavorites",
    "game_title": "Mind Over Fury",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 12,
    "comments_raw": [
      "Love the simplicity of the idea and the variety in gameplay! Great story very well executed â­\u0090",
      "Very strong entry. The gameplay was engaging and completely new to me, which I love. Strong contender for top three game of this round, imo. The approach of telling a full story through gameplay worked very well.",
      "Was really cool reminded me of old Sega games took me a while to get the feel of the mechanic but once I did it was a lot of fun. Loved the boss battle and intro scene!",
      "Fun title! I liked how it conveyed a clear story while being short a sweet - with some puzzle/platformers, the story can get lost with too many levels, but the setup was clear enough and not too long to lose focus. Loved the detail at the end of the credits where the scientists turns back to human (but then reverts themselves back to being a monster? I guess the power was just too great).",
      "Such a satisfying game to play! Really love the music, makes you just want to play more and more! Love the art and the story!",
      "Such a sick game! I loved the story, loved the mechanics! It felt sooooo good to slam dunk the crystal straight in the portal with the \"pushing away\" psychics! Amazing work on this one GameFavorites!",
      "Very fun puzzle game, I love the levels, even though some of them are pretty hard. The narrative is clear to me and the ending is really satisfying. Great job!",
      "Great game. I loved the art and the sounds, but I the level puzzles with the telekinesis mechanic were my favorite part of this game.",
      "Really fun concept. I liked the gameplay a lot, although I found the level 3 really diffcult with the precise move at the end. I did like how every level the mechanic changed, good job",
      "Super fun, a couple more levels would have been nice and I hit the boss a couple times before it actually was destroyed, which felt a little unintuitive (I imagine it has a specific hitbox). The mechanic was fairly original and fun to use, well done.",
      "I love the art, cutscene, and mechanics on this one!  Really solid entry!",
      "Cool mechanics :) was very intuitive and satisfying :)"
    ],
    "comments_posted": 19,
    "created_at": "2024-03-13 23:31:38",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2582515",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "820",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "2553892": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "q34dev",
    "game_title": "Muerto",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 9,
    "comments_raw": [
      "Really love how everything fit together, and the really crisp (vector delivered?) graphics. Almost seems crazy for me to say this, but in a way I wish it was a bit shorter as it was a little long to go through the whole thing multiple times to see the different endings - but I really appreciate therebeingdifferent entries, so nice work on that front.",
      "Love the graphics that both match the cultural settings and suggest old school pixel graphics. A very complete game for such a short jam, with a nice story mechanic that builds well.",
      "Great art, music, and level design. Love the mini boss fights!!! And such a good ending on you having to choose who gets to live based on their stories you find out about!",
      "This was great!  I feel like the environment was top tier, and the way things would time up with the music was a great touch.  Overall phenomenal entry.  My only complaint is that there was a spot in the green area that felt a little too confusing with getting past the arrows.  Looks like Spoonsweet got stuck in the same spot.  I feel like sometimes the mechanics slowed the story down a little bit but that might have been my preference for the difficulty.  Great game!",
      "Such a cool game! The story on the painting was a great way to give context and narrative!Also, the environmental story telling with all the souls moving to the door.. wow",
      "Another great game. I loved the battles and the story was great. High marks for all the criteria.",
      "First of all, the amount of polish packed in is incredible. I love the art and the color choices. A couple more music tracks would have been nice (for different areas), as the one got repetitive and the boss music felt a little out of place.  Multiple boss fights is great, but they felt a little easy. (I remember playing an earlier version when they were extremely hard, so a middle ground would have been nice.) I love the variety in obstacles and areas, and the level design was super great. Collecting the different pictures and following the story was very fun too, well done.",
      "really nice game! the art was nice and the story was really enjoyable :D",
      "The game is really good! The boss fights were definitely a highlight for me â\u0080\u0093 challenging but rewarding. I think the overall pace could be improved with slightly faster movement or perhaps slightly slower boss attacks. The main game had a great variety, and although some parts were tough, I persevered. I reached what seems like the final boss with a parrot keeping an eye on things no less. I think I almost had it, but I'll have to try again another day"
    ],
    "comments_posted": 17,
    "created_at": "2024-03-13 06:58:59",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2553892",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/q34dev",
      "member_since": "26 January 2022",
      "posts": "329",
      "topics": null,
      "followers": "14",
      "following": "9"
    }
  },
  "2581541": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "potatuetata",
    "game_title": "Otter Outrun",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 10,
    "comments_raw": [
      "Super perfect color palette, lovely simple animations, easy to understand gameplay. Just the right length for a jam game. And the ending is adorable.",
      "Nice entry, well polished. Though it was in a way fairly light on the story, it did have a beginning, middle, and rewarding feeling end so that hits the mark! Everything fit together quite nicely - even your itch page, nice to see what you learned.",
      "Really fun little game. I love the blue visuals, everything feels cohesive and very polished. I appreciate the collisions tutorial, which is a nice way to get the player to understand the game. The ending was adorable, but I didn't feel like there was much of a story there outside of it. The difficulty is not too high, I managed to get all fish in my second try, it was a good idea to only slow the player down a little when they hit something instead of instantly restarting the whole run. Overall, really solid entry. Feels like a finished game, well done!",
      "I had a lot of playing this one. The game was easy to get into and the chase was fun. And the story worked well with the game.",
      "Such a cool vibe in this game!The colours, the music, the kisses!",
      "Wow really please to see your little otter again great build the last round and the story that ending made it :) there is going to be some fat baby otters soon!",
      "Adorable artwork with a minimalistic color palette. Fun gameplay and the ending ties the whole story together seamlessly. Great job.",
      "Super fun game! I love how it is fairly forgiving, but not too much so, and it has just the right level of difficulty (with optional ways to challenge yourself). The art looks so much better than last round honestly, the color palette is super nice. Overall, very well done.",
      "The story was simple but clear, and flowed super well into the gameplay.  Really good job with this!",
      "The wordless tutorial blended seamlessly with the gameplay. Reaching the end with all 9 fish and getting through that narrow gap was really cool. I liked the environmental obstacles like the nets, rocks and seagrass and thought the game was really fun. The progress at the bottom was a nice addition too"
    ],
    "comments_posted": 9,
    "created_at": "2024-03-14 01:20:25",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2581541",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/potatuetata",
      "member_since": "02 December 2018",
      "posts": "133",
      "topics": "1",
      "followers": "10",
      "following": "4"
    }
  },
  "2576333": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "theduckcow",
    "game_title": "Panic'Paper",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 10,
    "comments_raw": [
      "The idea is really cool and like this paper art more and more after each of your entries.",
      "Kudos for getting something submitted! Haha this is what I feel like when I wake up in the morning.",
      "I really liked the style and was excited to hit the road but couldn't get my car to go. Very cohesive and a good use of sounds will def check back and try again.",
      "As always love how the environment is paper and just looks amazing! I can see how the breathing would help due to traffic and bad drivers. I live in a city with just horrible drivers and find myself having to take deep breaths to calm down!",
      "First off, really love how you used the art and the theme of cars through the rounds this year!Loved the idea with the alarm showing the time (would have liked some feedback on the \"button mash space\" at that part, since I had no indication if my massing was doing anything. I applaud the idea of the quick space to get donut, as it does mimic irl situations.",
      "As with the rest of your games this year, the art style is great. I liked the one button mechanics and would love to have seen more, I get the time running out. Good game.",
      "The one button breathing mechanic is pretty fun and I love the first-person animations. It's unfortunate that there is not much more to the game, but I can see the potential. The artstyle really fits the game with all the scribbled lines and the audio is very good too.",
      "I wish it was a longer story, but what you have is super well told!",
      "Sure, there isn't much, but what's there is super polished. The animations are incredibly smooth, and seeing the hand drawn style in first person this time was incredible gratifying. I'd love to see an updated post-jam version.",
      "I think youâ\u0080\u0099ve captured the anxious atmosphere really well and having the first person perspective works really well for this. I also love the 3D hand drawn look to your game and the diverse way of using one button"
    ],
    "comments_posted": 21,
    "created_at": "2024-03-14 07:57:53",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2576333",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/theduckcow",
      "member_since": "30 January 2021",
      "posts": "303",
      "topics": "3",
      "followers": "23",
      "following": "10"
    }
  },
  "2464861": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "wolfenrahd",
    "game_title": "Project Nendou",
    "platforms": [
      "windows",
      "osx",
      "linux",
      "web"
    ],
    "rating_count": 14,
    "comments_received": 8,
    "comments_raw": [
      "Strong entry, in my opinion. A very complete game with some nice narrative elements. If I had a suggestion for future work, it might be to consider fewer controls and features, as the base gameplay with just movement and TK is super cool, and that idea could be expanded more, making the game easier to learn. Nice work, truly!",
      "It was a cool game really cool style with the dynamic hair it reminded me of Flashback a lot which when compared to is always a good thing.",
      "Nice entry, you definitely managed to expand on your entry to add in a few more story beats. It worked well going into little flashback scenes (although, it did mean much of the storytelling was separate from the gameplay itself). I got to the ending, a sweet touch adding the ball back in there.",
      "very cool game you have here! I love the story with the ball and then the test subject. Your animations are SICK! I love the hear, the naruto run, the story within the story! I also agree, the game fusion might have been a bit too much, but greatly implemented and it works! So good job! I got stuck on the first Godot platform, didn't know where I could go from there. I am being peculiar and would have liked if you kept it text-less for this round, but that doesn't take away from your great work!. Again, nice art, nice physics!",
      "This is a really fun game and I liked the story in the game.",
      "I really like this game that you've had going.  One thing I'd say is that for a jam this short, I'd almost say have less in the game and really lock down a couple things.  The weapon crafting mechanic for instance I thought was super cool, but I felt like it was a little out of place since there wasn't a lot of time to integrate it into the larger story.  I'd love to see this turned into a more complete game, though!",
      "First of all, the graphics are stunning. The cutscenes were a little confusing and hard to follow, maybe because of the abstract art style. The fusion mechanic from round 1 still felt a little out of place and with that modifier removed it could maybe be simplified. Overall, great job.",
      "Really awesome that you continued on from the previous game. The telekinesis is super satisfying to use and interacts with the environment in interesting ways. The gameplay feels well-polished and is really excellent all round"
    ],
    "comments_posted": 0,
    "created_at": "2024-03-14 07:55:02",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2464861",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/wolfenrahd",
      "member_since": "11 October 2016",
      "posts": "134",
      "topics": "2",
      "followers": "58",
      "following": "35"
    }
  },
  "2573947": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "halfsmore",
    "game_title": "Rooting For You",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 12,
    "comments_raw": [
      "Very touching little tale. Nice way to take a calming, methodical puzzle game into a narrative.",
      "A very touching tale! I also appreciate that you recognized those of us who maybe didnâ\u0080\u0099t have the patience to get through all puzzles (definitely not me tho, ofc) by having the skip to next option, really helped to ensure I experienced the full extent of the story. Too bad about the bug, but having the gif there was a reasonable solution.",
      "Love the puzzels! Took me a second to understand what to do but when I understood, it was a fun game and good story as well!",
      "really nice story, great job :)",
      "Amazing work with this!The art, the colours, the cutscenes, the SFX and music! But most importantly the puzzle aspects and your choice to allow people to skip or retry. Genius way to not create any walls for players to be frustrated, rather, allowing us to move at our own pace and experience the story, or try to do better in another puzzle. Amazing work with the mechanics in the puzzles btw, felt so smart when I managed to git all the water in some (few) levels.PS: this game made me thirsty now.",
      "The puzzle gameplay is really good. It made me feel so clever. At first I didnt understand how it worked, but once I got the realised it, were puzzles a lot of fun.",
      "I love the puzzle aspect of this game, really well done and I like how the story worked well with it. Well done!",
      "Really cute little story, the ending cutscene is beautiful. I must say you once again made me sad (but this time I expected it).",
      "it is so impressive how little pixels you really need to create a rich and atmospheric story!",
      "This was really good!  Clear story, simple but fun gameplay.  Great job!",
      "the puzzles were really fun to solve and the story was told very well :)",
      "The story unfolds really well through the cutscenes between levels and seeing someone caring for the plant initially, followed by a gradual decline adds a powerful layer to the gameplay. I think the game cleverly blends strategy with narrative and I really liked the later levels with the added obstacles"
    ],
    "comments_posted": 18,
    "created_at": "2024-03-13 22:36:40",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2573947",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/halfsmore",
      "member_since": "01 August 2022",
      "posts": "83",
      "topics": null,
      "followers": "5",
      "following": null
    }
  },
  "2581973": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "14rry",
    "game_title": "Santa Lucia",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 9,
    "comments_raw": [
      "Hey I couldn't rate this one because I think I have a bug on my machine? The screen scrolls down to the view of the kids lined up in front of the merry go round, but the arrow keys and Z don't do anything for me. Am I missing something? (I'm on Chrome on a mac, which sometimes has weirdness.) I'll try another browser and let you know. But please reply if I'm just missing something. :D",
      "This is awesome! At first I was very confused, but the story deleoped very well. At the end at the coffe machine I thought, wait a minute, its just the old carousal again :) And then the music started and the world started to fade away. Very good entry, Great Job!",
      "Neat entry! It all lined up well. It was definitely good you had the mechanical mini game show up after the second round as I otherwise might have missed it. In fact, there were several points where I thought that was â\u0080\u009cgoing to be itâ\u0080\u009d but then there was a little more. Got a chuckle when the big-time exec came offering money haha",
      "Omg! this game is gem... It has a soul :)",
      "I liked all the different modes you put in here, this is a really fun game and I like the story as well.",
      "Super fun game! I like how the gameplay is really integrated with the story. It gets a little repetitive after a bit, but not egregiously so. The art and music were super fun and really helped to sell the mood. Well done!",
      "Good job I think I finished it, great design, music and art on top of really good story telling - well done!",
      "Really impressed with how you told a story mostly through gameplay!  This one of my favorites so far!  The art, music, gameplay, and story all went together really well.",
      "Collecting the customers' money and avoiding their rubbish was good fun and I like the look of the game, itâ\u0080\u0099s very lighthearted and fun. Also, the part where you go under the ride was a delightful and unexpected surprise and adds good variety to the gameloop"
    ],
    "comments_posted": 0,
    "created_at": "2024-03-13 18:24:24",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2581973",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/14rry",
      "member_since": "19 February 2022",
      "posts": "236",
      "topics": null,
      "followers": "10",
      "following": "19"
    }
  },
  "2582818": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "hermes3d",
    "game_title": "Save the Queen",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 9,
    "comments_raw": [
      "Great start with a compelling look and feel! A lot of us had a hard time finishing this round. I sure did! Kudos for getting something submitted, and I hope you make it to the next round!",
      "The daemon carrying the queen away at the start really sets a tone for the game. Plus, the music is epic, it definitely builds anticipation for something big to come. I really like the 3D artwork, the knight looks cool and it's great that you have to give him a sword. It'd be interesting to see where this all goes and I think what you've got so far has grabbed my interest for sure",
      "Help LordHermes!Tried to find princess fell to the underworld (no princess)",
      "Really cool details on the main menu scene. I like the slow buildup, it sets the mood for the game. During the walk, the player can admire the cave's size. The music also fits very well here and makes the situation more dramatic. It's unfortunate that there is nothing more, because the intro made me feel like I am ready to fight the monster.",
      "cool intro cutscene, shame u ran out of time",
      "Love the continued use of the lowpoly art style, Iâ\u0080\u0099m always a fan! The presentation in the intro cinematic worked really well, on the nose but totally clear.",
      "The art style is really enjoyable, the style fits well with the story but I do wish there was more to the game.",
      "You've created a big world and it definitely has a potential of a much bigger game. I dig the art style as well :)",
      "Really loved seeing this art style again!  Sorry you ran out of time, but I liked what you had!"
    ],
    "comments_posted": 18,
    "created_at": "2024-03-14 05:06:16",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2582818",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hermes3d",
      "member_since": "14 February 2021",
      "posts": "178",
      "topics": null,
      "followers": "16",
      "following": "43"
    }
  },
  "2583284": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "h4zm4tt",
    "game_title": "Sir Spectacles!",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 15,
    "comments_raw": [
      "Really cool how you tied everything together for the story. (I'm a bit jealous of you creating one continuous game, I think I will do the same thing next year)",
      "Nice work tying in prior rounds into a story, fun intro. I didnâ\u0080\u0099t realize I was traveling around in a bush at the start, I thought I was disguised as a boulder, a bush makes much more sense haha",
      "Yay! It's cool to start to flesh out the back story, and huge kudos for getting a complete game done even though your Discord posts made it sound like you had to do a mad push at the end. I really enjoyed the stealth gameplay. Simple but a little challenging at first. As always the old timey atmosphere adds a lot to the story. One nit for me was that moving could also work with arrow keys, (Not that WASD is hard or anything, but for whatever reason I tried the arrow keys first.)",
      "Happy to have the origin story of Sir Spectacles !",
      "Nice to see your story continue though I guess it was more of a prequal, I really liked the hiding in the bush and it was fun to end with your round one entry battle.",
      "Will Sir Spectacle make it to the next level??? Tune into next weeks episode!! lol Love the game and the story was easy to follow!",
      "Back into the spectaverse! The music never gets old!",
      "Wow the prequel we've all been waiting for! Well done, this is a fun story to play through.",
      "More of sir spectacles is always fun! The gameplay was fun and the art style was very well executed. Great job!",
      "It's a neat idea to do a prequel to Sir Spectacles' story in this round, I enjoyed it! The gameplay is fun, I really love the bush sneaking mechanic. The retro style is as always on point. Very well done, especially considering your situation!",
      "",
      "awesome to see sir spectacles continued for each round, great job!",
      "love getting to know mr spectacles backstory and what led up to what happens in your round one submission :D great game :)",
      "I like how you integrated the boss fight from Round 1 into the story. Overally a clear story with undelining gameplay. Even though you only had a couple of days, its still good :)",
      "Loving the prequel youâ\u0080\u0099ve made and itâ\u0080\u0099s great to see you continuing to build out this charming world. The environment and moving with the bush to stay hidden looked great and fitted the theme of Sir Spectacles character really well"
    ],
    "comments_posted": 20,
    "created_at": "2024-03-14 06:43:55",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2583284",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "224",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "2578094": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "loten",
    "game_title": "The Anomaly",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 11,
    "comments_raw": [
      "Super cool entry. One of my favorites so far. The lighting and sound effects and scene decoration really adds a sense of dread and discomfort, which I think is what you were going for.",
      "Pretty short, but very unique entry! The way the environment conveys the story as player walks through each room is amazing and really sets up the mood. I was sure I was playing a horror game and waited for the moment to hide in one of the spots. Very neat idea for a story with a plot twist!",
      "Wow really good visual story telling loved it real aliens vibes.",
      "Nice entry, I love how it really pulls the carpet under us. I was hiding in all the little containers and spaces you establish, when I should have been hiding from myself! The details of blood trails really helped throw me off and fret over what was going to be on the other side of each door.",
      "That plot twist... wow! What a great game! I was on edge waiting to enter a room and have to use the hiding options, turns out I never needed them haha. Great game and story!!",
      "Loten's back with another take all my stars entry haha.  Dude both this year and last I feel like you do horror so well.  Based on your space deck builder last year I went in expecting something Cobalt Core but the realization that it was a space horror story was very satisfying.  Having things to hide in built the tension really well.  Great job!  You told a very compelling story with minimal cutscene, mostly just through environment and gameplay.  Really killed it for this round.  Only complaint is I wish there was more of it!",
      "A great engaging story! Loved the twist at the end.",
      "I see at the comments I was not the only one fooled with your story!",
      "The plot twist at the end is really good. Really ties the story together. The enviroment was a bit empty, but the hiding spots sold the story good. Overall a great entry",
      "The atmosphere was very well done and it definitely adds to the suspense. The hiding spots really made me thinkIwas running from something, before I started seeing people and wondering what the real threat was. I love the detail and the sound design was very good too. Overall, great job.",
      "The atmosphere on the spacecraft is incredible and really suspenseful. The hiding spots and seeing how the other people reacted was amazing and then that twist at the end, really well done. Also, the art is fantastic and I like all of the details like the blood trails and the way the light revealed what was in the room. Excellent all round"
    ],
    "comments_posted": 9,
    "created_at": "2024-03-14 00:13:24",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2578094",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "169",
      "topics": null,
      "followers": "16",
      "following": "6"
    }
  },
  "2561666": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "evengy",
    "game_title": "The Hunt",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 14,
    "comments_received": 12,
    "comments_raw": [
      "You put a lot of effort in the visuals, it definitely paid off, everything looks great â­\u0090",
      "Simple, but very fun entry. To be honest, it took me like 10 times playing before I realized the intro â\u0080\u009ctutorialâ\u0080\u009d sequence it was annoyingly making me replay each time wasactuallya selection screen. Once I got that, I was able to strategize much easier to get the â\u0080\u009cperfect loadoutâ\u0080\u009d. That got me to 60pts so, Iâ\u0080\u0099ll take 3rd on the leaderboard for now hehe but Iâ\u0080\u0099m pretty deterred from playing more since I have to spend a couple minutes just trying to get my ideal loadout (ie the cheaty sort of setup of [spoiler?] only selecting animals which are non solid so that I donâ\u0080\u0099t have to really look at the shape or listen to the sound)",
      "Very nice concept that fits the challenge. Lovely graphics and lots of polish. It would be nice for the hunt picture to stay on screen a bit longer, at least at first, and maybe consider a \"learning\" level that has fewer kinds of animals. But overall nice work!",
      "Really fun game! Took me a second to realize I had to avoid the stories that I didn't experience to not get hurt!",
      "pesky crocodiles and cheatas always jumping on my spear!",
      "Very original idea for the gameplay and it really fits the task, because I feel like I am actually a caveman creating a story and documenting it with pictures in my cave. At first I thought I will have a hard time understanding the gameplay, but thanks to all the visual feedback and game juice I got it very quickly and started having fun. The graphics are beautiful, with the fire and stone wall looking great. One of the best entries this round, in my opinion.",
      "super cool idea, like the cave art aesthetic!i suck at it tho, having trouble telling the animals apart",
      "Loved the look of the game and the theme. I like how the first bit is setting up the story and the second part is making sure you follow the story. Great game.",
      "I feel like you did a lot with a simple story here.  The environment and cave drawings looked great, and the game was really self explanatory.  Great job with this!",
      "This game is a lot of fun. Swiping at the flying animals is really satisfying, and I love that I can pick the challenge at the start. The background and sounds are also great - everything feels really polished",
      "Super fun and polished, I love how juicy it is. The game has a really great mood, with the fire and the music. Enjoyed this a lot. Iwillcome back to this and conquer the leaderboard. This I swear.",
      "Fun game, I really enjoyed playing and went for the high score. The cave, paintings and fire really set the mood for this game.  Great job."
    ],
    "comments_posted": 7,
    "created_at": "2024-03-10 04:16:02",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2561666",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/evengy",
      "member_since": "15 April 2021",
      "posts": "53",
      "topics": null,
      "followers": "23",
      "following": "2"
    }
  },
  "2582868": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "malek-elsady",
    "game_title": "User + Interface",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "I had a lot of trouble completing the level with the moving light but eventually managed to get it ð\u009f\u0092ª",
      "Super cute sprites and animations. I liked the mechanic of the lighting making the platforming more challenging. Glad you were able to get something submitted! Hope to see you in the next round. :D",
      "Love the idea, the game is really nice to play. Congrats !",
      "There was definitely a story of heart and key! Though Iâ\u0080\u0099m not sure what it was, I guess from context itâ\u0080\u0099s a love of the different user interface elements? Was a little bit abstract and wouldnâ\u0080\u0099t say the gameplay itself necessarilyoverlyreinforced that, but still a cute idea and having the UI elements exhibit ranges of emotions over the course of the game was a nice touch. Fun variety of levels which broke the 4th wall in some good ways and a lot of mechanics introduced, nice!",
      "You realllly love making games with multiple levels!! Really enjoyed the story and game play, what a great game!!",
      "The story and the game in this were both great. The story was engaging and the game was just enough to keep me going.",
      "The storytelling is really good, I had to play it twice, because I found out how to walljump and fell out of the level once. Couldnt restart the level, so had to restart the game. But that wasnt a problem, because the story it told so good, I do like, how the level difficulty suddenly gets way harder, to underline the story.  Great entry.",
      "That's a very original concept for a story game. And even though I didn't understand some plot points, I think got the overall idea. I like the U+I letters at the end, but I am not sure if that fits this task. The amount of levels is impressive and I like how every level was different (the dark level was very hard, though!). All the art and animations are very pretty. Well done!",
      "I know on the discord you were saying story telling is hard and you didn't feel super confident about your entry, but honestly I think this tells a solid story really well!  One of my favorite entries of the jam and one of my few full five stars!",
      "",
      "Usually making the UI work is my least favorite part of a game, but you seem to have done it well (:",
      "never have i felt so invested in UI before, great little story and fun concept",
      "Iâ\u0080\u0099m impressed with how many levels there are and I especially liked the later levels with the spikes but the true star of the show was the ending. The way the letters come together was a nice touch and a really satisfying way to conclude the game"
    ],
    "comments_posted": 5,
    "created_at": "2024-03-14 03:05:22",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2582868",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,039",
      "topics": "14",
      "followers": "47",
      "following": "53"
    }
  },
  "2570070": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "joszs",
    "game_title": "📜",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "Ok this is just EXCELLENT ! Everything is well made and the idea is really cool and original. Congrats !",
      "Yup, this was the only entry Iâ\u0080\u0099ve so-far give 5-stars all down the board (sorry for any spoilers on my ratings for anyone else XD).",
      "All 5 stars! Yup, that's a dang fine game. I also missed the sword and got frustrated, but happily the comments below helped me figure it out. Huge plus for me with the clever name of the game, etc. Clever clever.",
      "Well there goes all 5 stars my friend! This was a great game that you can follow the story easily and the environment was fun to go through! Good job!",
      "So cool what you've made! It fits your style perfectly and the game has such a nice depth to it!I especially enjoyed how you changed even the description and your own links to this _______ ______ _______ format. Genius idea, amazing game!",
      "I really like this game playing inside the story. No notes, really well done.",
      "The story is really enjoyable and well explained, so it is pretty clear. I love the gameplay, it's very original and fun, I like how every item had a different use. And the bossfight is very well designed, incorporating all the mechanics learned in the levels. The artstyle is really nice, I like how the whole game takes place on a scroll. Great entry, it fits the task perfectly!",
      "Super fun and cute little game! I love the art and the overall aesthetic. I missed the sword the first time through and it took me a minute before I went back to grab it, maybe some effect or sign to let the player know they need to get it would be nice. Otherwise, great level design and good job overall!",
      "",
      "Super solid entry!  I like that the story itself was the level.  It worked out really well.  I did get a little confused with realizing I could actually go pick up the sword but I feel like it wasn't too bad to figure out.  Great job!",
      "I had a good time completing the game and uncovering the story as I progressed. The gameplay is great and the game intuitively communicates what to do without any instructions anywhere, a truly impressive feat",
      "I absolutely love the way you dismissed all the language from your submission. Title, the font on the submission page, even for pronouns ð\u009f\u0098\u0082And still kept it so clear and enjoyable.",
      "Such an enjoyable experience! well done"
    ],
    "comments_posted": 6,
    "created_at": "2024-03-11 11:52:56",
    "game_url": "https://itch.io/jam/gdko-2024-round-3/rate/2570070",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/joszs",
      "member_since": "19 January 2016",
      "posts": "52",
      "topics": null,
      "followers": "98",
      "following": "17"
    }
  }
}