{
  "2069683": {
    "overal_rating": [
      "Score*",
      "4.444",
      "4.222",
      "4.022",
      "3.667",
      "3.667",
      "4.111"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.444",
      "4.222",
      "4.022",
      "3.667",
      "3.667",
      "4.111"
    ],
    "participant": "gamefavorites",
    "game_title": "Bubble Droppers",
    "platforms": [
      "web"
    ],
    "rating_count": 9,
    "comments_received": 6,
    "comments_raw": [
      "Simple idea and execution, but extremely fun! Played until I topped the leaderboard and then played some more! One of my favorites this round! Great work!",
      "Good good, decently fun dodger game, I feel like the gravity and physics could be better refined, but you did an excellent job.",
      "I really like bullet hells and you nailed the barely avoided feel of that type of game! I played it for a while and am currently at the top of the leader board :) great entry!",
      "",
      "Very fun and original!",
      "Very cool! I think this is a great game! simple but fun mechanics with having to balance dodging with aiming for the next ball, it adds a lot of strategy and moment by moment decision making which is really nice!"
    ],
    "comments_posted": 9,
    "created_at": "2023-05-14 19:18:45",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2069683",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "820",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "2070126": {
    "overal_rating": [
      "Score*",
      "4.333",
      "4.444",
      "3.800",
      "3.556",
      "3.333",
      "3.333"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.333",
      "4.444",
      "3.800",
      "3.556",
      "3.333",
      "3.333"
    ],
    "participant": "crayonmelon",
    "game_title": "Car Vs Frog",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 9,
    "comments_received": 8,
    "comments_raw": [
      "My favorite game of this round! knocked it out the park!",
      "Pretty cute, car mode was quite fun, controls are interesting and make for some silly moments. Frog mode just felt like I had to make the cars go in wheelies and abuse the fact they have slow acceleration to survive forever. Either way it was pretty funny with the animations and commentary.",
      "loved the commentary! the game was really fun but the frogs were so hard to run over while drifting but its probably just me being bad at games lol, great entry!",
      "Good atmosphere, the 2 player was great fun but I feel the frog had the advantage over the car. Definitely original and definitely a lot of fun on all modes",
      "The commentary really made this game. It was fun, silly and seemed so genuine at times. Feels like most of the games could have benefited from some commentary, I will have to keep this in mind for future jams. Overall, I really enjoyed murdering frogs, great job.",
      "Great commentary! The little frogs scurrying away from my mighty Ford Focus had me dying. What a treat to play! Great work!",
      "Came for the frogs, stayed for the commentary! Really sales the whole competition vibe",
      "Hilarious commentary! It's about time we saw something done about the frogs"
    ],
    "comments_posted": 2,
    "created_at": "2023-05-14 22:47:27",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2070126",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crayonmelon",
      "member_since": "22 May 2019",
      "posts": "190",
      "topics": "1",
      "followers": "61",
      "following": "13"
    }
  },
  "2069931": {
    "overal_rating": [
      "Score*",
      "3.667",
      "3.556",
      "4.222",
      "3.333",
      "3.778",
      "3.444"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.667",
      "3.556",
      "4.222",
      "3.333",
      "3.778",
      "3.444"
    ],
    "participant": "simoncb",
    "game_title": "Chainsaw Boat Cookery",
    "platforms": [
      "web"
    ],
    "rating_count": 9,
    "comments_received": 7,
    "comments_raw": [
      "Super fun! My only complaint is that my small brain couldn't remember which ingredients to take and which to leave, so I just grabbed all the ones I came across. Nice work!",
      "Great fun, decently silly, I'll always have a soft spot for that duck, I hope he gets one more for the epic 5 parter.",
      "Great fun from start to finish, I really like the creativity and its awesome to see more duck on wheels",
      "slightly confused on what is happening but the game is really fun lol, I managed to get the gold cup on my second run as well, great entry!",
      "",
      "I... shall not question your taste in sandwich ingredients.",
      "The duck on wheels aesthetic doesn't disappoint! One day people will be making Duck-On-Wheels-Likes!"
    ],
    "comments_posted": 1,
    "created_at": "2023-05-14 20:54:20",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2069931",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/simoncb",
      "member_since": "08 April 2015",
      "posts": "80",
      "topics": "1",
      "followers": "8",
      "following": "8"
    }
  },
  "2068748": {
    "overal_rating": [
      "Score*",
      "4.133",
      "4.333",
      "4.444",
      "4.000",
      "3.889",
      "4.000"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.133",
      "4.333",
      "4.444",
      "4.000",
      "3.889",
      "4.000"
    ],
    "participant": "loten",
    "game_title": "Creepy Crawly Crush Olympics",
    "platforms": [
      "web"
    ],
    "rating_count": 9,
    "comments_received": 8,
    "comments_raw": [
      "Really good stuff, great improvements, I'll always prefer the OG crush, but the additions make this into a bigger game and I love all the leaderboards now! Also naked xander is based.",
      "Really cool improvement on the round 4 version and youve basically made a bunch of sports not just 1 lol, very impressive",
      "This mf made an entire Olympic event",
      "Really enjoyed playing all of the different sport events. I think classic crush and the long bounce were my favourites but all were really fantastic and I like the new additions like the screen wrap and enemies you've made to the classic version. The three characters are awesome too and the xander one had me in stitches",
      "basically just alot more creepy crawly crush and alot more leaderboards to be at the top of lol",
      "WOW! I really loved that! Each game was so varied and it felt a lot nicer to control than last round. Brilliant games with a simple and easy mechanic that's gone a long way",
      "Super cool to see your awesome entry from the last round come back bigger and better! I liked trying out all the new game modes. Queen Kill is probably my favorite, even if I'm terrible at it. Great work!",
      "Xander is not gonna be happy ð\u009f\u0092\u0080"
    ],
    "comments_posted": 9,
    "created_at": "2023-05-14 11:17:06",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2068748",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "169",
      "topics": null,
      "followers": "16",
      "following": "6"
    }
  },
  "2070157": {
    "overal_rating": [
      "Score*",
      "4.007",
      "3.182",
      "2.711",
      "2.946",
      "3.064",
      "2.475"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.250",
      "3.375",
      "2.875",
      "3.125",
      "3.250",
      "2.625"
    ],
    "participant": "spacespy",
    "game_title": "Simon Ball",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 8,
    "comments_received": 8,
    "comments_raw": [
      "Updated.",
      "Interesting idea! Getting the balls to go where you want them to feels inconsistent, but I'm sure it gets easier with more practice. Great polish and great work!",
      "pretty fun! took me a couple minutes of raging to figure out how the batting system worked but after i did i managed to get a score of 41!if anyone tries to beat my score i will be back o_o",
      "The game looks great and the colour use made it quick to know exactly what to do, really good entry",
      "Feels very polished, great work! took quite a while to get used to the controls and it was quite difficult, never felt unfair tho",
      "",
      "Loved the arrows on the balls for accessibility!",
      "Really nice effects! I really like the idea of the game too. Found it difficult to control but the pattern of where the ball was being hit felt consistent and probably just needs a lot of practice! You made it look easy in your vids! Great job! (Score: 39)"
    ],
    "comments_posted": 9,
    "created_at": "2023-05-14 22:50:40",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2070157",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spacespy",
      "member_since": "06 June 2020",
      "posts": "479",
      "topics": "7",
      "followers": "129",
      "following": "141"
    }
  },
  "2070052": {
    "overal_rating": [
      "Score*",
      "3.556",
      "3.889",
      "2.778",
      "2.444",
      "2.333",
      "3.000"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.556",
      "3.889",
      "2.778",
      "2.444",
      "2.333",
      "3.000"
    ],
    "participant": "nutt3d",
    "game_title": "Spearfall",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 9,
    "comments_received": 6,
    "comments_raw": [
      "Pretty good, I feel like it was a huge lore dump only to be revealed with a basic \"time the meter\" game with no change in gameplay, just the same thing over and over, didn't really stimulate my braincells alas, art was quite nice though, so was the idea.",
      "this game called me pathetic. 10/10",
      "The game feel, polish, sounds and artwork are all great and I played to the end because I liked to see what boss I'd face next. Throwing the spear upwards is a great idea but I think there could have been more added to make the spear more fun like clicking on bombs to boost the height, it's still pretty good though",
      "pretty fun for what you were able to make in the time you had! as usual the art is amazing and so was the polish, but i just wish the game had a bit more depth, other than that nice entry and the gods do be cruel",
      "",
      "Nice lore and solemn dramatic music! I felt leaderboard was superfluous as there is no  variation in scoring, (everyone who defeated last boss got the same score), great art and story idea though"
    ],
    "comments_posted": 7,
    "created_at": "2023-05-14 22:19:09",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2070052",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nutt3d",
      "member_since": "07 August 2022",
      "posts": "606",
      "topics": null,
      "followers": "51",
      "following": "3"
    }
  },
  "2068589": {
    "overal_rating": [
      "Score*",
      "4.125",
      "3.771",
      "3.653",
      "3.536",
      "3.512",
      "2.475"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.375",
      "4.000",
      "3.875",
      "3.750",
      "3.725",
      "2.625"
    ],
    "participant": "unburntstudios",
    "game_title": "T I L E B A L L: Championship",
    "platforms": [
      "web"
    ],
    "rating_count": 8,
    "comments_received": 6,
    "comments_raw": [
      "Very nice! Super easy to pick up and play, excellent gameplay loop, and fun sound effects! Great work!",
      "Really fun lil strategy game, you knocked it out of the park with the art department, and the gameplay had me thinking.",
      "really fun once you learned the rules and had quite some fun planning out my moves to capture as many pieces in one turn!",
      "I struggled on my first playthrough but I got a lot better the second time around. The game is very original in my opinion and I like that you have to use a bit of strategy to win",
      "Probably needs some form of tutorial, was quite hard to figure the rules out. Quite fun once i did tho!dk if im just missing something but didnt know how to pass, couldnt place my shooter and got seemingly softlocked",
      "I have to admit, I was a little intimidated at first by all the rules but, once I got going, this was a lot of fun."
    ],
    "comments_posted": 9,
    "created_at": "2023-05-14 03:03:18",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2068589",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/unburntstudios",
      "member_since": "27 February 2021",
      "posts": "223",
      "topics": null,
      "followers": "8",
      "following": "2"
    }
  },
  "2058539": {
    "overal_rating": [
      "Score*",
      "3.536",
      "3.536",
      "4.007",
      "3.536",
      "3.371",
      "2.239"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.750",
      "3.750",
      "4.250",
      "3.750",
      "3.575",
      "2.375"
    ],
    "participant": "sijilum",
    "game_title": "Targetball",
    "platforms": [
      "web"
    ],
    "rating_count": 8,
    "comments_received": 5,
    "comments_raw": [
      "loved the fast paced nature of the game! i always had to keep moving and had no time to stop otherwise i would lose time which made the game feel frantic in a good way! i did sometimes get confused on where i was looking but other than that it was great! also i have no idea how some people managed to get over 7000 when i can barely get over 2000 lol",
      "Ah sijil my beloved, brilliant showing, very big for experimenting with 3D such late into the competition, and you did it quite well, I've always loved shooting galleries and you've managed that perfectly. gratz.",
      "I like that there's different routes that can be taken and it's great fun hitting the targets",
      "",
      "Fun physics and interesting idea of combining it with a treasure hunt sort of feel to find the targets"
    ],
    "comments_posted": 3,
    "created_at": "2023-05-13 00:23:29",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2058539",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "119",
      "topics": null,
      "followers": "37",
      "following": "10"
    }
  },
  "2070012": {
    "overal_rating": [
      "Score*",
      "4.333",
      "3.222",
      "3.222",
      "3.244",
      "2.778",
      "2.667"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.333",
      "3.222",
      "3.222",
      "3.244",
      "2.778",
      "2.667"
    ],
    "participant": "lio-lim",
    "game_title": "Unfit",
    "platforms": [
      "web"
    ],
    "rating_count": 9,
    "comments_received": 5,
    "comments_raw": [
      "controls were pretty hard but got used to it after a while, i thought the game had an ending so i kept playing until i was 10 : 1 so idk if there is an ending but from what i played it was fun!",
      "Difficult to control, sometimes it'd go fast when I moved the mouse back and sometimes it wouldn't, a bit annoying but the art and comedic value makes up for it.",
      "It took a while to score a goal but it felt good when I did",
      "Iâ\u0080\u0099m really having a difficult time with the controls. Best I can manage is inching myself across the field. Any tips on the movement? I really want to give this another try.",
      "Great polish on the little details and quality of life stuff! Simple and funny premise, was difficult to control, although very tactile experience"
    ],
    "comments_posted": 4,
    "created_at": "2023-05-14 21:42:19",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2070012",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "345",
      "following": "28"
    }
  },
  "2065455": {
    "overal_rating": [
      "Score*",
      "3.556",
      "3.444",
      "3.378",
      "3.222",
      "3.778",
      "2.889"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.556",
      "3.444",
      "3.378",
      "3.222",
      "3.778",
      "2.889"
    ],
    "participant": "malek-elsady",
    "game_title": "Zorble Court",
    "platforms": [
      "web"
    ],
    "rating_count": 9,
    "comments_received": 5,
    "comments_raw": [
      "Really fun, challenging, got me going, got to 1 second and got the pickup in the blink of an eye!",
      "Good sports game, I like the way the game plays and having different enemies that behave differently is great fun",
      "",
      "Really chaotic and super fun! Getting chain-stunned feels pretty bad, but that's probably just a skill issue on my part. Great music and an enjoyable gameplay loop! Nice work!",
      "SO GOOD! This is my favourite game this round! I would have liked it if hitting the ball with you back-bat also caused it to be supercharged, but amazing game. So fun and simple and cool mechanics"
    ],
    "comments_posted": 9,
    "created_at": "2023-05-14 18:44:55",
    "game_url": "https://itch.io/jam/gdko-r5/rate/2065455",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,039",
      "topics": "14",
      "followers": "47",
      "following": "53"
    }
  }
}