{
  "2463391": {
    "overal_rating": [
      "Score*",
      "4.000",
      "4.136",
      "3.927",
      "3.636",
      "4.227",
      "3.636"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "4.136",
      "3.927",
      "3.636",
      "4.227",
      "3.636"
    ],
    "participant": "cjtheegamedev",
    "game_title": "A Deadly Spectacle",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 12,
    "comments_raw": [
      "This was an incredible game! the wordle minigame sections were really good and the dialog around them was really well written. The story was also interesting and I really enjoyed the mystery element that we had to solve",
      "Wow, a murder mystery in a game jam what a feat! Really well done visual style and polish on everything, very impressive overall! The story was fantastic as well, it definitely took me a while for the solution to click but it all made sense it the end. Very good job!",
      "This was a really fun game, and the Brainblast was great! Everything fit together really well and the story was entertaining.",
      "Nice job! the animations are great and I like the puzzles!",
      "I really liked the dialogue and the artwork. The brainblast puzzles are good and I like the build up to them but I wish there were a few more attempts, appreciate you putting the answers in the description page",
      "Brainblastttt got only on correct without help!!!!!!\nreally good experience with good music and good user engagementâ\u0080¦.\nLoved it!",
      "I really loved the game, and the visuals are spectacular, and btw when I read this line:",
      "Wow, you really put a lot of work into the story. We should watch out for you in the story round. Overall, the art looked great and nailed the theme.  I never played wordle before, but I really enjoyed it as minigame.",
      "Great game you've made! Never played many detective games, so was really appreciative of all the hints!",
      "GREAT ART!  The music and aesthetic were great touches.  Using wordle as a minigame was a really good idea, too.  My only comment would be to speed up the dialogue a bit.  Sometimes it felt like it was dragging on a little without adding more to the story.  Overall, really great entry!",
      "Pretty nice mystery game, with a cool overall storyline. The wordle minigame was a nice change of pace too, I just wish there was more guesses before losing it. Great entry!",
      "I always really enjoy your GDKO entries, and this certainly did not disappoint. The atmosphere of the game was great, and the art was really cohesive. I also really loved the squares and the splat transitions. I think you implemented the Theme and Modifier in a really unique way. I would love to see this expanded further in the future, I really enjoyed this game! I kept getting the wrong answers but I finally got there in the end lol"
    ],
    "comments_posted": 13,
    "created_at": "2024-01-14 04:07:25",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2463391",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/cjtheegamedev",
      "member_since": "03 November 2022",
      "posts": "59",
      "topics": null,
      "followers": "10",
      "following": "35"
    }
  },
  "2470775": {
    "overal_rating": [
      "Score*",
      "4.235",
      "3.353",
      "3.494",
      "3.824",
      "3.000",
      "3.059"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.235",
      "3.353",
      "3.494",
      "3.824",
      "3.000",
      "3.059"
    ],
    "participant": "keltfire",
    "game_title": "A Humble Ant",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 9,
    "comments_raw": [
      "Love the concept of this one, really creative idea and well executed aswell :)",
      "This is a really creative spin on the jam. I enjoyed my time with Billy, because he could only complain about me moving to much :D",
      "This is SUCH a clever and funny interpretation of the theme. 5 stars for me!  I think for a future version, maybe some more work on the animation of the ant character, like animate the head a little separate as its own sprite to add some jauntiness? And it would be fun to experiment with adding some cartoony expressions of the ant looking scared and surprised? Overall, really solid implementation of a great core idea.",
      "Genius application of the theme! Right in the Toy Story childhood!",
      "I love ants! Great work with this game, it was fun.",
      "Nice idea and cool game ! I didn't find a proper strategy to outspeed the kid. Good job !",
      "The way you used the spectacles in this game is awesome. It's a fun game and I like how the ant carries the food on its back. The art is great too. Some things that could be added in the future is the art for the ant's diagonal directions, maybe some fire when Billy gets you and maybe making some types of food take longer to pick up or slower to walk with but overall, this is really excellent and I can see this doing well this round",
      "Nice game. i liked the twist which i did not see coming! the game felt cohesive and music was fitting! great job",
      "The music and visuals worked together so well!  And playing this really made me smile.  Your use of spectacle and minute with both very clear as well."
    ],
    "comments_posted": 22,
    "created_at": "2024-01-14 23:00:14",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470775",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/keltfire",
      "member_since": "13 June 2020",
      "posts": "312",
      "topics": null,
      "followers": "12",
      "following": "3"
    }
  },
  "2459415": {
    "overal_rating": [
      "Score*",
      "4.318",
      "4.282",
      "4.364",
      "4.318",
      "4.000",
      "4.409"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.318",
      "4.282",
      "4.364",
      "4.318",
      "4.000",
      "4.409"
    ],
    "participant": "q34dev",
    "game_title": "Art of Web",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 14,
    "comments_raw": [
      "Very smart game ! At first i though it would be too easy but after understanding the restriction become really challenging. Awesome entry !",
      "What an incredibly clever puzzle game! My original concept was a line drawing puzzle game but I just couldn't figure out a way to make it fun enough. You've got that in spades. The VFX are especially fantastic and add so much to the game feel.",
      "5 stars for theme! Thought the game hit both targets perfectly. Mad props for drawing the art yourself! That's a lot of work and everything held together for me. Couple of specific suggestions from me for future versions: 1) it would be really cool to experiment with a time pressure mechanic, or maybe a speedrun mode where you try to get the most puzzles done on a leader board. 2) You should look into custom CSS for your game pages! With your illustration skills you could add a lot of polish! Nice work!",
      "Cute game! You're a spider trying to draw a web between points to replicate an image, as cute bugs watch your journey. It's also challenging, as some of the nodes are placed there just to trick you and aren't a part of the final image, and also that you can't complete the same line twice, so you really have to be careful with your decisions. Plus, how could anyonenotlove this game with how cute the spider guy looks?",
      "This turned out to be a spectacular puzzle game, no pun intended",
      "I really liked this puzzle game. What a great idea.",
      "This was incredible.  Really relaxing game with great art.  I could absolutely see this as a successful mobile game!",
      "",
      "This was a lot of fun with some nice polish. really enjoyed this one :)",
      "Really great! I love the spider web particle effects.",
      "I think the art style is fantastic and it's such a fun puzzle",
      "Fun game, lots of polish and nice visuals.  The scene transition animation looks great.",
      "Wow! really great entry. super fun and i really enjoyed the gameplay! I started drawing my own design in the final level since there was so many dots and it made me think level editors would be cool for this game! really well done!",
      "This entire experience was great, very chill game and nice twist on the drawing puzzles by using a jumping spider. The audience at the front was also a nice touch, cool entry!"
    ],
    "comments_posted": 27,
    "created_at": "2024-01-12 19:59:53",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2459415",
    "coolness": 27,
    "participant_info": {
      "profile_url": "https://itch.io/profile/q34dev",
      "member_since": "26 January 2022",
      "posts": "311",
      "topics": null,
      "followers": "13",
      "following": "8"
    }
  },
  "2460109": {
    "overal_rating": [
      "Score*",
      "4.459",
      "3.811",
      "4.054",
      "4.135",
      "3.973",
      "3.892"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.459",
      "3.811",
      "4.054",
      "4.135",
      "3.973",
      "3.892"
    ],
    "participant": "spikestudio",
    "game_title": "Ba-Ba-Backflip",
    "platforms": [
      "web"
    ],
    "rating_count": 37,
    "comments_received": 26,
    "comments_raw": [
      "Awesome work ! You went more far than expected for round 1 ! The theme fits perfectly, I played until the end of level 3.",
      "",
      "I'm impressed with how polished this game is!Fun game  ð\u009f\u0098\u0081",
      "A fun little ba ba backflip haha enjoyed itâ\u0080¦â\u0080¦..",
      "Took a second to get used to, but your tutorial really helped and this was super fun!  Really good job!",
      "This is super impressive! The movement feels great and there is so much polish! Awesome job :)",
      "Super polished, down to the mechanics, the animations, and even the tutorial.Can't stop playingð\u009f\u0091\u008d",
      "Everything about your game is brilliant! I can see this game doing well this round. Here is my high score:",
      "Really impressive and well polished! I have no notes of feedback, incredibly impressive and I could see this being a full release on steam",
      "Hey Spike! Great game, especially considering that you joined the game a week late. You killed it with creating a cohesive aesthetic from fonts to art to music to animations. It all flowed together really well. I was super impressed by your inclusion of a tutorial. I thought it was smart to show a successful jump and then walk you through each step of the jump. I lost a lot though so I wish there was a way to skip through it to quickly get back into the action. Overall very cool. I could totally see this in like a dope Mario Party type game.",
      "The art and animations are very charming and are a good match to the gameplay. Really nice!",
      "Awesome visuals, everything looks really polished. Jumping is incredibly with all the game juice.",
      "Innovative and very well executed! I can really see the skill and effort put into this game. I have my eye on you ð\u009f\u0091\u0080",
      "Really Juicy animations in this one, very nice 'jiggle' effects. Nice clean aesthetic and art style.",
      "Very addicting! and i love the cosmetics! The secret that happens when you complete all challenges is the best! 5stars all the way down from me",
      "Art style is really cool. The gameplay is really fun but hard to master. It feels unfair sometimes when landing but it also make the success more rewarding. Really fun game ! Congrats !",
      "One of the most fun games I've played in a jam, ever! And you know you're doing something right when your worst player, who could barely complete the first level, is having fun! Very cute art style and silly idea as well!",
      "Easy to learn, but hard to master. The simple mechanics and cute visuals created a nice experience.",
      "Me and this game are going to fight lol. Liking the style and the use of theme. Has the feeling of one of those games like \"Getting Over It\", where you build muscle memory and expertise. Transitions are cool and liven things up, same for the tony hawk-esque trick scoring.",
      "This is super impressive considering you joined the jam a week late! I really love the art style,  I think it fits really well with the gameplay. I was super bad at this game and couldn't get past the first hay bale, I tried for 20 minutes, still couldn't, but I really enjoyed it!!",
      "This game is insane. It doesn't even feel like a jam game It feels so complete and both and the art and the gameplay show that. They are both absolutely incredible, and the fact you made it in only a week is absolutely crazy",
      "I really love this game, maybe just remove the tutorial introductions when the player hits the 1st zone, but other than that, this is one amazing game :)",
      "This game is just so crazy complete. Most solid game design top to bottom in the jam, for me. It does take a bit to figure out, but there are a lot of gamers who love that learning curve. Nice work.",
      "Itâ\u0080\u0099s obvious how much time and effort you put into this game.\nPolish on everything, you have HATS!",
      "Fun game with an interesting mechanic.",
      "Very polished, fun game! I think my favorite thing is actually the transitions. It really adds to the polish and helps communicate the whimsy of the game."
    ],
    "comments_posted": 32,
    "created_at": "2024-01-14 10:17:53",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2460109",
    "coolness": 33,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spikestudio",
      "member_since": "29 May 2018",
      "posts": "249",
      "topics": null,
      "followers": "23",
      "following": "3"
    }
  },
  "2462968": {
    "overal_rating": [
      "Score*",
      "4.368",
      "3.737",
      "4.263",
      "3.916",
      "3.737",
      "3.474"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.368",
      "3.737",
      "4.263",
      "3.916",
      "3.737",
      "3.474"
    ],
    "participant": "halfsmore",
    "game_title": "Balancing Act",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 16,
    "comments_raw": [
      "Great entry! Really nice concept and theme implementation. Great art style and aesthetic too.",
      "Simple yet difficult, and slightly addictive. That leaderboard definitely had me trying a bunch to get higher and higher, but don't think I can beat that #1 spot.",
      "This game is kinda difficult for me, but despite that I had a lot of fun trying to get a higher score. The art is really great and the music fits very well. Awesome entry!",
      "I find this game annoyingly addictive. I keep wanting to play to go for the high score. Look great and fits the theme perfectly, great job.",
      "This is one of my favourites this round. The art is really great, I like how the shapes and weights play into the game and give different points. I like the multiplier which I assume relates to the height, the ability to rotate stuff and there's an audience meter and leaderboard. This is amazing!",
      "Really nice work, super nicely polished with addictive gameplay :)",
      "Great entry, a lot of fun.",
      "well executed! great job, very clean and well done!",
      "Great concept, well executed, good job!",
      "You really got the more is more nailed here.  Spectacle, too.  Very fun in an extremely chaotic way.  Great entry!",
      "We used the same music (but what is best for circus game ?). Game is fun, really random with the objects you can have simpler run with lots of big objets. The sprites are really cool and the overall circus ambiance is well done. Congrats !",
      "Very polished piece of work, sound and well! Leaderboard, and certainly a unique idea. My best score though was just by spamming the drop key until the inevitable elephant shows up in the room, but hey, that just makes it feel a bit more arcade-y! Unless Iâ\u0080\u0099m totally missing the skill part cuz I donâ\u0080\u0099t know how people are getting 2K and higher hah. Nice work.",
      "Loved the art style and audio design.\nSome really high scores on the board already, wonder who will have the high score by the end of the voting period :)",
      "Great sprites and lettering. I also think the stacking game is a great take on 'more is more.' The particle effect on the edge of the screen did seem a little out of place. Maybe if it was only on the bottom of the screen it would look like the audience.",
      "Fun game, I liked the elephant.",
      "Cool little arcade game! I do wish it showed the next item that is coming out, to be able to plan a little bit. The juice was all pretty nice too, everything felt smooth to use. Great entry!"
    ],
    "comments_posted": 3,
    "created_at": "2024-01-12 23:24:53",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2462968",
    "coolness": 70,
    "participant_info": {
      "profile_url": "https://itch.io/profile/halfsmore",
      "member_since": "01 August 2022",
      "posts": "61",
      "topics": null,
      "followers": "4",
      "following": "1"
    }
  },
  "2471115": {
    "overal_rating": [
      "Score*",
      "1.844",
      "1.952",
      "1.540",
      "1.302",
      "1.519",
      "1.085"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.400",
      "3.600",
      "2.840",
      "2.400",
      "2.800",
      "2.000"
    ],
    "participant": "averageronin",
    "game_title": "Balloon Boy",
    "platforms": [
      "windows"
    ],
    "rating_count": 5,
    "comments_received": 4,
    "comments_raw": [
      "Really wanted to play and rate, but wasnâ\u0080\u0099t able to get it to run :/",
      "I like the fulfilling the NPC balloon requests and the fireworks were great.",
      "Great looking fireworks!",
      "The fireworks looked great. I got a couple of balloons myself, but i didnt share it with the npcs (hehehe)"
    ],
    "comments_posted": 5,
    "created_at": "2024-01-14 23:56:40",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471115",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/averageronin",
      "member_since": "14 June 2023",
      "posts": "9",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "2469196": {
    "overal_rating": [
      "Score*",
      "3.361",
      "2.492",
      "2.731",
      "2.100",
      "2.310",
      "1.960"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "2.967",
      "3.250",
      "2.500",
      "2.750",
      "2.333"
    ],
    "participant": "samagana",
    "game_title": "Blitz Bash",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 4,
    "comments_raw": [
      "I was lost with the controls but the Catch match ambiance is well made. Fun concept !",
      "Good work on the art and style. I felt like the controls were a bit rough but I got used to them a bit.",
      "Went for a hard rockin', badass aesthetic...and you nailed it.  The vibe in this is spot on.",
      "Cool idea for the theme and modifier, but seems  like the art could use some more polish. The idea of viewers rating the action is great."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 00:48:31",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469196",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/samagana",
      "member_since": "21 September 2022",
      "posts": "14",
      "topics": null,
      "followers": "7",
      "following": "2"
    }
  },
  "2453881": {
    "overal_rating": [
      "Score*",
      "1.375",
      "1.558",
      "1.192",
      "1.192",
      "1.375",
      "1.338"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.143",
      "2.429",
      "1.857",
      "1.857",
      "2.143",
      "2.086"
    ],
    "participant": "vintagesalmon",
    "game_title": "Button Press",
    "platforms": [
      "windows"
    ],
    "rating_count": 7,
    "comments_received": 3,
    "comments_raw": [
      "Thereâ\u0080\u0099s some irony about half the gameplay mechanics occurring before the game itself even starts, there were lots of download/install/open link buttons I pressed along the way!",
      "It is what it is. Quite a nice button though. Some effects would be great :)",
      "Well, it's as described on the tin. Love clicking buttons. lol"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-04 01:07:35",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2453881",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/vintagesalmon",
      "member_since": "19 May 2022",
      "posts": "1",
      "topics": null,
      "followers": "2",
      "following": "1"
    }
  },
  "2469458": {
    "overal_rating": [
      "Score*",
      "4.000",
      "4.200",
      "4.200",
      "3.710",
      "3.600",
      "2.550"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "4.200",
      "4.200",
      "3.710",
      "3.600",
      "2.550"
    ],
    "participant": "zeeweasel",
    "game_title": "Cavern Spectacle",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 20,
    "comments_received": 12,
    "comments_raw": [
      "I thought the color palette and sprites were very consistent. If I had to make a vote for something to consider for future versions, it would be to spend some more time on the hero sprite and animations. But very progress for a 2 week jam!",
      "Very Fun game i would love to have it on my psp hehe!!!",
      "I really liked how destructible the terrain was! I did think the player moved a bit fast, and the camera was a bit odd, I think having it do a weighted average with the mouse position would've helped to smooth it out while helping to show what was coming up. I liked the shop system too, cool entry!",
      "Nice fast pace game. The turret are strong ! Color palette is great. Really cool entry.",
      "Love the palette and the art. The action and juice were also great. Oh, and the upgrades kept things feeling fresh. Loved this one.",
      "I like how the game gets more chaotic with each level, it is extremely fun to play after all the gun upgrades. The graphics are pretty nice too. Well done!",
      "",
      "Really enjoyed this one! The art turned out great, and the use of particles makes shooting feel fantastic. You're a bit evil with that sneaky enemy placement right by the door though, haha!",
      "Great game, lots of nice visuals and destructible objects. The limited colour pallet works well.",
      "Really fun game, totally love the amount of destruction possible and how the coins and gems roll and fall down, even the debris can be moved which is super cool. Not sure if crouch is needed in the game but it doesn't hurt having it in, I think it could be better if it was made into a cheap upgrade and using S rather than CRTL. I would prefer to jump with W rather than space and also to be able to shoot while jumping. Including more non destructible blocks like you have under the doors could be good and if they were in a different colour. Sorry if it comes across as being too critical, I really do like what you've created and think this is one of the best games in the jam, also I completed the game 2 times, it's awesome!",
      "Really Great job! That was super satisfying to play and the last level was amazing! It was a nice twist after endlessly shooting to then need to conserve my ammo to make sure platforms are available! Really enjoyable!",
      "I really liked this one!  The art was simple, but worked together really well, and there was a lot of juice.  Having trails behind bullets and enemy projectiles was a really good call to keep track of everything visually.  My only advice would be to not have the player get sucked into the doors automatically.  I can be a bummer to run into the door on accident and miss out on a lot of gems.  Great job, though!"
    ],
    "comments_posted": 3,
    "created_at": "2024-01-14 23:01:29",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469458",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zeeweasel",
      "member_since": "03 February 2015",
      "posts": "144",
      "topics": "5",
      "followers": "84",
      "following": "14"
    }
  },
  "2470505": {
    "overal_rating": [
      "Score*",
      "4.880",
      "4.800",
      "4.560",
      "4.488",
      "3.960",
      "4.240"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.880",
      "4.800",
      "4.560",
      "4.488",
      "3.960",
      "4.240"
    ],
    "participant": "lio-lim",
    "game_title": "Celestial",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 18,
    "comments_raw": [
      "I am legitimately speechless. I don't know what to say, it's just so beautiful. Enjoy the free Aseprite key!",
      "5 stars across the board for me! So polished and calming and beautiful. Among my favorites for sure.",
      "Iâ\u0080\u0099ve seen your game get recommended multiple times during the voting period, and finally I played it, it really fits the spectacle theme so well, and I love how simplistic the leaderboard isâ\u0080¦ and the difficulty is really balanced, great work :)",
      "Art >>>>\nMusic >>>>>>>\nArt + Music >>>>>>>>>>>>>>>>>>>>>>>>",
      "Such a beautiful game, absolutely incredible!!",
      "Insanely polished. Really beautiful game, just amazing.",
      "Crazy amount of polish on this. My biggest criticism would be, outside of playing in fullscreen, everything feels very small to me. It fits the vibe it felt like you were going for, but as someone with impaired vision, it was a bit hard to appreciate everything as much as I wanted to.",
      "The art and animation are really great. Good enough to be a finished game. I love how the letters fall down along with the music on the title screen. Might be interesting if there was an associated sound with pressing the key to create a call and response effect.",
      "Very relaxed and unique concept, definitely gets difficult a lot faster than I expected. The instructions could use a little bit more clarity, I didn't register right away that spacebar was being primed in the same way as the number keys, but other than that really well done!",
      "",
      "I knew I was going to like the game the moment I saw the title screen",
      "Very relaxing game, gets tough though. Great entry!",
      "Beautiful game",
      "Everything feels really polished and smooth. The atmosphere is great, the whole game is very relaxing. Love the audio. Well done!",
      "A game about polyrhythms is something I never knew I needed. I love everything about this game, brilliant execution. Used the Zen mode to help me fall asleep last night, would highly recommend :)",
      "You sir, have earned my first 5 stars across the board for the round.  Visually, musically, overall vibe, even the freaking intro screen, everything shines here.  You could publish this game.  You even managed to take really minimalist art and still have me by the end trying to keep track of a bunch of circles thinking \"yeah this is still more is more.\"",
      "It took me a while to understand what to do, but after that it became a lot more relaxing. The graphics are simple but beautiful, and the gameplay enjoyable. What really brought it together was the audio, though. Great game.",
      "Loved the style and relaxing vibes!"
    ],
    "comments_posted": 6,
    "created_at": "2024-01-14 18:02:51",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470505",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "342",
      "following": "28"
    }
  },
  "2470802": {
    "overal_rating": [
      "Score*",
      "1.844",
      "1.410",
      "1.193",
      "1.410",
      "1.519",
      "1.085"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.400",
      "2.600",
      "2.200",
      "2.600",
      "2.800",
      "2.000"
    ],
    "participant": "n3wtworldorder",
    "game_title": "Clown n' Round",
    "platforms": [
    ],
    "rating_count": 5,
    "comments_received": 3,
    "comments_raw": [
      "It's a fun idea, I wish you had more time to put into it because I think it could have been pretty good. A bit of fun regardless, which is the most important thing.",
      "I have mercy :) To be hones it was quite a spectacle seeing the car extend xDI think its litterally impossible to loose when i hold the \"ctrl\" key, because there is no obstacle high enough to get hit. *sad clown noises* The art is a bit trashy, but for 6 hours i dont mind. Also the art works overall great together, because everything is in the same style. The only thing thats not pixelated are the spikes xDPS: yes i used the GDKO Submission to rate",
      "Have mercy plz. Life happened and I ended up making this in only 6 hrs.... Honkshoo"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:58:53",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470802",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/n3wtworldorder",
      "member_since": "08 December 2020",
      "posts": "22",
      "topics": null,
      "followers": "4",
      "following": "2"
    }
  },
  "2468028": {
    "overal_rating": [
      "Score*",
      "2.521",
      "2.661",
      "2.661",
      "2.240",
      "2.394",
      "1.890"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.167",
      "3.167",
      "2.667",
      "2.850",
      "2.250"
    ],
    "participant": "bearrush",
    "game_title": "Colorfull Kills",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 12,
    "comments_received": 7,
    "comments_raw": [
      "Fun idea and smooth controls, I like the foundation you have here! Especially appreciated both the speedy pathfinding of enemies combined with the fact that they got stunned for a bit if they hit a wall, I think you nailed the balanced on difficulty with both of those factors together. I'd love to see the direction you take this in if you choose to continue working on it, I could see a lot of potential cool new mechanics added in, or maybe some interesting environmental hazards if you want to go that route instead.",
      "This is a solid entry, the music is fits the artstyle well. I like that there is a red vinginette on the screen, when the player is low on hp. I only had issues reading the score, because it quickly goes over the border of the screenThe other problems are already mentioned by other players, like the enemies being a bit to fast (or to hard to hit). Some invincibilty frames would be great aswell, because multiple enemys can hit you at once.",
      "I really like the idea, and maybe having something to work with the colours, like enemy behaviours, speed, scales, labyrinth layout etc could turn it into something  amazingâ\u0080¦ it has lots of potential for updates",
      "For being a minimalist style, the visuals on this are so good.  Really solid use of lighting.  Gonna have to study this one once I've finished rating everyone.",
      "The visuals look so good here!  Good use of light and color.",
      "This is a fun run and gun game.",
      "I like the effect when you shoot the red squares. The simple shapes, colors, and that lighting effect were all good. I think the menus and health bar could've matched the rest of the visuals a little better."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-13 08:02:18",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2468028",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bearrush",
      "member_since": "25 May 2023",
      "posts": "6",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "2464502": {
    "overal_rating": [
      "Score*",
      "4.061",
      "4.333",
      "4.079",
      "4.394",
      "3.970",
      "3.636"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.061",
      "4.333",
      "4.079",
      "4.394",
      "3.970",
      "3.636"
    ],
    "participant": "loten",
    "game_title": "Creepy Crawly Crush: Coliseum",
    "platforms": [
      "web"
    ],
    "rating_count": 33,
    "comments_received": 21,
    "comments_raw": [
      "Animations of all the bugs are so silly and adorable, really nice art, and the whole game is super easy to understand and get into",
      "The music was just perfect along with the art! Can we say an addictive game?? Had to force my self to stop to get to voting for the other games!",
      "Wow, what an amazing and addictive game! Really simple and well designed game mechanics, with an easy to understand control scheme and straightforward scoring system. I was very motivated to get on that leaderboard and managed to get the #4 spot! Don't think I can beat those elite gamers at the top 3 though.",
      "Loved playing this, I spent around half an hour trying to get onto the leaderboard, and I managed to get to 6th! The art was amazing as always, and I loved the animations and background music!",
      "I had a lot of fun playing this unique game! The art looks soo good, i love the music and the visual effects are the cherry ontop. I got it to freeze when slashing 34 monsters at once :D",
      "A unique entry out of the ones Iâ\u0080\u0099ve seen, a solid implementation of a matching game. Felt juicy indeed!",
      "My absolute favorite part is the action words when squishing a bug!! The sfx were a perfect match too! I thought the concept was really well crafted. The art, sound and gameplay all meshed very well together. Fantastic entry!!",
      "Gross! (In a good way!)",
      "This was a nice twist on a match game.  And as always your art is amazing!",
      "Very fun, juicy game. The art style fit it well! I also think you did an amazing job with your modifier. A crush style puzzle game was a great fit for spectacle, too!",
      "Amazing job! This is a great entry! I played like 10+ games before the game crashed when I squished a combo that was 80% of the screen XD Great job!! also the music is a bop I could listen to that all day",
      "Really nice art and game juice, literally.",
      "The artwork for the bugs is excellent, even for the thumbnail too. Really like what you've made and had a blast playing it",
      "Really neat, fast gameplay. I am not very good at this, but I had fun! The art and animations are awesome too!",
      "Creepy Crawly Crush returns!",
      "Ooooof you had me the second that track started playing. Its soooooo fire and sets up the chill vibes of the game so well. One of the most cohesive and polished entries I've played so far. I dont normally gravitate towards this genre but I was getting a little bit addicted because of all the positive game feedback and the chill vibes. I thought it was a really good implementation of the 2 button modifier too (and that was like the hardest one).",
      "had a BOMBASTIC-time with squishing bugs.",
      "good work !!! enjoyed squishing..\nPs i hate that fly TwT",
      "Fun bug squishing action puzzle game. I wasn't that great at it, but I'll be back once I'm done rating all the other games.",
      "This is really fun, the art looks amazing and it is very well polished. One of my favourite submissions, great job!",
      "Super satisfying gameplay, super cute art, great job :)"
    ],
    "comments_posted": 28,
    "created_at": "2024-01-13 20:32:06",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2464502",
    "coolness": 42,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "159",
      "topics": null,
      "followers": "15",
      "following": "6"
    }
  },
  "2461777": {
    "overal_rating": [
      "Score*",
      "4.633",
      "4.233",
      "4.160",
      "4.233",
      "3.767",
      "3.933"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.633",
      "4.233",
      "4.160",
      "4.233",
      "3.767",
      "3.933"
    ],
    "participant": "dev-pirates",
    "game_title": "Crunkle's Sideshow",
    "platforms": [
      "web"
    ],
    "rating_count": 30,
    "comments_received": 21,
    "comments_raw": [
      "This is exactly along the lines of what i was wanting to do!! Heck yea!! It was going to be different games but awesome job!! Loved the art and story!",
      "The art is absolutely amazing!!! Really enjoyed playing this, and it fit the theme and modifier really well.",
      "5 stars across the board! I am a sucker for GB gfx, and I found the writing to be really funny and well done. That crunkle is a cool creepy guy. Of the games that used \"spectacle\" to mean, well, a spectacle, this one comes through loud and clear. Couple of tiny nits for a future version: 1) I think the dialog should advance on any button click. (The arrow icon made me think it was the \"right\" button, but IIRC it's ENTER ... took me a second to figure out. 2) When you draw out text one character at a time, it's a nice touch to have the words at the end of the line wrap before it \"half types out\" ... haha no idea if I'm describing it right, If this one doesn't get to the next round I'll eat my fuzzy bunny slippers!",
      "Loved the artstyle, and the gameplay was really fun too",
      "The GB palette for this is incredible, and it definitely reminds me of something like WarioWare. I can't believe how much you made for only having about 1-2 hours a day to work on it!",
      "Very nice, complete game.\nYour art style is amazing. What did you use for the pixel art?",
      "The art is very well put together. I even got to live another day at the circus. At first a was a bit confused with the lion, but that didnt last long :) great entry",
      "Very well made, stunning art scheme and palette! Even the itch page with control diagrams. Each stage was nicely designed and cohesive. I survived with 13 after a few failed attempts :D",
      "The pixel art is really nice ! Some game are really hard (i don't think i fully understand the one with the lion)but i had fun. Good job !",
      "I might be showing my age, but... I grew up on the GB and I gotta say, you nailed it!",
      "I survived the show and got a score of 9. The intro and mini games were all good fun, with the knife throwing being my favourite. I think the lion taming one was good too but might be better if it was just pressing space. All the art is really well done and I like the colour palette used",
      "Fun game, good art style and the minigames were simple and understandable for the most part! Got a little confused with some, but managed to figure them out before long. Overall great work!",
      "Unfortunatelly I couldnt play your game:",
      "Wow this was great!  Loved the art and old school style.  Excellent variety of minigames that fit the theme well.",
      "Wow! Really great job, the game was clean and really well done. it reminded me of playing game and watch gallery on gba. Amazing work!",
      "Love the artwork in this. Very nice execution :)",
      "Some really great sprite work and animations, particularly in the skeleton character.  The mini-games are simple but effective.  Overall, a really nice and polished game.",
      "Amazing work Dev Pirates once again!",
      "Very funnnn game played second timeâ\u0080¦..\nI like the balloon knife game.. art is subtle and green hues makes it more fun..",
      "You nailed the retro GB art style, fantastic. Fun mini games. I would like to see more variety of games, but understand that time is limited in a jam. Overall, great entry.",
      "Wow this was a great entry! I loved the GB style and I could definitely imagine this as some twisted wario ware spin off. The gameplay was really fun, and I loved the focus on the smaller minigames. Overall, amazing entry"
    ],
    "comments_posted": 79,
    "created_at": "2024-01-09 02:42:31",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2461777",
    "coolness": 83,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "540",
      "topics": "1",
      "followers": "11",
      "following": "12"
    }
  },
  "2461739": {
    "overal_rating": [
      "Score*",
      "3.789",
      "3.895",
      "3.474",
      "3.474",
      "3.421",
      "2.789"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.789",
      "3.895",
      "3.474",
      "3.474",
      "3.421",
      "2.789"
    ],
    "participant": "maguromaniac",
    "game_title": "DJ Hibachi",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 12,
    "comments_raw": [
      "Solid look and feel! Cute animations! If I had a suggestion for future work it might be to spend some more time designing the game start screen. The title of the game could be a more themed font (it looked like a button to me.) Tiny nit: would be easier to understand if the difficultly levels were \"easy\", \"medium\", \"hard\" instead of sizes, which took me a bit to figure out.",
      "Very fun, nice work! Mechanically, I think it would be much more forgiving if you styled the â\u0080\u009cboth at onceâ\u0080\u009d spatulas different to the other spatulas, because otherwise itâ\u0080\u0099s very hard to tell looking back and forth the timing of which one of several close in a row is the double one(s). I went for the M on my first try, getting a 633, Iâ\u0080\u0099ll take the D haha. Other nitpick is the ending song fade out could be a lot faster, or you could show the results already as the song is fading out.",
      "The perfect game for a â\u0080\u009cspectacleâ\u0080\u009d with two buttons :D\nSuper fun, and loved your art style.",
      "I really liked this beat game. The art and everything fit really well together.",
      "",
      "nice entry! my biggest feedback would be to maybe start with some points to avoid instant failing. once in got the beat down it was fine but it was hard to understand the timing when i wasnt even able to play long enough to understand the timing. That being said, once i got the timing down i really enjoyed playing along to the beat! and the art is super clean!",
      "Love everything about this, maybe add some feed back for when you miss or late or are early, and maybe more animations or something maybe add food onto the grill as you get higher points?  but other then that I enjoyed it",
      "The art and UI is great and very cohesive! Quite a difficult game, but it was still super fun!",
      "Excellent art and concept.  Great job!",
      "As others have mentioned, it is a challenging game and I usually make it to the end but with a low score. I have managed to get a C once, but my best today was 204 which is a D rank . The gameplay and art are all good, but I think the speed is a little bit too fast for me to keep up with in the parts when I have to really focus on both sides at once",
      "Good implementation of the theme.",
      "Fun concept for this one! I think the difficulty could use some tuning. Even on easy, there's not much of a grace period for hitting the spatula.Art looks good, especially the cover art. Best of luck making it to the next round!"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-13 05:22:35",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2461739",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/maguromaniac",
      "member_since": "02 January 2024",
      "posts": "2",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2458513": {
    "overal_rating": [
      "Score*",
      "4.438",
      "4.175",
      "4.344",
      "4.469",
      "3.781",
      "3.844"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.438",
      "4.175",
      "4.344",
      "4.469",
      "3.781",
      "3.844"
    ],
    "participant": "14rry",
    "game_title": "Dec 31, 11:59pm",
    "platforms": [
      "web"
    ],
    "rating_count": 32,
    "comments_received": 22,
    "comments_raw": [
      "Amazing game! I loved all the little animations and particle effects, it felt really satisfying every time I went through a barrier. This is definitely going to be one of the top games of the jam. Keep up the great work in round 2!",
      "Okay, DANG that is so awesome that it works beautifully on mobile. Huge dev props from me! I played it on mobile and loved it. The super simple but super effective expressions on the character actually made me giggle. This may look like an \"easy to draw\" little pixel game on the surface, but I for one think it's a lot more subtle and intentional once you take a closer look. My only suggestion would be to spend more time putting polish into the game image (icon? splash image? I never know what that thing is called haha) and the start screen. I thought those were a little rushed looking compared to a very tuned little game. I'm a little worried that people might react negatively to pixel art in a graphic challenge... but in my opinion this game 100% deserves to advance. HEY JUDGES IF THIS ONE SOMEHOW DOESN'T MAKE IT THROUGH, GIVE IT THE WILDCARD PLEASE! :D Super great work.",
      "Loved this game simple yet very pleasing, visuals and music went hand in hand !!!\nGood work",
      "Fun game! Simple and charming, easy to controls. The only annoyance in the game is the collision, but that's a minor issue since moving it can adjust and get the player out. Good game!",
      "Really nice visuals ! Game is simple yet fun. You really nailed the juice and reward, made the game really satisfying to play. Congrats !",
      "I really loved this!  Tons of juice, solid gameplay loop, great sound effects, all around a REALLY solid entry.  Great job!",
      "Fun little game with lots of visual juice.  I like the little scene and music at the end.  Well done!",
      "Great game with a great art style. Very fun.",
      "The best spectacle of all, fireworksâ\u0080¦ YAY! :) the game is really addictive and I just wish there was some randomization or even some more levelsâ\u0080¦ I really like how progressivly more and more fireworks are being shot out and the music just ties this into a pretty awesome game",
      "The game is very polished, I'm liking the effects and those last 10 seconds really build up to the ending",
      "Super juicy with awesome visuals. Nice one :)",
      "Pretty simple gameplay, but all the visuals are incredible! The whole game feels very polished and the audio fits really well. Cool game!",
      "Such a fun experience. Made me think of a nyan cat game I used to play a lot back in the day. A perfect submission for the theme. It screamed spectacle from every fiber of its being. 10/10 job!",
      "Pyxel?! Brings me back to my Pygame days hahaha. Amazing polish, the squishing of the ball really brings it all together!",
      "Fun, made me smile at the end.  For such a simple sytle, it looks great. Pefect for the theme.",
      "Nice job. it felt really polished and fun to play. i found myself counting down outloud the last 5 seconds and i dont even do that for the real new years!",
      "The art style is so nice, and all of the particles and animations are amazing!! Such a fun game to play, challenging but not too difficult, and you implemented the theme + modifier very well! :)",
      "This is a great, juicy little game that's a ton of fun to play. Pretty challenging at the end, as well. You nailed both the theme and the modifier. Great job, and best of luck in the round!",
      "Very, very fun! Also challenging at the same time! Even though the game told me exactly how much time I had left, I still ended wanting more (In a good way of course!) This game takes a minute of gameplay and definitely makes the most of it!",
      "Really awesome job with the visuals.\nThe shader (or whatever is creating that old tube tv look) is amazing.",
      "very nice fun fun",
      "This was a really nice entry! I love the use of the theme and though simple the gameplay was pretty fun! the are was really cute and I love all the small details, like the little wind lines when the ball moves or its little squish when it lands on the platform. again super cool"
    ],
    "comments_posted": 28,
    "created_at": "2024-01-08 00:34:59",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2458513",
    "coolness": 30,
    "participant_info": {
      "profile_url": "https://itch.io/profile/14rry",
      "member_since": "19 February 2022",
      "posts": "215",
      "topics": null,
      "followers": "10",
      "following": "18"
    }
  },
  "2466035": {
    "overal_rating": [
      "Score*",
      "4.000",
      "3.542",
      "3.392",
      "3.208",
      "3.500",
      "2.708"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.542",
      "3.392",
      "3.208",
      "3.500",
      "2.708"
    ],
    "participant": "prosmashy",
    "game_title": "Demolition Derby",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 17,
    "comments_raw": [
      "Simple but fun game! I liked being able to pick your own car, and making a car game at all is a really cool way to do the two buttons modifier. the gameplay is also very satisfying because of all the sounds and effects",
      "Really fun gameplay! The visual effect when cars explode is awesome and I like that I can choose different cars. Neat game!",
      "Really fun ! A bit hard to understand how to properly hit car without losing but that part of the gameplay. The trail effect is really nice ! Good job !",
      "Ahaha smashing cars is funnnnnnnnnâ\u0080¦\nI liked it â\u0080¦ Btw what was your high score.",
      "This was fun to play., good work on this one.",
      "Fun little title - good to see a few layered mechanics like the police following. Will admit the art itself didnâ\u0080\u0099t stand out too much to me, though the design of the cars themselves were cute",
      "Fun arcade style game. i have always loved car games like this and this one felt good! I would hope to see levels or maybe upgrades in round 2. Great job!",
      "Fun little game. The red and black car is my favorite, those are my colors. Great take on the theme. Just to nitpick a little, I would not mind a quick restart and keyboard controls for selecting cars and starting the game.",
      "The car switching was an excellent touch!  And it's very satisfying to crash other cars haha.",
      "I love the ability to change the cars... i've been wanting to learn how to do that for some time!! Also the two buttons is such a good take with the game you made!!",
      "Took me a couple tries to figure out how to maneuver the car properly (I was just hanging out at the bottom of the screen previously... I don't think I've had enough coffee this morning...). Like another commenter noted, the controls are very tight and feel responsive, especially considering you can only turn. I was also reminded of Destruction Derby for the PS1.",
      "Very dope entry. It reminds me of a game I used to play a bunch as a kid. I could see this as almost a battle royale game in the future that would be so much fun to play with friends! The only thing I might suggest is maybe a faster death and restart. I wasnt very good and died a lot so it might just be a skill issue lol.",
      "Great take on the two button mod. The car controls very well considering thereâ\u0080\u0099s no acceleration or braking. The art and animation are both great too. It might be cool if there was some more variation in the background. Maybe some puddles or grassy spots.",
      "Hi. I like how you implemented the theme (reminds me \"Destruction Derby\" on PS1 ^^). About the game rules, I didn't catch when you are wasted or not. Also I would like to warp around the screen like the other cars (or like it seems to). All in all there is potential in your game and I had quite fun to play it !",
      "Fun game, I wonder if anyone can beat my score of 14180. I agree with what RicoTV said about the scale of the car. There is a lot that I like but I particularly liked how you can choose your car and how it drives from the menu screen. Also the cops were a fun challenge and reminds me a lot of the early top down GTA game. I think if you wanted to take the game further, some speed boost collectibles could be fun that makes you invincible from head on collisions for a short time",
      "Solid game, it was a bit annoying as the other cars appeared to wrap around as the drove of screen (I know they didn't but it looks like it) and then when you as the player hit the edge is a bit of a surprise. It seems the player and police are slightly up scaled which for the player comes from the select menu (the menus are really good nice and juicy and interactive) i would scale the cars down to normal size as they do initial drive out. Another thing that has been made easy in Gdevelop in the last year is a leaderboard this obviously adds a lot to this kind of game so or you can local save a running best score fairly easily which is always nice for replayability :).",
      "Fun! Steep learning curve lol, but becomes fun after a few tries. I especially like going into a drift and seeing the skid marks :)"
    ],
    "comments_posted": 41,
    "created_at": "2024-01-11 23:25:02",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2466035",
    "coolness": 41,
    "participant_info": {
      "profile_url": "https://itch.io/profile/prosmashy",
      "member_since": "26 February 2021",
      "posts": "608",
      "topics": "4",
      "followers": "8",
      "following": "7"
    }
  },
  "2449342": {
    "overal_rating": [
      "Score*",
      "4.138",
      "4.379",
      "4.414",
      "4.228",
      "3.931",
      "4.276"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.138",
      "4.379",
      "4.414",
      "4.228",
      "3.931",
      "4.276"
    ],
    "participant": "sijilum",
    "game_title": "Detonation Celebration",
    "platforms": [
      "web"
    ],
    "rating_count": 29,
    "comments_received": 19,
    "comments_raw": [
      "Pretty nice game! the gameplay is fun, and the bombs are a really nice way of stopping the player from just clicking everywhere. The art is really nice and I love the details of the buildings in the back, they just give so much life to the game. Overall, very good",
      "Lovely game. The gameplay is easy and straightforward, just click on fireworks. Yet, this game really has someoomphto it despite its simplicity. The graphics are no less than stunning, and the slight screen shake and particles go a long way and make the game feel sosatisfyingto play. Keep it up!",
      "Yay! That was really fun. LOVED the music and how it added to the urgency. And for game jams it's so nice to have a game that's easy to understand and play. Couple of thoughts for a future version: 1) maybe some fireworks that you DON'T want to click? 2) Maybe a \"bomb\" you could set off that clears the screen, but you only have a couple to use? Keep on going!",
      "This was a lot of fun. There was a lot of chaos that added to the spectacle.",
      "Really enjoyable entry!",
      "Thanks Keltfire! id consider getting S (score over 15,000) beating the game. There is a S+ for 20,000 but i wouldnt attempt it, i made it a way too luck based.",
      "The juice is all really nice and this game would be perfect for a leaderboard. I wish the sounds could be lowered instead of muted, and i wish there was some more variety in firework types or even game modes if you wanted to keep the gameplay the same. I also enjoyed how the music sped up while the time went down, great entry!",
      "I love the gameplay super fun, just me being nit picky but I wish the bg had a tiny bit more detail maybe some outlines of windows idk something on the building, also I think the game would be even better if you had upgrades like maybe a slomo fire work or something  in that nature,",
      "This was super fun and super intense!! Love all of the animations and the art! I played quite a few times but ended up getting a final high score of 11122 :)",
      "Satisfying, looks great and is super addictive! :)",
      "I like this game a lot. It's really fun and looks great. The different types of fireworks to click on are a good challenge and I imagine it would be even better on an ipad",
      "This turned out crazy good! I was a little skeptical when I saw it was just clicking on fireworks, but the frantic pace, juice, crazy projectile paths, bombs, and frantic music made it super fun.",
      "Love the game, had to force myself to stop trying to get S my hand/ eyes aren't that fast lolLove the music, art, and the feeling of having to rush as the timer gets closer to 1 minute!",
      "Really fast and fun gameplay! The music speeding up makes it very exciting. Cool game!",
      "Anxiety-inducing fruit ninja ð\u009f\u0091\u008d",
      "Nice job! I liked the simplistic nature of the game but the added complexity of the different types of fireworks and the bombs makes the game have a nice replay value for highscores. check out the SilentWolf plugin if you are ever interested in online leaderboards. its made for Godot and its free!",
      "Friut ninja but with rockets, who would have thought of that ð\u009f\u0098®â\u0080¦ The game looky really polished, and its pretty fun to play",
      "Very cool! Got a little intense there for a second. Nice theme integration. Fun game!",
      "Really nicely polished, and the music speeding up was a great touch!"
    ],
    "comments_posted": 6,
    "created_at": "2024-01-09 03:44:53",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2449342",
    "coolness": 33,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "111",
      "topics": null,
      "followers": "34",
      "following": "10"
    }
  },
  "2462876": {
    "overal_rating": [
      "Score*",
      "4.435",
      "3.826",
      "3.983",
      "3.870",
      "4.217",
      "3.565"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.435",
      "3.826",
      "3.983",
      "3.870",
      "4.217",
      "3.565"
    ],
    "participant": "jonqs",
    "game_title": "Equilibrius",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 20,
    "comments_raw": [
      "Very fun physics and really nice artstyle, great job!",
      "I love how the game is really hard to control, but it doesnâ\u0080\u0099t become frustrating at any point, and the fails also count as a spectacle of its own xD",
      "OK. Okay wait hahahahahha. This game is so hilarious in an amazing way. To be honest I found it REALLY hard, like kinda unplayable, but that only adds to its charm to me. This is so good. I thought the intro music and announcer was perfect for the aesthetic. And the itch page colors and header graphic were very nice. 5 stars across the board. Whew! Okay, I always try to think of stuff I'd improve... I mean, the game is so hard (maybe it was my computer or framerate or something) ... so there should probably be a difficulty setting. But that's not what this round is about and it deserves to finish very high. Thank you!",
      "Funny game! I like the idea of being a circus performer trying to stack plates on my head. The cartoony art style of the game really enhances this feeling. I love it!",
      "This game is amazing! At first i had trouble with the controls, but because every death looked comical, it was no problem. The controls feel like riding that unicycle. The art fits together so well and everything is very well drawn. After a short time playing I got the controls figured out and stacked those plates on my head :)I had a lot of fun playing this game, thank you :D",
      "Love the hilarious art style. The expression on the performer's face is really great. Overall the art works really well together, and I appreciate that you took the time to draw the numbers for the timer too. Might be cool to have some kind of animation in the beginning when the curtains are closed. Maybe spotlights moving around.",
      "This was a lot of fun. It truly felt like an accomplishment whenever I managed to actually catch a plate only to completely lose my balance and fly off the stage. Really funny game with some great sound effects as well, nice job :)",
      "Love the solid QUOP-energy of this one, took me some effort but I did get to the elephant spatting ending XD artwork all fits together nicely.",
      "Holy cow this is frustrating to play, I keep trying to get better and I want to quit, but the ease of repeatability makes it easy to say \"okay, last one\" over and over. The audio is perfect (thank you for volume control) the visuals are appealing. Great jam game!",
      "What an infuriating game that I can't really be mad at because it's so ridiculous. XD The VO is incredible, and your audio choices really made the whole experience. The art style fits well. I was weirdly mesmerized by your line width choices on the curtain--probably because I had to restart so many times.",
      "I think I managed to cause a bug in the game by pressing space, I had a second performer on screen that would jump and fail after restarting. This kept reoccurring.I like the opening and the voice acting, very cool.",
      "This one made me laugh.  I really like the art style, too!",
      "",
      "Tough to get used to the controls even though there were only two buttons. Fun frustration game and the ending was good.",
      "It's really funny, managed to catch 4 plates on my head and I love the ending :)",
      "Loved the art style, and the gameplay was pretty fun (tho it was a tad bit easy to make the player nearly completely stop)",
      "Really nice visuals, the ending funny.  Overall, it works well for a minute-long game. Great job.",
      "I know the point of this first round is the visual, but man, your audio is sick! I had so much fun laughing at the guy falling down, the plates smashing, the plates smashing when you fall down, the background music, amazing work!",
      "Dude, this is the funniest game.",
      "The way the character moved was hilarious, it remined me of QWOP, in the best way possible. The controls were challenging too, making for a fun short game, I really enjoyed this. Amazing entry!"
    ],
    "comments_posted": 35,
    "created_at": "2024-01-10 08:42:37",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2462876",
    "coolness": 43,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jonqs",
      "member_since": "29 March 2016",
      "posts": "210",
      "topics": "1",
      "followers": "10",
      "following": "4"
    }
  },
  "2464504": {
    "overal_rating": [
      "Score*",
      "2.779",
      "2.486",
      "2.399",
      "2.486",
      "1.974",
      "2.267"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.455",
      "3.091",
      "2.982",
      "3.091",
      "2.455",
      "2.818"
    ],
    "participant": "mondobe",
    "game_title": "Fashion Mags",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 11,
    "comments_received": 6,
    "comments_raw": [
      "This is a very funny concept. The take on the game jam is unique and plays well. I liked the pistol and the smg the most :)",
      "I really love the idea, and as Spike Studio said it would be perfect to have a bit more polish on the main mechanic, but overall this is a super fun game",
      "Something about the pure chaotic style was very fun.  Good job!",
      "A fun entry with great short rounds.",
      "The concept of this is really funny! I enjoyed how with the short rounds, it allowed for the gameplay to keep changing through different weapons, and the way new weapons/zombies unlocked was nice. I do wish the \"taking\" a picture aspect was more fleshed out with some juice, maybe extra points for in action shots, and just overall more depth than just hit enter=get points. Cool idea, great entry!",
      "Really fun game! The physics are extremely entertaining, and the concept is wild. I enjoyed the opening cutscene, too! But I think it could have been integrated into the network theme a bit more. Definitely nailed the spectacle, though!"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 03:20:00",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2464504",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mondobe",
      "member_since": "26 December 2019",
      "posts": "90",
      "topics": "2",
      "followers": "19",
      "following": "8"
    }
  },
  "2471090": {
    "overal_rating": [
      "Score*",
      "2.278",
      "2.278",
      "1.844",
      "1.735",
      "2.017",
      "1.952"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.200",
      "4.200",
      "3.400",
      "3.200",
      "3.720",
      "3.600"
    ],
    "participant": "robo_chiz",
    "game_title": "Fender Bender Spectacle - GDKO 2024 Round 1",
    "platforms": [
      "windows"
    ],
    "rating_count": 5,
    "comments_received": 4,
    "comments_raw": [
      "We both think car crashes are a spectacle xD I like how you implemented the fusion modifier",
      "This was really fun. I liked fusing the cars together and the crashing mechanic helped to get to some of the cars I blocked with other cars.",
      "This one is really fun, could see myself sinking a lot of time into it. Nice job :)",
      "That was a really fun experience. Some might even say a spectacle seeing the massive pile-up of cars. My highscore was 624 and i would have kept playing, but merging 2 big cars sent my tiny red racecar flying off the screen xD Nice visuals a really good game loop. Thanks for the experience!"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:35:16",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471090",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/robo_chiz",
      "member_since": "13 August 2014",
      "posts": "142",
      "topics": "2",
      "followers": "5",
      "following": "5"
    }
  },
  "2471130": {
    "overal_rating": [
      "Score*",
      "3.229",
      "2.422",
      "2.287",
      "2.085",
      "1.816",
      "1.883"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.692",
      "2.769",
      "2.615",
      "2.385",
      "2.077",
      "2.154"
    ],
    "participant": "ancient-newt",
    "game_title": "Firework Factory",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 2,
    "comments_raw": [
      "The idea is really cool ! Right now it's a bit hard to understand how to build proper fireworks but with some score mechanic and challenge this could be really fun.",
      "I would have liked to see what you built, but unfortunetly this is the only screen i'm getting when starting your game :/"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-15 07:36:10",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471130",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ancient-newt",
      "member_since": "28 December 2023",
      "posts": "3",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2470970": {
    "overal_rating": [
      "Score*",
      "2.277",
      "1.683",
      "1.822",
      "1.584",
      "1.782",
      "1.782"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.833",
      "2.833",
      "3.067",
      "2.667",
      "3.000",
      "3.000"
    ],
    "participant": "zonlee1",
    "game_title": "Fireworks Tycoon",
    "platforms": [
    ],
    "rating_count": 6,
    "comments_received": 5,
    "comments_raw": [
      "It was fun messing around with the settings, and the fireworks looked awesome.",
      "Mini fireworks sim. Awesome.",
      "Really cool visuals on the fireworks! Maybe would have been cool to add even more parameters to get even more customization :)",
      "Some really nice partial effects for the fireworks.  A little lacking in sound and gameplay.",
      "Its a funny simulation. (Apart from me starting a huge fire ;-) )The firework effect look great. I think some sound effects would have done wonders, but nothing to worry about, because the goal were the visuals."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 22:36:33",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470970",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zonlee1",
      "member_since": "28 January 2021",
      "posts": "12",
      "topics": "2",
      "followers": "1",
      "following": null
    }
  },
  "2470154": {
    "overal_rating": [
      "Score*",
      "2.998",
      "2.121",
      "2.018",
      "1.974",
      "1.609",
      "1.389"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.727",
      "2.636",
      "2.509",
      "2.455",
      "2.000",
      "1.727"
    ],
    "participant": "theverysanecoconut",
    "game_title": "Ghost Watcher",
    "platforms": [
      "web"
    ],
    "rating_count": 11,
    "comments_received": 8,
    "comments_raw": [
      "I love that you interpreted the two buttons as in-world buttons and not just keyboard controls. Clever idea and a good start on a game.",
      "Love the take on your modifier ! The game is a bit too hard i think but with some balance i think this could be really fun. Congrats !",
      "That is a very interesting spin on the 2 Button modifier. I had some trouble with the difficulty of the game, but that could be me :) For future games, dont forget that you (as the developer) are nearly always the best player at the game. So make the difficulty accordingly.  Most of the time I got to Wave 7 or 8. This is very good for your first game, good job. Keep up the good game dev spirit :D",
      "Fun twist on the two buttons.",
      "Liked your twist on two buttons!",
      "Oh another shooter! I really love the idea of having to reveal enemies as they approach, or in general, having to do an action to reveal an enemy - I am totally going to yoink that concept for something in the future! Certainly a great implementation of the '2 Buttons' Modifier!What was that cool rock riff in the back?",
      "A very good twist to \" 2 buttons\" it's a very good idea!!",
      "This is such a creative take on the 2 button modifier, I was more focused on controls I guessâ\u0080¦ Althought I think it would be more fun if you could only shoot the ghosts from the buttons, as its pretty easy to just go full on rampage and shoot all over the place until you accidentally kill all of the ghosts"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 15:56:43",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470154",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/theverysanecoconut",
      "member_since": "02 January 2024",
      "posts": "1",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "2450809": {
    "overal_rating": [
      "Score*",
      "3.565",
      "3.889",
      "3.435",
      "3.215",
      "2.722",
      "2.463"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.929",
      "4.286",
      "3.786",
      "3.543",
      "3.000",
      "2.714"
    ],
    "participant": "gryyre",
    "game_title": "Horticreatures",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 14,
    "comments_received": 8,
    "comments_raw": [
      "This is a fun, unique take on the theme! I loved your art style in this and I think it worked very well to sell the idea of this game. As others mentioned, a tutorial would be a must, and I also felt a bit punished by the timer until I figured things out. My favorite part was the unique descriptions for each monster in the book. I really loved that.",
      "Love the art and the overall concept! Lots of small details in there that work well together, as well as a nicely sized map where there's a purpose for each location. Personally I would've liked an un-timed version to really take in everything, at least at first, so I could get my bearings. But besides that, the detail and polish put into this entry are all fantastic!",
      "This is a fun concept that was well executed with great art.",
      "The art looks amazing. I like how every little detail has a effect or a animation. The plant looks so cool when its growing. I didnt find the second key, but nonetheless I got 8 points. This is a good entry :)",
      "A clever little idea!  Had fun with this one.  The art style is REALLY well done.",
      "As others mentioned a tutorial would help, but I LOVE your art style.  This game looks so good!",
      "I managed to grow a monster and I got 3 points for it at the end of the game. I can't work out where the second key is and don't feel like there is enough time to fully explore the game, I think the timer would be better if it wasn't there at least until I grasp the game or have some way of replenishing the time. The art is fantastic though, I like how the plant grows and I'm a big fan of pixel art. I also like being able to pick up and drop stuff too",
      "I didn't really get it sorry, I tried a few times and did water some stuff and get a different item but honestly felt a bit lost. I did notice the cool book with monsters and stats and that was pretty nice and helped with the more is more aspect. Maybe a gentler start with a rolling tutorial and some dumbed down challenges would have helped people like me get the idea :)"
    ],
    "comments_posted": 2,
    "created_at": "2024-01-14 23:58:11",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2450809",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gryyre",
      "member_since": "24 October 2021",
      "posts": "37",
      "topics": "3",
      "followers": "12",
      "following": "2"
    }
  },
  "2450393": {
    "overal_rating": [
      "Score*",
      "3.758",
      "4.061",
      "3.630",
      "3.424",
      "3.485",
      "3.424"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.758",
      "4.061",
      "3.630",
      "3.424",
      "3.485",
      "3.424"
    ],
    "participant": "brainfartstudio",
    "game_title": "Hyperdrive Havoc",
    "platforms": [
      "web"
    ],
    "rating_count": 33,
    "comments_received": 20,
    "comments_raw": [
      "Love it, love it, love it! Creative controls, beautiful pixel art, satisfying VFX, what is there not to love?",
      "Very unique controls, pretty hard to get used to, but still fun. Nice graphics and very fitting audio. Cool entry!",
      "Hey there BF! Nice work on a rock solid arcade game. I played it a half dozen times and never even got CLOSE to the leaderboard, but it was really fun. Haha. The sprites were adorable. The itch page was complete, inviting, and told me everything I needed to know (which is weirdly rare in jams... why don't people do that? It's so little work compared to all the coding and stuff.)Anyway, since you seem like a super chill guy who sincerely wants a lot of feedback, I've made a few notes. Take 'em or leave 'em! ... hope something in my rambling is helpful, in no particular order. (AND YES this is an invitation to please give me absolutely any criticisms on my games so I can get better)  Now, these are more about the game than the graphics... which I completely get isn't the point of this round... but anyhoo...1) I found the score super motivating... it would cool if the score was way bigger so I can read it without taking my eyes off the action.2) on that note, it would be cool to see the lowest score on the leaderboard displayed above my score (or maybe even a \"fake\" leaderboard score that tempts to try one more time) ... anything to up that sweet tension as the player gets closer to their next goal. Maybe at 10,000 points you get a new rocket or something haha I never got that far? If so it would be cool to see that goal as I'm chasing it.3) With so much going on, it'd be interesting to knock back the background stars to 30% or 50% and see if that helps the sprites pop ('course that might actually take away some of the challenge)4) The protag flashes (I think to indicate a period where you're invincible) but the flash is a little slow so it makes it hard to see where your rocket is while it's invisible. Might be interesting to try flashing 2-10x faster so the eye doesn't lose the rocket's location.",
      "i found it Kinda annoying with the movement but i guess thats the modifier that you had to useð\u009f\u0098",
      "Very cool and clever implementation of 2 buttons, although I'm definitely pretty bad at it myself! I loved the simplicity of the whole setup, while still giving me a challenge to work towards in trying to master that control scheme. One small thing I noticed was all the enemies were shooting directly at me, which was causing some unfortunate situations when I was in the corner with no path out. I think it would be neat if there was a little random variance to the angle at which enemies shoot at you, that way there's a bit more unpredictability in there as well. All in all though, very solid entry, I enjoyed it!",
      "Super satisfying game! The controls took a little getting used too but it felt super fun. The art and vfx came out great as well, nice job :)",
      "Clever use of two buttons, but I was not very good at it. The art and effects were really great.",
      "I love how you went for the option to let the player shoot instead of just left-right movement, and the overall artstyle is really nice",
      "As others said, a clever way to sneak in 2-button! Though I only wish there was some in-universe, onscreen visual reinforcement as to why this was the case, versus just the automated sliding left.",
      "Great use of the 2 button modifier! Also great use of the asset packs you listed to create a cohesive vision. It's a \"simple\" game in concept, but definitely challenging! (for me, anyway... XD) It's also awesome that you let your son \"help\" on this.",
      "Clever use of the 2 button modifier. This element adds a new perspective on simple space shooters. The idea of a leaderboard in a game jam game is nothing short of impressive. Great job!!",
      "The leaderboard may be beyond my skill level haha.  Fantastic game!  The bullets looked really cool.",
      "This is pretty impressive. The art looks amazing and everything fits together soo good. I really like the music in the title screen :)",
      "My boy Brainfart coming with another banger! This was a lot of fun and super addicting. The sound design and the quick games had me coming back for more and more (eventhough Im not good lol). The implementation of the 2 button modifier is impressive (I truly think that was the hardest one). A good ole arcadey fun time!",
      "Very fun, just wish I was better to get my name on that score board!! Everything matchs perfectly color and art!!",
      "Very fun game, glad to see my name is just about on the leaderboard for the time being. Really like the explanation of the hyperdrive being damaged and it works really well with the 2 button controls",
      "Holy I cant believe the scores some of the players got, I tried, I got better and then I gave up (I realised can never get on the board lol). Lovely art sound and overall design well done and you definately nailed two button modifier with the interesting movement mechanic :)",
      "Always look forward to playing your entries! Really love this, the animations and effects are great, and I love how vibrant the sprites and background are. Sometimes I struggled a bit to see the enemy bullets because they blended in a bit with the background, but that might just be a me thing lol.  I think you implemented the 2 Button modifier very well, the controls felt great!",
      "nice use of 2 buttons! the game is very difficult but the leaderboards make me want to try again. great job!!",
      "I really like how vivid the colors are and the sprites are a good fit for the gameplay. Might be cool to add some variety to the background for more of a sense of progress as you play through the game. Overall really nice entry!"
    ],
    "comments_posted": 7,
    "created_at": "2024-01-14 13:11:26",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2450393",
    "coolness": 45,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "306",
      "topics": "2",
      "followers": "34",
      "following": "26"
    }
  },
  "2466460": {
    "overal_rating": [
      "Score*",
      "4.579",
      "4.074",
      "4.000",
      "4.053",
      "4.000",
      "3.737"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.579",
      "4.074",
      "4.000",
      "4.053",
      "4.000",
      "3.737"
    ],
    "participant": "securas",
    "game_title": "I Lost My Spectacles",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 19,
    "comments_received": 11,
    "comments_raw": [
      "Cool game, I managed to beat it!",
      "Nice and clean game. I loved the blur effect personally and thought that was very creative! A couple of thoughts to consider for a future version: 1) it would be nice to be able to skip the intro... for a bit I thought my controls just weren't working. 2)  more dungeony stuff, like enemies and weapons and things might be fun. Well done!",
      "This is more than just a game. It's a piece of art. The maze is so dark and gloomy, and the blurry vision, you never know what's gonna be around the corner, or even if you can perceive it properly. Beautiful game, keep it up in round 2!",
      "I'm a little obsessed with the look of this game.  I'm definitely a sucker for retro vibes and quality, intentional use of a limited color palette and you absolutely killed it.  Great job!",
      "Very cool idea, and you perfectly captured that â\u0080\u009cslightly out of focusâ\u0080\u009d feel.\nOne of the coolest looking games in the jam.",
      "I really loved this game. The maze and puzzles were great for an intro level.  And the blurry vision mechanic was fun too. Well done!",
      "I escaped the maze, really good game and I really like the effects and artwork. My favourite part is going on the bridges, I think that is done really well",
      "This is a great entry! The art style is great and even with the limited vision all the gameplay elements are very readable and work well.It was very satisfying watching the vision get clearer and clearer with every lens I found. Nice work :)",
      "A really great implementation of the theme. And very unique gameplay :)",
      "Really great! A little unclear what the collectibles were for. I love the art and the take on the theme.",
      "I find it a bit odd to have player be â\u0080\u009cblindâ\u0080\u009d when he can see the charather, I think it would work better as an FPSâ\u0080¦ but the effects were really nice"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-12 07:31:53",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2466460",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/securas",
      "member_since": "18 December 2016",
      "posts": "753",
      "topics": "17",
      "followers": "1,280",
      "following": "323"
    }
  },
  "2454402": {
    "overal_rating": [
      "Score*",
      "1.627",
      "1.735",
      "1.519",
      "1.475",
      "1.410",
      "1.085"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.200",
      "2.800",
      "2.720",
      "2.600",
      "2.000"
    ],
    "participant": "nicethehuman",
    "game_title": "In pursuit of the network",
    "platforms": [
    ],
    "rating_count": 5,
    "comments_received": 3,
    "comments_raw": [
      "A fun game with a lot of room to grow. I liked the art style a lot.",
      "I like the carboard figures/enviroment, and the music fits really nice, maybe putting option to exit on pressing escape, but the game was fun",
      "A good entry for your first game. Thanks for the play, i liked the music and the art was kinda nice. The Physics need some improvement, but thats okay, because gameplay was not the goal for the first round."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-05 05:35:02",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2454402",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nicethehuman",
      "member_since": "23 December 2023",
      "posts": "0",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "2465515": {
    "overal_rating": [
      "Score*",
      "4.429",
      "3.821",
      "3.893",
      "4.036",
      "3.607",
      "3.571"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.429",
      "3.821",
      "3.893",
      "4.036",
      "3.607",
      "3.571"
    ],
    "participant": "malek-elsady",
    "game_title": "Insanity TV",
    "platforms": [
      "web"
    ],
    "rating_count": 28,
    "comments_received": 19,
    "comments_raw": [
      "This was just such a cool game and concept. The theme was implemented amazingly and all the art was on point. The gameplay was a little difficult for me as I am both a Bad and Slow typer, but I still enjoyed it a lot",
      "Wow, I enjoyed this game so much, maybe you could have added so the player just types the text with no spaces, as it took me a while to notice i should have seperated the words, it was really hilarious listening to that news xD, also this reminds me of the old flash game where you had to do multiple minigames at once, however thereâ\u0080\u0099s just 1 thing that made me a bit frustrated and that were the popup ads appearing on top of submit early button, but other than that I really had a blast with this game :)",
      "Great use of theme and a fun concept! I thought it was a really unique take on spectacle as well as the network modifier. I will say, I could have used a lot more feedback. It was hard for me to see anything when typing and I was super confused as to what I was meant to be doing the first run through.",
      "Always look forward to playing your games! This was a super fun game that implemented the theme and modifier really well! I really enjoyed playing this, I especially loved the AI voice, it was so fun to make it say stupid stuff.",
      "Original use of AI voice, i kind of tried to wright silly things after the first day. Really fun !",
      "Ha, this was great. I loved it.",
      "Loved it. No notes.",
      "Okay.. can you stop making really awesome games and give the others a chance?Love how you increase the difficulty each round, really good idea and fun mechanics!",
      "This was executed really well, the only constructive this I could say about this one is   maybe don't let the player type whatever they want ? also maybe add a little more juice to the animations or even when you type a letter, on the side I am a very slow typer so I personally would enjoy a separate easier game mode where the text scrolls a bit slower",
      "Wow, really great interpretation of the theme and trying to juggle tons of things at the same time is a ton of fun! Wish I could have backspaced or seen my cursor, sometimes I got confused and mistyped a LOT lolGreat idea with the TTS as well!",
      "Really good idea for the theme, trying to type the stories felt good and it's nice to watch it afterwards too with the pictures and presenter",
      "Very fun and extremely unique game idea, I loved every second of it! The stories you put together were hilarious as well, always impressed with your games.",
      "This was really fun, the execution is great and the art works really well too. Great job :)",
      "Your games are always dope. I feel like there is very little I can say that would add value/improve what you produce. It's inspired some cool concepts I want to try in my game. Sent it over to a couple friends and they also thought it was very dope.",
      "Really unique game! I did't know what to do at first, but then I had fun creating these chaotic random stories. Pretty cool!",
      "Extremely innovative! My horrible typing speed was my downfall :\")",
      "At first I was confused, but when I started writing my own news stories I was doubled over with laughter. Hearing the news anchor talk about the 'tasty splash of a poo falling into the toilet' was just too funny. Accompanied by irrelevant stock photos just made the experience even more amusing.",
      "Loved having AI read the story.  This reminded me of a combo of Wario Ware and Jackbox games.  Excellent job!  I can see this being top ten.",
      "Stress simulator the game. Really cool concept having many minigames to bounce between at once, I do wish they each have a bit of juice with them, such as the pictures looking like screens, or the button having some particles when clicked. Hearing the AI read out the news story was amazing too, great entry!"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-12 18:45:22",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2465515",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,031",
      "topics": "14",
      "followers": "44",
      "following": "50"
    }
  },
  "2470425": {
    "overal_rating": [
      "Score*",
      "4.571",
      "4.190",
      "4.210",
      "4.429",
      "4.048",
      "3.810"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.571",
      "4.190",
      "4.210",
      "4.429",
      "4.048",
      "3.810"
    ],
    "participant": "joszs",
    "game_title": "Intergalactic Spectacle Shop",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 18,
    "comments_raw": [
      "I really like the game, With some polish it could be make for a great speedrunning game xD, I wonder whatâ\u0080\u0099s the lowest score they are willing to buy the spectacles at?",
      "This is a very fun game!! Such a good idea on the Them of \"fusion\"!  Great art and mechanics, Looking forward to see if you continue working on this one or not!!",
      "5 stars on theme! Very creative. Obviously in a 2 week jam we don't have time to do all of the polish, but in a future build it would be nice to have an interactive tutorial. I was a little confused for a bit. I suspect if you watched a new player figure it out you'd come up with a bunch of ideas to make it a little more intuitive. But hey, this round isn't about gameplay! I thought the graphics, particularly the customer art, was very charming.",
      "The art all worked well together, made for a cool style! I liked how the fusion worked, and the overall idea, but I think some variation would be nice. I also wanted some small QoL, such as a grid/ruler, or being able to rotate objects both directions maybe with Q/E. I liked how their eyes followed the mouse too, nice entry!",
      "Wow impressive work on art ! The gameplay idea is really cool but may need a bit polish to be really fun. The overall look of the game feel so great, excellent work !",
      "This entry is SO GOOD! The art style was fun, having the eyes follow the mouse was a great touch, and it's just such a relaxing and satisfying game to play.  GREAT job.",
      "I really like this game, the aliens look awesome and it's so satisfying getting the glasses to fit just right",
      "I love this game. The visuals are super cute and you stuck the landing perfectly with the theme and modifier.",
      "Fun game, I really liked all the different sprites for the customers.",
      "Fun game, I loved making the glasses. I think a little more juice and a little more variety and this would be a ton better.",
      "Really great! Love the art style. Might be cool if the sell button was animated.",
      "A perfect game! Found a way to cheat by making a spectacle out of only spectacles and fusing these together. 10/10 would do it again. Love your bulky art style! Cant wait to see more of your work!",
      "This was a lot of fun. I loved all the charming characters and the game has a really neat concept. I found myself trying to make the glasses with as few pieces as possible as a challenge. Good job :)",
      "Such a neat, fun concept! I really enjoyed the gameplay, all the art is awesome too.",
      "very fun! great alien faces ð\u009f\u0091½",
      "I could honestly play this for hours, it was super fun, and I loved the art style! :)",
      "dang! this is really good concept, could be a full release game too.",
      "One of my favorites I've played through so far. Fun, relaxing, and a little bit silly at times. I love how theres no real mechanic to actually punish you for making mistakes so it's always fun to play around."
    ],
    "comments_posted": 9,
    "created_at": "2024-01-14 16:54:32",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470425",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/joszs",
      "member_since": "19 January 2016",
      "posts": "45",
      "topics": null,
      "followers": "93",
      "following": "15"
    }
  },
  "2471121": {
    "overal_rating": [
      "Score*",
      "2.871",
      "2.240",
      "1.890",
      "2.016",
      "1.540",
      "1.540"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.417",
      "2.667",
      "2.250",
      "2.400",
      "1.833",
      "1.833"
    ],
    "participant": "sleepingforge",
    "game_title": "It's gonna be SPECTACULAR",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 7,
    "comments_raw": [
      "I really love the theme and modifier implementation, but I just wish there was more than shooting just one rocket",
      "Building the firework was intuitive and the firework at the end was a nice visual treat. Would love to be able to create more fireworks",
      "Awsome take on the Fusion! Looking forward to seeing more of this idea!!",
      "Nice work man would have loved to see more of it.",
      "Interesting idea, would have been great to see.",
      "I would've liked to see a mode where you could just make whatever fireworks you want.  Good idea and use of the theme!",
      "Interesting idea and nice firework affects, it has potential to be expanded further."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:58:48",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471121",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sleepingforge",
      "member_since": "30 April 2020",
      "posts": "11",
      "topics": null,
      "followers": "3",
      "following": "1"
    }
  },
  "2468533": {
    "overal_rating": [
      "Score*",
      "3.571",
      "3.291",
      "3.221",
      "3.011",
      "3.151",
      "3.501"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.250",
      "3.917",
      "3.833",
      "3.583",
      "3.750",
      "4.167"
    ],
    "participant": "bromelee",
    "game_title": "Jelly Show",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 7,
    "comments_raw": [
      "Cute game! You're a slime in a little show, jumping around and summoning clones of yourself, who start pushing boxes around and they get in the way of you. I like it, very silly.",
      "The art looks good,the slimes look cute and everyone is happy and dancing :D A quick improvement you can implement is setting the spawn point to the floor, this gives the feeling of a finished game.",
      "Great entry, I had a lot of fun dancing around and duplicating myself.",
      "I made $317 as a slime.  Duplicating yourself in a dancing show is a great way of fitting with the theme and the artwork looks good, although it could be more cohesive if the pixel sizes were more consistent. The gameplay is a lot of fun and to make it even more fun, I think it might be worth considering in a future round or update is having some crosses at low and some at higher heights so you have to jump on top of the boxes to get them, making it so that the slimes can get squashed by the boxes, making the slimes pushing the boxes a different colour, having a white outline on the main character so that you know which one you are instantly after duplicating. I also noticed that some slimes would stay in the air sometimes but it is a jam and bugs are common in everyone's games even mine so no worries there. I feel like I've rambled on for long enough but I think you are on to something good here",
      "I absolutely Love this entire, the only things I felt where off were there was not much urgency because your timer is off to the side and there I did not notice it till my second play-through maybe  change the position of the timer and make it larger maybe, also the collisions for the slime is a bit off  I think every time  I would jump onto a moving platform I would get suck and either get shot up/down and get repositioned to the floor or  I would have to move forward and jump over it  i would not jump on top of thew higher part of the moving platform when I was on the lower part of it (I believe it was the safe), also 1 suggestion  change  the colors of your clones/duplicated/copies,",
      "Very cute game. Lovely art! I liked how you tuned the acceleration/deceleration. It made the slime feel slippery in a fun way. Also, great use of modifier! I could instantly tell which team you were on.",
      "Hella cute. Pixel style was perfect for this. Adorable slimes doing slime things. Enjoyed the slimes pushing stuff around on the stage. Got $315, may play again."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-13 16:16:33",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2468533",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bromelee",
      "member_since": "17 June 2021",
      "posts": "158",
      "topics": null,
      "followers": "13",
      "following": "26"
    }
  },
  "2469280": {
    "overal_rating": [
      "Score*",
      "3.600",
      "3.400",
      "3.867",
      "3.400",
      "3.400",
      "2.733"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.600",
      "3.400",
      "3.867",
      "3.400",
      "3.400",
      "2.733"
    ],
    "participant": "gamefavorites",
    "game_title": "Jester's Catch",
    "platforms": [
      "web"
    ],
    "rating_count": 30,
    "comments_received": 19,
    "comments_raw": [
      "Very good entry! The art looks really good and the gameplay is very fun, especially with all the ending you can get",
      "Love the art!",
      "I really loved the artstyle in this game! The gameplay was also smooth and simple to understand - I managed to get every ending except for the peaceful one. Great  job!",
      "A very complete feeling game with easy to understand gameplay. THANK YOU THANK YOU for explaining so well in your description how it fit into the themes and exactly where you got the assets. So many people don't do that and it makes it really hard to judge. :P Good luck with the jam!",
      "The platforming was quite difficult.",
      "A fun, great looking game.",
      "Really great entry! I like how many things you managed to get animated - falling in water, exploding flies, cartwheels. Might be cool to add a jump animation and parallax for the background.",
      "This art and animations in this are just perfection, nice work :)",
      "Great to see another Construct game! This is a fun, challenging entry. I tried so hard to get the Peaceful ending, but just couldn't hack it. Fantastic use of your assets and engaging game overall!",
      "Not sure why I laughed uncontrollably at the different endings. But it sure added to the experience. I love the art and theme for this. Everything works really well together. I felt bad for killing the king after he rewarded me, but I guess times were tough back then...",
      "The art style is wonderful, the background especially. I will say the last catch on the sword was a bit awkward, the way the sword moves was hard to follow, and the jumping in the first part of the level was a bit floaty. I did enjoy the bug's art a lot, and the animation when landing and rolling as the jester. Nice entry!",
      "So pretty ! i Liked the art a lotâ\u0080¦. Animations were aestheticâ\u0080¦.",
      "Wow really great job! I tried so hard and was very satisfied when i was finally able to get peaceful!",
      "The roll and death animations are just perfect xD, One issue I would point out is every time I would die, the music just restarts, but this jam is purely about the visuals and they are really awesome",
      "Awesome art, I like the player animations. Also, the platforming was pretty fun. The fact that there were multiple endings made me replay it a couple times. Cool entry!",
      "",
      "My favourite part was the Jester sliding in the door as the guard waits hehe.",
      "I loved the vibrant art style, and I also really liked the player and the bug animations. I found this game a bit hard, and I struggled with the vines a bit, but it was just my bad timing. Really enjoyed playing this!",
      "This one was a lot of fun.  The jumps took a few tries to adjust to, but I liked the multiple endings and the art is a lot of fun."
    ],
    "comments_posted": 57,
    "created_at": "2024-01-14 02:59:22",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469280",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "786",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "2468405": {
    "overal_rating": [
      "Score*",
      "1.952",
      "1.410",
      "1.388",
      "1.085",
      "1.410",
      "1.085"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.600",
      "2.600",
      "2.560",
      "2.000",
      "2.600",
      "2.000"
    ],
    "participant": "skylestor",
    "game_title": "Knife `em all",
    "platforms": [
      "windows",
      "linux"
    ],
    "rating_count": 5,
    "comments_received": 3,
    "comments_raw": [
      "I would highly recommend creating a html5 build for your games as I unfortunately will not be downloading a random game off of itch.io from a game jam. This is highly reducing the chances that people play and rate your game, making it less likely that you will make it through.",
      "Fun two button game. I had a hard time reading the letters.",
      "It is quite a spectacle seeing those knifes not hit the person. Also quite difficult. I had a bit of a trouble distinguishing the \"W\" circles from the \"Q\" circles. Otherwise a solid entry. Maybe some effects would have helped you, but for your first published game ever its definetly a solid entry :)My highscore was 25 :)"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-13 15:27:58",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2468405",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/skylestor",
      "member_since": "29 December 2023",
      "posts": "1",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2471124": {
    "overal_rating": [
      "Score*",
      "4.200",
      "3.520",
      "3.640",
      "3.560",
      "3.320",
      "3.120"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.200",
      "3.520",
      "3.640",
      "3.560",
      "3.320",
      "3.120"
    ],
    "participant": "neverknow247",
    "game_title": "Knockout Run",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 25,
    "comments_received": 15,
    "comments_raw": [
      "This was tough to begin with, but with a bit of practice felt really fun and smooth. The polish is really nice too, awesome game :)",
      "I am absolutely terrible at this game, but the movement controls feel pretty well tuned and tightened! My main critical feedback would be in the wall jump. I feel like I'm not getting the force I'd want when pushing off from the wall and it makes any wall jumping required for the levels feel a bit button mashy.",
      "Nice polish on the gameplay, looks like a real challenge to master all mechanics. Neon visuals are really fitting with that. Congrats !",
      "took a little time to get to use full power of dash!!\nBut all in all a very visually pleasing game.. Sounds were on pointâ\u0080¦",
      "Fun game, lots of nuanced mechanics that are definitely beyond me (this is never my genre but I always enjoy giving it a try) but yet I was still able to get to work a little bit for me! The toilet level was not one I could pass :s",
      "This was a really great game!  Your mechanics are super fun!",
      "Nice visuals (even without the glow effect) and atmosphere. Went to the flag but tried to catch the sheep (?) below. I failed here but I was a good experience with \"oh\", \"ha\", \"hiii\" all the way ^^Good job !",
      "Love the visuals you've created. Feels like alot went into this. There's so much to get used to, mechanics-wise. I can't say enough about the leaderboard implementation. Brilliant idea! A really fantastic job all-around.",
      "",
      "I liked this game, especially liking how you can race against a ghost version of yourself to try and improve the time and exploring the different paths to take. I didn't sign up for the leaderboard but this is my time:",
      "Really digging the art style. Was really hard at first, but I enjoyed learning the controls and making high scores.The leaderboard and ghosts are a nice touch, and a good way to do the network modifier.",
      "I really liked the art style and the controls worked great with a controller. Great job!",
      "I love the complex movement, felt really good to combine different moves to get further. Great job!",
      "fast neon ball go brrrrrrrrrrrrrrr",
      "My favorite game so far. The controls are so smooth once you get a hang of them. I love the vaporwave/neon style graphics. Spent like 20 minutes trying to improve my time lol"
    ],
    "comments_posted": 41,
    "created_at": "2024-01-14 23:56:51",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471124",
    "coolness": 43,
    "participant_info": {
      "profile_url": "https://itch.io/profile/neverknow247",
      "member_since": "05 August 2020",
      "posts": "327",
      "topics": null,
      "followers": "31",
      "following": "33"
    }
  },
  "2471096": {
    "overal_rating": [
      "Score*",
      "4.212",
      "4.212",
      "4.424",
      "3.776",
      "3.333",
      "2.697"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.212",
      "4.212",
      "4.424",
      "3.776",
      "3.333",
      "2.697"
    ],
    "participant": "spoonsweet",
    "game_title": "Laser Spectacle",
    "platforms": [
      "web"
    ],
    "rating_count": 33,
    "comments_received": 20,
    "comments_raw": [
      "Pretty nice entry! the art is amazing as per the usual, and I really enjoyed all the button animations. I also really loved the lasers, explosions, and all the small details that made the game come to life",
      "I am confused about the gameplay, but adore all the art and animations. Everything feels really polished and fun to interact with. Nice entry!",
      "As always, very awesome art. I like these kinds of figuring out the systems types of games. Only got to figuring out the lasers though and not the ending. I'll give it another go when I have time. Really fun, I loved it.",
      "This is the most beautiful pixel art and animations I've seen in the jam so far. Super awesome effects and the color palette is just chef's kiss. 100% deserves to finish high in this round! The game itself was confounding to me, but that doesn't matter much for a graphics challenge. hahaha. If I had to suggest something specific to improve in the future it would be ... the font choice? The tiny sharp pixels of the game felt a little weird against the huge pixels of the font. But other than that I thought it was truly lovely.",
      "The art was really nice here! The lightning striking down the well looked great, with the glow on the well around it. I was a bit confused and just clicking random things until it worked, but that may have been what you were going for, otherwise nice entry!",
      "One of the most visually stunning entries in the jam.\nWhat did you use to create your sound effects?",
      "Everyone has already commented on the art--which is beautiful--so I want to comment on the sound design as its the first thing I noticed. It's fantastic and adds so much to the button presses. The tones are weirdly resonant in a way that's assertive but still pleasing.",
      "Well, I guess I'm not original in saying the pixel art is amazing... I mean, the atmosphere you built here does it's job and does it well. Something about the button clicking felt oddly satisfying. Especially that big green one!! I was genuinely looking forward to what my new combination was going to bring. It's games like these that remind me of how non-existent my own memory is these days. Seriously though, a very well crafted project in all categories.",
      "Visual art and style is very on point! I was a little confused as to what to do, but after reading it's more of an experiment and see what happens kind of situation, I think you nailed that pretty well.",
      "Not sure I can add much to what has already been said, the art style is fabulous! From first pressing on that juicy big button, I impulsively when to touch under my chin as though I just shaven. Didnâ\u0080\u0099t get the ending condition I saw teased on Twitter (I think), but got a number of different popups to appear and did get all buttons unlocked. Not sure I got an intuition as to why sometimes clicking on a button gives me an â\u0080\u0098ertâ\u0080\u0099 vs getting pressed, maybe just enough time to charge? A little more user info on that could help for when you really get this laser show a cookinâ\u0080\u0099 :D",
      "As everyone has already said your art is just amazing and always look forward to seeing what you do! The game was fun and interesting to figure out what number combination to use! Can't wait to see what you do next!!!",
      "The art is fantastic as always. I enjoyed seeing what happened when pressing the buttons and all the effects are awesome. An underground laser show is a really novel idea and I got very close to the end",
      "Really great job! once i learned the different laser combos i really wanted to be able to program in presses that would play sequentially and as i was trying to combo as fast as possible i ended the game XD! super satisfying! great job!",
      "This is fantastic looking and delightfully juicy. I accidentally found the ending which I think must've been intentional? Awesome vibe, nice work :)",
      "Your signature aesthetic is soooo dope! So first of all that transition into the start! OOOOOOOHHHHHHH so good! I never got the final combination (I got all the digits) but I loved it. The little voices from the old timer reminded me of the TOTK for some reason (in a good way). Im only sad I didnt see the end spectacle cause I know its gorgeous.",
      "Cool entry, was a bit lost on what to do but testing random things was satisfying. Love the pixel art ! Good job !",
      "",
      "Nice pixel art, I accidentally managed to finish the game and reach the ending after submitting a few combinations.",
      "Your art style and colour palette are amazing as usual, and I really enjoyed the gameplay. Loved the button click animations too!",
      "Your color palettes and art style are always so freakin good."
    ],
    "comments_posted": 14,
    "created_at": "2024-01-14 23:40:08",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471096",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "894",
      "topics": "3",
      "followers": "152",
      "following": "66"
    }
  },
  "2460078": {
    "overal_rating": [
      "Score*",
      "2.278",
      "2.556",
      "2.333",
      "2.611",
      "2.111",
      "2.378"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.278",
      "2.556",
      "2.333",
      "2.611",
      "2.111",
      "2.378"
    ],
    "participant": "cosmicraybitflip",
    "game_title": "Lunétableau",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 8,
    "comments_raw": [
      "Thanks everyone for the nice comments! Wasn't expecting so many people to play my game lol",
      "Don't worry about bugs, how else are we supposed to learn? It looks like a great start!",
      "I like the player animations and the visuals. Can't wait to see more of this game when the bug is fixed!",
      "Sorry for the nasty bug, sadly it happens sometimes. I like the little character and shoot feeling you made !",
      "So sorry about the HP bug, I hate when stuff like that happens to a final build. :/ It's a shame, too, because it feels really good to move and shoot. Something about the bullet spread is extremely satisfying.",
      "I like the animation when the player moves. You used the sprite animation and also bounced the player-sprite. The glow of everything fits good with the minimalistic design. Good Job! And i found, that you can still shoot when dead :)",
      "I liked how enemies were angels, even being extremely fast angels. I would like to try this after you fix the HP bug, it seemed fun, and I enjoyed the glow of the bullets while shooting.",
      "difficult game! im sure you already know but the hp is bugged. nice entry! keep up the game dev journey and i hope to see you around in future jams!!ps its nice to see another godot dev!"
    ],
    "comments_posted": 21,
    "created_at": "2024-01-14 23:58:23",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2460078",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/cosmicraybitflip",
      "member_since": "10 July 2020",
      "posts": "25",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2471074": {
    "overal_rating": [
      "Score*",
      "4.444",
      "4.056",
      "4.278",
      "3.900",
      "3.444",
      "3.278"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.444",
      "4.056",
      "4.278",
      "3.900",
      "3.444",
      "3.278"
    ],
    "participant": "marilefabled",
    "game_title": "Make It Look Good",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 13,
    "comments_raw": [
      "I havent considered a fight could be a spectacle, but here we are with a simple idea executed perfectly",
      "It was fun trying to find the right balance between killing the partner and convincing the gang. The art style was great too.",
      "Well thatâ\u0080\u0099s a niche of a scenario! Nice use of a time limit too heh, and graphics fit well together. I think my browser kind of hung slightly more than you probably intended (?) on each punch as it calculated the lighting info. Just a guess, maybe always having the light on but very dim to simulate â\u0080\u009coffâ\u0080\u009d would help smooth that out? Though the slomo and held frame looking effect still holds nicely. But if it was intentional then slap my wrist for going the extra mile for a very specific experience! Good effort in the surrounding scene as well.",
      "",
      "Really enjoyed the game, it took a bit but found the rhythm to make it to the end!",
      "The 3D art is amazing and detailed. The game fits the theme perfectly and it's a fair challenge",
      "nice visuals and style! i really like the concept! I think this would make a great mini game in a overall bigger game!",
      "This was really good! Really liked your visuals and it was a very unique concept!",
      "The art style is great. Gives me big Umurangi Generation vibes. The animations and vfx are super satisfying aswell, nice job :)",
      "The visual and sound effects really sell this one. Animation is super responsive, too! I didn't think I'd find a game about beating the crap out of my partner fun, but I definitely did. XD I think it's balanced well. Challenging, but not too difficult.",
      "Nice game.. enjoyed punching for ya gang heheâ\u0080¦.",
      "Such a funny concept, and was really satisfying hitting combos with just the spacebar. I will say it seemed a bit hard, the gang trust meter went down quite quickly, and didnt allow much time for the cop to regenerate health, I kept comboing and making it look too good lol. Nice entry!",
      "I like the take on the theme, the artstyle is stunning, the effects are awesome! I also love the mood that the gang characters are creating! And \"Morris Moore\" is a smart touch to the theme :)"
    ],
    "comments_posted": 5,
    "created_at": "2024-01-14 23:46:09",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471074",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/marilefabled",
      "member_since": "31 July 2021",
      "posts": "166",
      "topics": "2",
      "followers": "13",
      "following": "18"
    }
  },
  "2458336": {
    "overal_rating": [
      "Score*",
      "4.538",
      "4.115",
      "4.077",
      "4.192",
      "4.077",
      "3.462"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.538",
      "4.115",
      "4.077",
      "4.192",
      "4.077",
      "3.462"
    ],
    "participant": "theduckcow",
    "game_title": "Makin'Paper",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 26,
    "comments_received": 19,
    "comments_raw": [
      "Oh my god this game is amazing! The art and paper craft style is so charming and I especially love the building animations whenever you buy a stand. It also is a really cool interpretation of the theme plus it had that addictive tycoon quality where you exponentially increase in money over time which is a dopamine factory",
      "I love this art style. Very unique in the jam. The animations of the items assembling look like they were a lot of work!",
      "",
      "Holy cow, I'm in love with this art style! I've wanted to make a sketchy, pen and paper style game for a long time. You found an excellent way to do that, and the animations are incredible. The unfolding one is especially top notch.",
      "i love the art style. I wish i could use the mouse a bit more to control however",
      "Visuals are really nice ! Love the unfolding animation.",
      "Very satisfying \"builder-like\" game :)",
      "I REALLY love the pencil drawn look of this.  Great job on the art.",
      "This was awesome, great artwork. I only wish there was a little more to it. Great work!",
      "Great art style. I left one little bench to remind me of my roots when I was making all that paper $",
      "I absolutely love this art style, you did an awesome job with it :)",
      "You need to stop whatever you're doing and expand this game... I want more! It's so beautiful and awesome how you've designed this to be paper-like!!",
      "I really want to see more of this. I love this art style and smooth animations. Had me smiling all the way through",
      "Lovely paper aesthetic! The folding the benches animation was sick! I liked how your placement of patches allowed me to build benches one after the other without needing to zoom out. This way, by the time I had selected the bench I wanted, the car had passed by, I had more money so I could click on the next patch and repeat. Also, the fact I could build on top of old benches allowed a statement of urbanisation. And once it had generated enough money, I could tone the audience down for the select few :D",
      "Really impressed with the artwork as well as the ability to control the camera to see the artwork. It's also good how the money is green to stand out and who doesn't love seeing money going up and up",
      "Really great entry! Fits the theme really well and looks nice too.",
      "Super clean! i loved the animations. I really want to see you expand on this idea in round 2! great job",
      "I love the hand drawn pencil art style. You pulled it off really well. Might be nice if there were some effects on the money counter in the upper left. And maybe some skid marks for the car. Overall really great.",
      "This was neat. Cohesive, pleasant and easygoing. The art style fit perfectly. Nice. I got to 355 spectators btw."
    ],
    "comments_posted": 24,
    "created_at": "2024-01-14 20:52:14",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2458336",
    "coolness": 25,
    "participant_info": {
      "profile_url": "https://itch.io/profile/theduckcow",
      "member_since": "30 January 2021",
      "posts": "269",
      "topics": "3",
      "followers": "23",
      "following": "9"
    }
  },
  "2469815": {
    "overal_rating": [
      "Score*",
      "4.056",
      "3.500",
      "3.500",
      "3.278",
      "3.056",
      "3.611"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.056",
      "3.500",
      "3.500",
      "3.278",
      "3.056",
      "3.611"
    ],
    "participant": "datux",
    "game_title": "Melody Mayhem",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 13,
    "comments_raw": [
      "Really neat interpretation of the modifier and a unique rhythm game! It's incredibly challenging at the end, but still pretty fun!",
      "Yay rhythm games! This'll be awesome to build on for round 2! The fantasy of building a band is universal and fun, and the pixel art is great. If I had to pick something specific to consider for a future version, my brain was SO challenged that the band members don't line up left to right to match the keyboard's left to right of the keys. Haha if that makes sense. So Q should be the left member, W the next, etc. But maybe that'd make it too easy. Nice work!",
      "Wow, this game implemented more is more modifier really well I love how fast it gets out of hand to control all the charathers",
      "difficulty really ramps up but i gotta say after a few tries you can get really good. My biggest complaint is that learning which buttons are which instrument while i am also trying to play felt frustrating. I wish there was a couple of seconds to catch my bearings first. other than that one minor nitpick i think it was great! great job!!",
      "Great game, very tough with all the buttons on one side so close together. But I had fun.",
      "This was a fun rhythm game, and the art looks great! My only suggestion would be that maybe switching the key to press isn't necessary?  It was already a lot to keep track of.  Still had a lot of fun, though!",
      "Great characters and a good rhythm game",
      "Fun rhythm game with lots of great partial effects.  Well done!",
      "Another \"More is More\" person! SHOUT OUT TEAM SIMON!!!! I love rhythm games and was really excited to play this one. This bad boy is HARD haha. I love the idea and concept but I wasnt able to get too far. I think someone said it earlier but the buttons changing for the characters each run was a bit confusing but i think the hard part for me is that they were centralized to one part of the board. So I wanted to use both hands to play but it felt awkward to do so. Love this though and I could see this becoming a nice indie title with some polish and a dash of narrative.",
      "",
      "the cute characters did not prepare me for the multi-tasking chaos. that being said it was a fun, difficult challenge with some nice visuals, good job :)",
      "Outch i'm really bad at this kind of multitask stuff. I recommend not playing full screen to see all band member at once. Love the little character style ! Cool entry !",
      "Very difficult game, but not in a bad way, in a chaotic way. I do wish there was more time to see what buttons would need to be used before it started, and I do want to say the design of the characters was amazing. Nice entry!"
    ],
    "comments_posted": 18,
    "created_at": "2024-01-14 17:32:29",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469815",
    "coolness": 21,
    "participant_info": {
      "profile_url": "https://itch.io/profile/datux",
      "member_since": "10 April 2022",
      "posts": "105",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "2470960": {
    "overal_rating": [
      "Score*",
      "2.731",
      "3.221",
      "2.731",
      "2.661",
      "2.310",
      "2.310"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.250",
      "3.833",
      "3.250",
      "3.167",
      "2.750",
      "2.750"
    ],
    "participant": "tenifayiga",
    "game_title": "Mile High Marathon",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 6,
    "comments_raw": [
      "Really fun game! Love the art and it all goes together very well!",
      "The enviroment looks good. The controls are a bit floaty, and when touching the ground very snappy, but jumping through the level and dashing to walls, then dashing them up felt good. I played it a couple of times and got to the goal in 00:20:43. The longjumps felt really good. Overall a good start!",
      "Really nice look to the game.\nYour background and atmosphere are especially good.\nNice job!",
      "The art is really good and I like the setting high above the clouds. Having parkour is cool and certainly meets the theme of spectacle but not sure where the network modifier is so sorry if I missed something there. I like the dash and wall jumping ability and the level design fits its use well. I think it might be better to reward the trick points the longer you press the button in the air and have a place you have to get to within a certain time limit. I liked exploring the level and thought that was the best aspect",
      "it feels really floaty and slippery Cool tho",
      "Cool moves, took me a bit to get used to the controls. I wish the there was a bit more to the tricks, but it was fun running around the level, jumping up walls and taking long jumps."
    ],
    "comments_posted": 2,
    "created_at": "2024-01-14 23:54:59",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470960",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/tenifayiga",
      "member_since": "03 December 2018",
      "posts": "69",
      "topics": "1",
      "followers": "8",
      "following": "1"
    }
  },
  "2471123": {
    "overal_rating": [
      "Score*",
      "3.250",
      "3.821",
      "3.250",
      "3.036",
      "3.036",
      "3.107"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.250",
      "3.821",
      "3.250",
      "3.036",
      "3.036",
      "3.107"
    ],
    "participant": "callumkeene",
    "game_title": "Mycelium",
    "platforms": [
      "web"
    ],
    "rating_count": 28,
    "comments_received": 22,
    "comments_raw": [
      "My favorite thing was the itch page description. Well written and helped me understand the setting and game! So many people don't write anything about their game and I'm confused why hahaha. I think my main suggestion for future versions would be an interactive tutorial. It was a little confusing even with the nice instructions, but that might be because I don't often play games like this. Creative interpretation of the theme! Who doesn't love mushrooms?! (Well I do anyway.) Shroom on!",
      "Mushroom",
      "A fun game with a lot of potential. Well done.",
      "Ah, you also went for more of a simulation game! Yours actually had some actual depth with player loops in a day cycle with multiple parallel actions the player would have to choose between, I only got a 1-2-3 upgrade in place by the end haha - I got 12 thriving trees after my season.",
      "Very clever idea. Your use of Cherry Blossoms sure made everything that much better! I've only seen them twice in person & they're absolutely beautiful. The pace of the gameplay was perfect. I thought some of the balance could use a small tweaking, but it definitely didn't take away from the experience. My ONLY issue is that there was not a fullscreen option. Not that big of a deal, but us old people can't see that well lol :)  I like your take on the 2 themes. This is a quality entry. Good luck going forward!!",
      "Nice job! the 20 sugar for only a fraction of energy felt a little unfair, but i like the theme and game loop! great job!",
      "Interesting take on the network theme! loved the literal use of the mycelium network. And great work on the art.",
      "Cool relaxing clicker game. I was sometime frustrated by the delay or unresponsive input maybe adding feedbacks when click is blocked would help. Not sure to understand the difference between minerals. Nice entry !",
      "I really like your art style!  Nice and relaxing but a little bit of strategy.  I would love to see this expand to have the different minerals have an effect!",
      "Original implementation of the theme and the modifier. Cute visuals. Pleasant to play, looking forward to the next round ;)",
      "",
      "I really like the overall art style! I was a bit confused on what the different ore types did, I think having them each serve a function would be nice. I did like seeing the trees grow over time. Good job!",
      "Good gameplay loop. I got off to a slow start but once I built more furnaces, the trees were soon getting planted",
      "I found this super fun, I thought the art was super cohesive as well. I'd enjoy replaying this in the future when you update the ores to have more functionality! I managed to get to 15 trees planted I think",
      "I like the idea, but having different ores doesnt seem to make that much of an impact on gameplay, maybe having the trees be colored differently depending on the ore would be much more fun, and also the days should automatically pass, its a bit frustrating to fill in all the furnaces and then while collecting sugar having to stop in the middle to press a button :| but the esthetics are really nice",
      "19 Trees later that cherry blossom season was saved :) The second time I went for all furnaces :P",
      "Fun little game! The bouncing mushroom animations are cute.",
      "15 trees planted and do i regret it Absolutely NOOOO!!!\nGood funn little gameâ\u0080¦",
      "Not sure if 16 is a good score but I am happy to put it out there and see who beat me :)",
      "Very nice animations.\nHad a good time playing and got to full furnaces pretty quickly, pretty satisfying.",
      "Loved the game, really looking forward to you working on the differences of the minerals as I love to min and max!!",
      "Really satisfying progression and fun gameplay loop. The art is very nice too. Awesome entry!"
    ],
    "comments_posted": 38,
    "created_at": "2024-01-14 23:53:34",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471123",
    "coolness": 38,
    "participant_info": {
      "profile_url": "https://itch.io/profile/callumkeene",
      "member_since": "05 August 2020",
      "posts": "88",
      "topics": null,
      "followers": "1",
      "following": "2"
    }
  },
  "2468013": {
    "overal_rating": [
      "Score*",
      "3.256",
      "2.943",
      "3.256",
      "3.056",
      "3.194",
      "2.630"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.467",
      "3.133",
      "3.467",
      "3.253",
      "3.400",
      "2.800"
    ],
    "participant": "steven-the-gamer",
    "game_title": "New Year Keeper",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 15,
    "comments_received": 10,
    "comments_raw": [
      "I really like the idea of destroying the meteors with fireworks, the only thing I would like is a bit faster firerate, as there are way more fireworks in the sky usually, but the game was fun",
      "As other said, really nice use of the two buttons! I like the art too. Might be cool if the person in the control panel area had some animation to go along with the movement and firing of the canon. Overall really great, and I like the new year theme :)",
      "Now if sending Bruce Willis doesn't work we can use our fireworks stock to destroy the asteroids ! I didn't manage to finish i feel like sometimes it's not possible but i may just be bad. Simple gameplay but cool idea and nice effects. Good job !",
      "Simple and fun, very good implementation of \"two buttons\"! The balance might need some slight tweaking if you want the player to be able to complete the night, I might just be bad at it but it doesn't seem possible to get every asteroid towards the end just based on the fire rate. That doesn't take too much away from the experience though, it reminded me a bit of Domekeeper!",
      "Destroying the meteors with fireworks is a good idea and the animation looks really nice",
      "Fun game and good use of the two buttons.",
      "Good job!  It was simple but cohesive.",
      "Nice visuals on the fireworks. A clever use of only 2 buttons.",
      "I love the juice in this game! The firework particles look great and I love the screen shake when you miss an asteroid :) Nice work!",
      "Nice use of the two button modifier!"
    ],
    "comments_posted": 1,
    "created_at": "2024-01-13 19:25:11",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2468013",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/steven-the-gamer",
      "member_since": "28 November 2018",
      "posts": "297",
      "topics": "22",
      "followers": "103",
      "following": "25"
    }
  },
  "2470956": {
    "overal_rating": [
      "Score*",
      "2.684",
      "2.789",
      "2.632",
      "3.105",
      "2.653",
      "2.053"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.684",
      "2.789",
      "2.632",
      "3.105",
      "2.653",
      "2.053"
    ],
    "participant": "marlin-media",
    "game_title": "Orb-It",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 12,
    "comments_raw": [
      "Nice clean game. Very cohesive gfx. Nice color selection. The theme is a little mysterious. Maybe add a little more in the game description about how you saw the fusion one in particular? But really solid entry!",
      "Great to see your game on this year's GDKO Marlin! I like these arcade games, they have inherit fun! For me the SFX was not an issue (as I was playing on silent). I would have liked a greater leaning on the theme a bit more, but I guess \"fusion\" and planets felt linked, and \"spectacle\" in this grander scale.",
      "As someone who lost many hours to the original Peggle in college and Peglin more recently, I'm excited to see how this one develops. Using AI art is an interesting twist and the concept is solid. I saw in replies to other comments that you weren't focused so much on polishing the other game elements, and I do think lack of sound design cuts into the enjoyment of the gameplay--for me, that's one of the most satisfying parts of these types of games. But the VFX were great!",
      "This got very satisfying once the orbs really started bouncing around.  Good job!",
      "",
      "This looks good. im surprised this game only used ai for the art. Are the UI elements also ai-generated? For the first round a solid entry, the art works good together and i like the animation of the bubbles popping :)",
      "Good title. The soldier and alien look cool and so too does the space background and the three different orbs. However, the gameplay could be improved in my opinion, as I had a problem with the bullet orb going through the wall and the gravity one if it bounces funny thus the game has to end as there's no launcher anymore. I did complete the game on another playthrough though with the gravity and shield orbs but I had to carefully use the bullet orb on one pesky placed one in the top right corner. In Construct 3, bullet stepping might fix the collisions. I didn't see a win screen or another level afterwards and the reset button didn't reset the game. This round is about the art so I guess some things like that can be ironed out in later rounds. I think it could be cool if you could have a max of 1 of each orb on the screen so that it speeds the gameplay and gives the player more to do. I'm thinking the spectacle of space was the theme you chose and the nuclear fusion of the stars was the fusion modifier but correct me if I'm wrong. Anyways, it's a pretty solid entry and sorry for rambling on",
      "Fun game with some interesting weapons to use.",
      "As some other's have said, I don't see how the theme fits. But i really liked the background effects you had going on, looks really cool.",
      "The visuals were nice and i like the idea of the game. i with there were more game elements though like a fail and win state",
      "Visuals and atmosphere are nice, your work on the VFX is on a good way (as said in the game description). Not sure where the theme fits (even after reading ProSmashy's comment ^^), anyway, good luck for this round !",
      "Well, the game certainly has awesome esthetics, but the modifier part kinda doesnâ\u0080\u0099t feel like you are combining the balls, Iâ\u0080\u0099ve understood it after messing around for a while,but there isnâ\u0080\u0099t any visual feedback (My 1st reaction was that I just swapped the balls)"
    ],
    "comments_posted": 18,
    "created_at": "2024-01-14 23:10:33",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470956",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/marlin-media",
      "member_since": "06 March 2019",
      "posts": "255",
      "topics": "5",
      "followers": "49",
      "following": "72"
    }
  },
  "2450424": {
    "overal_rating": [
      "Score*",
      "4.263",
      "4.211",
      "4.368",
      "3.926",
      "3.526",
      "3.263"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.263",
      "4.211",
      "4.368",
      "3.926",
      "3.526",
      "3.263"
    ],
    "participant": "zedrick1435167gmailcom",
    "game_title": "Overpowered Loli Elven Mage",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 12,
    "comments_raw": [
      "Very nice pixel art!",
      "Beautiful Game :))\nI like the fireball attack",
      "Such a great idea that was will executed. The different combinations were fun to play around with.",
      "This is quite an impressive system you have going thus far! It reminds me a bit of invoker from DOTA, and nowadays Hwei from League. Definitely very complex with a steep learning curve, but cool nonetheless.",
      "Frieren <3",
      "The art and all of the effects are amazing! So many combinations too and I love how combining the orbs in different ways is what creates the different spells to attack the dummy. My only complaint I have is that I wish the controls were different and that's probably my personal preference but I'd prefer to move with left click and use spells with right click",
      "Really great art and special effects!  There are so many spells and they all look impressive.",
      "Wow i am very impressed by this entry! i really wish you had more time to work on it but it makes sense you had 2 other jams going on. all the combos were impressive! great entry!",
      "This is a super cool demo! The art and vfx look amazing and after messing around and learning some combinations it was super fun trying to combo the dummy. I could see this working really well as a full game. Awesome job :)",
      "I love this concept!! Your artwork is always so good! The different combinations make this game re-playable. Your games are always nicely polished and fun to play. The controls took me a minute to get familiar with. But after awhile, the feel of everything meshed well together. Great work!! (as usual:)",
      "I know it's incomplete, but still super impressive.  The art is incredible, and I feel like I'd play a full game of this.",
      "Took me a second to wrap my head around the gameplay. Kind of a cool slot machine fusion style mixed with some furious clicking. Some of the skills were pretty badass looking. A little difficult for me, but just mashing on q/w/e/r gave some fun results."
    ],
    "comments_posted": 2,
    "created_at": "2024-01-11 05:21:00",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2450424",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zedrick1435167gmailcom",
      "member_since": "23 June 2020",
      "posts": "1,440",
      "topics": "45",
      "followers": "77",
      "following": "4"
    }
  },
  "2467453": {
    "overal_rating": [
      "Score*",
      "4.435",
      "4.252",
      "4.391",
      "4.565",
      "3.913",
      "3.957"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.435",
      "4.252",
      "4.391",
      "4.565",
      "3.913",
      "3.957"
    ],
    "participant": "hugbug",
    "game_title": "Phasmoscope",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 15,
    "comments_raw": [
      "This is so cool. You absolutely nailed it, nice work :)",
      "Bruh ð\u009f¤¯ , wtf is the art >>>>>>>\nMy first 10/10 game on basis of art and integrationsâ\u0080¦.",
      "I managed to banish the murderous ghost and win the game. The art is really great, even the description page is done really well too. Amazing game all round",
      "This is incredible. I think your choice to homebrew your own WebGL worked out really well for Itch integration. It adds so much to the experience. The art is obviously top notch, but the music and sound effects add a ton of creepy atmosphere.",
      "This is amazing! The atmosphere is soo good. The tiny view through the spectacles got me on the edge of the seat trying to see more and leaning ever closer to the screen. It was spooky  (no jumpscares, thats a good thing) and the atmosphere was scary. Definetly one of the best games in the jam. I dont even want to start on the game page. The design is something i never saw before and you did things I didnt even know were possible. Keep up the good work, I am curious to see what you create next!",
      "Impressive work for two weeks. The idea is great, i found the view too small. Ambiance and story are well made, congrats !",
      "Super unique take on the theme making the view window in the shape of glasses. Added very nicely to the spooky and claustrophobic atmosphere. Might be cool to add some particle effects to separate the different areas - for example maybe rain outside, dust particles in the basement, smoke near the fireplace. Overall really great and I'd love to play more if you ever expand on the idea.",
      "Incredible work for only two weeks! The atmosphere, narration, and overall polish are all very spectacularly (haha on theme) well done.",
      "Very impressive game. Only complaint is the view through the spectacles was too small, had to zoom in to see anything.",
      "All the art is incredibly polished and well made. The atmosphere is really spooky, with the voice lines and ambience. Very good!",
      "This was an extremely cool game!  Holy cow!  Even the voice calls and intro visuals were fantastic.  You nailed all the little details.  My only feedback was that maybe the spectacle window could have been a little bigger?  It took a bit to adjust to.  Even so, really cool game, VERY impressive to have that level of detail for a two week jam.  I could see this turning into a full game, or even a VR game!",
      "Wow that was pretty mind blowing well done - I will have to revisit as I mainly explored and possibly went a little of track e.g. I was in the attic by the bible when it told me to enter the house. But what I saw and the landing page were top notch.",
      "Great spooky game. I was fun running through the house trying to find all the items while looking out for a ghost. I didn't see a ghost but manage to banish it. I'll come back to this to and see if I can be attacked by the ghost.",
      "The overall art and vibe of this game is the best I've seen so far, it was incredible. The way the player looks through spectacles to see, and the fisheye effect are greatly done, I do wish the gameplay itself had more pace to it however. It may have been a me issue, as I was not able to find the salt, and then went downstairs and apparently had the salt the entire time, but otherwise amazing entry!",
      "Excellent job with the narration and effects . You nailed the 'atmosphere'. I clipped through a wall and couldn't move anywhere. So I didn't play all the way through. But what I did play, was really well done!!"
    ],
    "comments_posted": 32,
    "created_at": "2024-01-14 23:58:09",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2467453",
    "coolness": 34,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hugbug",
      "member_since": "30 June 2022",
      "posts": "397",
      "topics": "8",
      "followers": "87",
      "following": "33"
    }
  },
  "2456609": {
    "overal_rating": [
      "Score*",
      "0.542",
      "0.542",
      "0.542",
      "0.542",
      "0.542",
      "0.542"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "1.000",
      "1.000",
      "1.000",
      "1.000",
      "1.000",
      "1.000"
    ],
    "participant": "thatonecheesecake248",
    "game_title": "Pipe Dodger Get Birder",
    "platforms": [
      "windows"
    ],
    "rating_count": 5,
    "comments_received": 1,
    "comments_raw": [
      "Unfortunetly no game in sight. Maybe next year :("
    ],
    "comments_posted": 0,
    "created_at": "2024-01-05 23:47:02",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2456609",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/thatonecheesecake248",
      "member_since": "03 January 2024",
      "posts": "0",
      "topics": null,
      "followers": null,
      "following": null
    }
  },
  "2469144": {
    "overal_rating": [
      "Score*",
      "3.092",
      "2.668",
      "2.437",
      "2.001",
      "2.486",
      "1.940"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.188",
      "2.750",
      "2.513",
      "2.063",
      "2.563",
      "2.000"
    ],
    "participant": "projectpaddy",
    "game_title": "PlanetaryFireworkDefence",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 6,
    "comments_raw": [
      "The fireworks look really great and I like the drawer animation, although it was difficult to drag them out at times and when dragging it over the red buttons it spins the wheel so I had to be more careful on that bit. I think it would be beneficial if the firework colours were exactly the same as the spaceships. Everything looks great and everything is explained well and I even managed to take out a good number of enemy ships whilst also seeing nice firework display in the process, awesome!",
      "This game was a cool concept and visually created a spectacle using fire works to defend the earth. Could benefit from a slower more guided start teaching controls and gameplay concepts. Sound and presentation was solid, great game ð\u009f\u0098\u0080",
      "Interesting concept. Took some time for me to figure it out, but it was fun once I got it.",
      "I'm a little confused about the controls, but it's cool how you mixed 2d and 3d here. I'm guessing that's the fusion part?",
      "This was a really cool idea.  I think for a game with really different controls, it can feel less intuitive at first, so I think a little more tutorial would have helped, but I liked it!",
      "I was a bit confused on how to load up the bullets at first, but after that it was a cool concept to switch between two screens to fight. Nice job!"
    ],
    "comments_posted": 2,
    "created_at": "2024-01-14 01:21:21",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469144",
    "coolness": 29,
    "participant_info": {
      "profile_url": "https://itch.io/profile/projectpaddy",
      "member_since": "24 November 2020",
      "posts": "177",
      "topics": "3",
      "followers": "21",
      "following": "186"
    }
  },
  "2464861": {
    "overal_rating": [
      "Score*",
      "4.184",
      "3.759",
      "3.735",
      "3.517",
      "3.941",
      "3.274"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.313",
      "3.875",
      "3.850",
      "3.625",
      "4.063",
      "3.375"
    ],
    "participant": "wolfenrahd",
    "game_title": "Project Nendou",
    "platforms": [
      "windows",
      "osx",
      "linux",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 10,
    "comments_raw": [
      "This game looks really well made, and it definitelly needs some more content, I read how it relates to the theme, it kinda makes sense, but it isnâ\u0080\u0099t really obviousâ\u0080¦  maybe you could have added so the scientist go to the other rooom with cameras, and then you are released on purpose, rather than an â\u0080\u009caccidentâ\u0080\u009d overall the game is really fun, and looks so stunning",
      "I liked the mix of physical and psychic attacks and building weapons from the remains of the defeated enemies. The effect when you get to crush the drones was great. Had a lot of fun playing this and the art style was great as well.",
      "Really cool art style. The effect on the character's hair and the cables really impressed me. Very cohesive, this looks great!",
      "For this roundâ\u0080\u0099s criteria, Iâ\u0080\u0099d say itâ\u0080\u0099s definitely a fun and cohesive style! The hair flowing animation was a nice touch as well. Felt a little light on the connection to the theme is the only nit in that regard.",
      "This was really cool!  Right away the art and story grabbed my attention.  Would love to see this expanded into a full game!",
      "This is incredible, such an awesome ability and you've presented it all so well too",
      "This is an awesome entry! The art and atmosphere are great and the juicy particles and shaders make it feel awesome, nice job :)",
      "Amazing! I really hope you keep working on the game i love the feel and atmosphere. I am really impressed with how much you were able to get done!",
      "Atmosphere is reallllllyyyy good here, and the use of procedural pixel art goes a great overall look to the game. The telekinesis power is great, want to see more of this so i can crush more bots.",
      "What you have is really nice. The art gives me \"Another World\" vibes. You've created an eerie atmosphere, and I like it!!"
    ],
    "comments_posted": 6,
    "created_at": "2024-01-14 23:57:28",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2464861",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/wolfenrahd",
      "member_since": "11 October 2016",
      "posts": "134",
      "topics": "2",
      "followers": "57",
      "following": "35"
    }
  },
  "2457475": {
    "overal_rating": [
      "Score*",
      "4.684",
      "4.316",
      "4.368",
      "4.179",
      "3.895",
      "3.632"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.684",
      "4.316",
      "4.368",
      "4.179",
      "3.895",
      "3.632"
    ],
    "participant": "mrbundles",
    "game_title": "Pupils",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 19,
    "comments_received": 16,
    "comments_raw": [
      "The spectacle mechanic was implemented very well, and I liked how well the mechanics of leading the tiny creatures and switching worlds was implemented (especially on the main menu)! I'd suggest allowing the player to switch to a different spectacle color, even when they have the \"circle\" spectacle up, by clicking on a different color on the wheel, rather than having to right click to cancel.",
      "gAME LOOKS GOOD WOULD HAVE BEEN MORE FUN IF MY JUMP WORKED TWT",
      "The jump wasn't working on my laptop, or another laptop, but it worked on my desktop. Well done game that was well polished and looked great!",
      "unfortunately, I can rate this correctly but from what I have scene I think it looks fun lol ,",
      "I love the way you change colours its super satisfying. Unfortunately I ran into the jump bug as well so I couldn't play too much, but the aesthetics are awesome great job :)",
      "So good! wish there was more to play",
      "Looks like I unfortunately ran into the jump bug as well (tried on both Chrome and Firefox, also I'm on Windows 10). Like others though, I don't hold it against you too much, because I can tell there's a lot of polish and juice in this entry! I really wish I could play it properly, let me know when you get the jump fixed.",
      "This art style, with all the juice, flows together really nicely! I enjoyed how it showed a preview of the next color as you were picking it, that was a cool effect. I wish the little following squishy guys had more of a function however, maybe pushing buttons, just doing something other than \"follow player\". I also liked how the UI looked in the corners, and the animation when hovering. Great entry!",
      "I managed to reach the end and get to squish school. The spectacles are a great game mechanic and I liked the colours, rounded edges on platforms as well as the general squishiness of the characters",
      "Amazing entry!! I am really looking forward to you continuing this in round 2! I really loved it!",
      "I LOVED this one.  The visuals were so good.  Very impressed with the way you could look with a lens before activating.  All the stars for this.",
      "Love the smooth animations and masking!",
      "I also had the jump bug so I couldn't play the actual levels (tested on both firefox and chrome). However this is such a cool concept and everything else is so well executed that I can't hold it against you or the entry at all.",
      "Cool entry ! The switching mechanics is a bit tedious and i would have loved to be able to pass just by hovering the circle (not changing the whole level). Anyway the idea and artstyle are amazing. Good job !",
      "Holy cow, I'm extremely impressed. This game is so polished and satisfying to play. I absolutely love the core mechanic and I would play so much of this in a full game.",
      "I can't seem to figure out how to get past the first level. Seems like it's not jumping high enough?"
    ],
    "comments_posted": 17,
    "created_at": "2024-01-14 23:53:59",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2457475",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mrbundles",
      "member_since": "11 April 2020",
      "posts": "623",
      "topics": "5",
      "followers": "60",
      "following": "1"
    }
  },
  "2470700": {
    "overal_rating": [
      "Score*",
      "3.824",
      "3.565",
      "3.954",
      "3.034",
      "2.139",
      "1.685"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.214",
      "3.929",
      "4.357",
      "3.343",
      "2.357",
      "1.857"
    ],
    "participant": "foozlecc",
    "game_title": "ReapersReap.io",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 7,
    "comments_raw": [
      "The game looks good, and I like the planting and growing crops.",
      "Even though the game isn't as finished as you'd like, you've still managed to create quite a lot actually and there's always room to expand it in future rounds. Also the art is excellent and really nicely animated",
      "beautiful graphics! i love idle farm games so it would be awesome to see this idea completed! I really enjoyed the scene and atmosphere! I know you didnt get everything done in time but what you do have is well polished! great job!",
      "Cool Art and \"game juice!\" Do you have plans on working on the game more? Also where you able to use the Spacespy - minute? Just wounding.",
      "This game looks super good.  Interested to see how it grows!",
      "Love the atmosphere! Your pixel-art-game is always on point. You did some really interesting things with the path finding. I like it! Doors/gates opening on their own is a nice touch too. I was looking forward to see what you'd come up with in the 1st round. Did not disappoint :)",
      "Pretty cool demo for online functionality, I know construct isnt the best for it (I did online leaderboards for my entry). the art is really nice, and I enjoy when characters are randomized. A small tutorial would have been great, as at first I was a bit confused on what to do, until I started clicking around and found the other scene by hitting the top sickle. A transition also would have been nice here, as it pauses for a bit when switching between the screens. Once again though, the pixel art is great, I almost want to use it to make another small game after this jam is up lol"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 20:14:11",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470700",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/foozlecc",
      "member_since": "13 January 2020",
      "posts": "203",
      "topics": "4",
      "followers": "1,220",
      "following": "45"
    }
  },
  "2470917": {
    "overal_rating": [
      "Score*",
      "2.998",
      "2.925",
      "3.071",
      "2.706",
      "2.633",
      "1.901"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.727",
      "3.636",
      "3.818",
      "3.364",
      "3.273",
      "2.364"
    ],
    "participant": "velzyyt",
    "game_title": "Rouge Fusion",
    "platforms": [
      "web"
    ],
    "rating_count": 11,
    "comments_received": 9,
    "comments_raw": [
      "I know life sucks, but you did some amazing art, which is a focus of this round, I wouldnâ\u0080\u0099t count you out just yet, and thereâ\u0080\u0099s a wildcard so the judges could give you a second chance afterall",
      "The player walk cycle looks really good. I also like, that theres a different sprite for jumping, which fits. There are a lot of cool little details in the room. Good thing your better now, i am excited to see your project next year :D",
      "What little was there, I really liked. Sorry about having to go hospital.",
      "So sorry to hear you had to go to the hospital!  I know that can be hard when life happens when you're excited to work on something.  But also, this round is mostly focused on art, and your art was a lot of fun!  Don't count yourself out just yet.  You might still have a chance.",
      "The intro was promising ! Congrats for submitting. Hope you stay well !",
      "Look the hardest part is actually submiting your game, honestly. Good job on wrapping up what you had and also having the curage to submit it! It really is a good start and it left me with wanting to know more!!",
      "I hope you stay well. What you've made is awesome, I like the art and storyline and general direction the game is going in",
      "Hey, it's awesome that you submitted what you had. This is the art round, and you've got some great art it's clear you spent a lot of time making.",
      "hope you get well soon. â\u0099¥ï¸\u008f"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 22:13:30",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470917",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/velzyyt",
      "member_since": "07 May 2023",
      "posts": "9",
      "topics": "2",
      "followers": "1",
      "following": "3"
    }
  },
  "2470572": {
    "overal_rating": [
      "Score*",
      "3.306",
      "3.695",
      "3.047",
      "3.137",
      "2.722",
      "2.917"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.643",
      "4.071",
      "3.357",
      "3.457",
      "3.000",
      "3.214"
    ],
    "participant": "helloimtw",
    "game_title": "SPECTACULAR SPECTACLES",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 8,
    "comments_raw": [
      "Great game, love the movement of the eyes as if, \"Don't you dare add more stickers to my glasses\".",
      "Great idea for a game and I'm especially liking the eye movement",
      "This is a fun minigame. I noticed that the character gets randomised when starting the game. On the second try I got one with a monocle. Was pretty fun :)",
      "This was super fun! I loved the art style, and I think you implemented the theme and modifier well!",
      "Great art style!",
      "I really liked the art style!  I got Mario party mini-game vibes from the gameplay, too.",
      "Dang guy won't sit still. A fun entry.",
      "The art matches the gameplay really well. I really like the simplicity and quirkiness. Reminds me of the WarioWare games. Might be good to add some kind of animation or effect to hint at when the person is about to move. Overall really great!"
    ],
    "comments_posted": 1,
    "created_at": "2024-01-14 18:40:36",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470572",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/helloimtw",
      "member_since": "18 December 2016",
      "posts": "11",
      "topics": null,
      "followers": "12",
      "following": "1"
    }
  },
  "2466521": {
    "overal_rating": [
      "Score*",
      "3.652",
      "4.000",
      "3.304",
      "3.391",
      "2.957",
      "3.043"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.652",
      "4.000",
      "3.304",
      "3.391",
      "2.957",
      "3.043"
    ],
    "participant": "ricotv",
    "game_title": "Sakura Spring",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 14,
    "comments_raw": [
      "Colors and fonts and everything really hangs together. The gameplay was a little simplistic, but HEY that's totally okay since this round was all about the graphics. Big score on both themes for me. THANK YOU THANK YOU for explaining how your game applied to the theme. I don't understand why everyone doesn't do that. Hahaha. Biggest vote for next version would be a proper walk cycle for the heroine... but that's a lot of pixel work and I completely get why you chose to get the core game working great before worrying about that. The game image (icon? splash? you know, the thingy that shows up in the submission list) is the best of the jam for me. Colorful and inviting. Nice work.",
      "I like this game. A very cute idea. I love the way everything looks, it has the realistic pixel vibe that some games had back in the 90s when they were more limited in resolution. This is definitely high on my list of games this round.",
      "The tree art is amazing, well done! I did find it odd how the fireballs didn't go away with the umbrella up, it was hard to tell when you blocked them since they didn't have feedback. I did like how there was the flowers falling to just throw you off, nice entry!",
      "Nice art ! Game was slow but that gave a nice mood to it. Congrats !",
      "The artwork in the game is really great. It was pretty fun.",
      "I love the art, and I really enjoyed playing this! Sometimes I was a bit confused on whether I got hit or not, but it was still super fun! I loved the mechanics with the umbrella as well, required a bit of strategy deciding whether to risk getting hit to pick one up.",
      "Good job, Sorry if I get a little nit picky at the end but   I do I a few suggestions/some feedback, ,a little more feedback to player when getting hit or maybe even when collecting coins would be nice, I would have like to see some sort of oh hey the timer is going to run out so maybe speed up the music or something idk, Idk how optimized the visual scripting is but there is a bit of a delay between clicking any menu button and going to where the button takes you I pressed the story then the score board and the story started to play a few seconds after entering the score board, a custom cursor for the mouse I often found myself having to shake my mouse to figure out when  it was or maybe a hover effect maybe just a lighter tint on the menu buttons if anything , I felt The players art was not an exact match for the art in your game, other then that not issue with game play Good job and Good luck",
      "I really liked this game! The visual style, the music and sounds and especially the leaderboards. (as you can probably tell if XD, im on there quiet a bit) also if anyone can beat my score ill be back! Great job!",
      "I really like the visuals, and the music fits really well, but the hit sound is just hilarious, and also I think its a pretty unique mechanic of choosing between defending/colleting points that could defintelly be explored moreâ\u0080¦",
      "The art is really nice. The blocking and picking up is a good mechanic, it has a lot of potetial. Cherry Blossoms are quite spectacular indeed.",
      "All of the artwork is nice which is the main focus this round.  I really liked the gameplay, especially having the ability of lifting and lowering the parasol. There are some things that could be improved - the character walk animation and the score doesn't seem to match the leaderboard score but having a leaderboard is awesome",
      "I liked the coin collection method â\u0080¦. also the dragon can we have its power ?>////",
      "Really lovely art, and I really liked your use of multi-layer parallax!",
      "Your game caught my eye because my entry also includes sakura trees. :) Your game's visuals are lovely, and everything is implemented well! It's a fun little game and pretty responsive."
    ],
    "comments_posted": 8,
    "created_at": "2024-01-12 09:53:01",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2466521",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ricotv",
      "member_since": "21 March 2021",
      "posts": "697",
      "topics": "6",
      "followers": "13",
      "following": "13"
    }
  },
  "2471103": {
    "overal_rating": [
      "Score*",
      "2.204",
      "2.074",
      "2.334",
      "2.035",
      "1.880",
      "1.685"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.429",
      "2.286",
      "2.571",
      "2.243",
      "2.071",
      "1.857"
    ],
    "participant": "ansel-games",
    "game_title": "Samurai",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 6,
    "comments_raw": [
      "Very neat game. It's interesting seeing a multiplayer game in a game jam. I think I'll have to try it out with a friend to truly appreciate it, though.",
      "The game has a lot of good things going for it, the art style and the concept are great.",
      "You got a LOT done in just one day of development.\nThe art looks great and the music fits well.",
      "A little buggy with when text pops up and how long the sword interaction holds (though maybe thatâ\u0080\u0099s actually intentional and I just didnâ\u0080\u0099t read it that way), but nice to see a few stages to give a sense of the variety this world can give. Music fits nicely, and the sprites themselves are really solid. Not bad for one day of development to be clear, I wouldnâ\u0080\u0099t have made it as far!",
      "For only having worked on it one day, this is quite impressive.  The time scale slow on kill effect was a really good touch.  And having multiple stages was cool.  Wasn't expecting that on the first playthrough.",
      "It being two players made it hard to test out, but the overall concept is pretty cool. I like the samurai art, nice job!"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:46:54",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471103",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ansel-games",
      "member_since": "19 November 2020",
      "posts": "354",
      "topics": "61",
      "followers": "59",
      "following": "32"
    }
  },
  "2468636": {
    "overal_rating": [
      "Score*",
      "3.068",
      "3.221",
      "2.914",
      "2.608",
      "2.608",
      "3.068"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "4.200",
      "3.800",
      "3.400",
      "3.400",
      "4.000"
    ],
    "participant": "aerial301",
    "game_title": "Scraper",
    "platforms": [
      "web"
    ],
    "rating_count": 10,
    "comments_received": 6,
    "comments_raw": [
      "This is really nice. The gameplay loop is solid, I could see this turning into a cool rogue-like or something. The art and fx work really well too. Particularly like the mining sound effect, was very satisfying. Nice job :)",
      "Very fun gameplay loop, I like the spectacle feature and all the game juice while shooting. Neat game!",
      "This is a really good entry! I love the approach to the theme and the modifier. Great game design :) The art works well togherther. I didnt like the pixelated effect, it was a bit hard on the eyes. I think it is the way, the camera moves smoothly to the player. Maybe try an instant moving camera on that effect.",
      "With a few more things added I think this could become a really cool rogue like!  Good job!",
      "game was great, really fun but a bit repetitive",
      "As is I really enjoyed it, but I can see this game getting even better by adding more and more to it. Well done."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 16:34:01",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2468636",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/aerial301",
      "member_since": "12 November 2022",
      "posts": "312",
      "topics": null,
      "followers": "9",
      "following": "7"
    }
  },
  "2469236": {
    "overal_rating": [
      "Score*",
      "4.703",
      "4.292",
      "4.378",
      "4.378",
      "3.892",
      "4.108"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.703",
      "4.292",
      "4.378",
      "4.378",
      "3.892",
      "4.108"
    ],
    "participant": "h4zm4tt",
    "game_title": "Sir Spectacles' Spectacular Spectacle",
    "platforms": [
      "web"
    ],
    "rating_count": 37,
    "comments_received": 26,
    "comments_raw": [
      "Really great entry with a great art style. Can't wait to see more.",
      "This works so well on so many levels! The artwork and effects used really sells the theme(s). The whole experience legitimately felt like watching an old film reel with scratches and wobbly frames. Your storyline had me laughing and made the game even more enjoyable. That music clearly matches the artwork... perfectly! The simplicity of the game allows you to enjoy the show while still satisfying a nice little boss battle. A job well done!!",
      "Great job! I really like the aesthetic and visuals. It could use some volume control in round 2, but i dont really have anything bad to say. You did a great job. I love the story so far and I am looking forward to chapter 2",
      "Great entry given the criteria. Really nice package with a great cohesive art style. Really enjoyed playing this as well.",
      "Short, fun, silly, and sticks the landing with the ending! I think the old film effect could be toned downat least a little, but I can also appreciate wanting to ramp it up to 11 for the art-round entry of GDKO. Also love the idea enemy combo of spectacle vs monocle, nicely played! Looking forward to seeing this rivalry expand, unless indeed it was their inevitable death I guess haha (next round = prequel??)",
      "You did a LOT with a little! It feels like you scoped this really well. The boss fight is fun and engaging without being difficult. The effects really sell the game, though--especially the film grain. That combined with the sound design for the projector and the ragtime music made for an excellent experience.",
      "Dear Sir Spectacles!,\nYou have bravely fought against the 8 handed monsterâ\u0080¦\nI wanted you to win and deep in my heart i do believe that you defeated it.\nBut am eagerly waiting to have your SPECTACULOOOR entry back ..\nRegards\nDev",
      "You did a great job with this one. The story and characters are charming and the aesthetic is spot on. Love it :)",
      "Great artstyle! I love all the animations, the game feels really polished. The bossfight is very fun. Well done!",
      "This game is beautiful! I love the old film visuals and the piano music hits perfect. Thanks for making this, i loved it",
      "Really fun entry. Like alot of other have said you truly transported me back to the era of silent films. The presentation truly kicks ass. I had to go and show a couple of friends while playing it was so good. I love how you did spectacle in a couple of different ways. I feel like the player is a spectator, the story line was spectacle focused and the character designs, to the explosion at the end. ALSO love the story, Im a sucker for any narrative. Id love to see what happens next.",
      "Love the silent film aesthetic. Great use of the theme. I can't wait to see where you go with this.",
      "I hope you continue the game, it's really excellent! The storytelling is good and the vintage aesthetics are a nice touch and I love the eyes and birds animation on Mr Monacle too",
      "You are now using the modifier more as a part of the story, you could have leaned more into making the modifier part of the gameplay.",
      "It's short but really nice entry ! You nailed the silent movie aesthetic perfectly. I want this to be continued on next round !!",
      "First thing to stand out was great story telling along with a good sense of humour :), you were the first one I played so you may have got some free bonus points as I have no comparisons. With your tip I am glad I got the full experience, to be continued...",
      "The art style is absolutely incredible, it's so cohesive and unique! I especially loved the opening sequence the 3 2 1 was just so perfect!! It was super fun to play as well, hopefully one day will find out what happens next!",
      "Very fun lil game! Loved the art style and the old-timey look of things! I know you'll get this a lot, but it definitely gave me Cuphead vibes!",
      "Loved your game",
      "You pulled off old-timey black and white film vibe really well. The sprite animations are really good too. I think the explosion at the end could've been expanded with more effects/sounds to give a better pay-off for winning.",
      "Love this game! Whats going to happen next????",
      "This was a really good game! The art was absolutely amazing and had a lot of charm. I also really loved that grain on the camera as well as the slight shake which made it feel like a real old movie.  I did find the gameplay a little simple but I know this isn't really the round for that. I cant wait to see where this game goes!",
      "Beautiful entry, can't believe I hadn't gotten to this one yet! You've absolutely nailed the old-timey aesthetic, and have me hooked on how it'll continue. Would love to see you develop this game further!",
      "You really got me hooked, I want to find out what happens next so baaaad, and I love how the name of the game is a pretty tough toungue twister",
      "BEST WRITING OF THE JAM. Seriously, made me laugh out loud. The old timey scratch look is so good. Super smart move to get fusion into the game in like, ten ways it felt like hahahaha. The game itself is a little basic, but that's cool. Not the point of this round! Gosh... if I had to think of a couple of suggestions... 1) it would be nice to be able to click to advance / skip the intro, for like when you come back to play again. 2) I like the idea of the different fonts for the characters, but I think the handwritten font doesn't quite fit the old timey theme as well as the main fonts. Anyhoo, great entry.",
      "I pressed F and the game died, I think I found the secret ending. Anyways pretty basic but fun and looks nice with the retro vibe. I like it."
    ],
    "comments_posted": 60,
    "created_at": "2024-01-14 01:03:43",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469236",
    "coolness": 73,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "200",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "2471143": {
    "overal_rating": [
      "Score*",
      "2.623",
      "2.623",
      "2.825",
      "2.435",
      "2.220",
      "1.883"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.000",
      "3.231",
      "2.785",
      "2.538",
      "2.154"
    ],
    "participant": "gosha-xe1ox",
    "game_title": "Slime Tower",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 9,
    "comments_raw": [
      "I really like the artstyle on this game, its so cute, as others have mentioned, some animations and/or effects wouldnt be bad, and thereâ\u0080\u0099s a small problem when the charather falls, you canâ\u0080\u0099t get back up so easily as the camera stays on that part of the tower, but overall this is a sweet and cute game",
      "Fun little game! The art and sound design fit really well together. I agree with others that I wish there was more juice. I especially would have liked smoother screen transitions between levels. I also had an issue where I just couldn't do the next level because it didn't seem to link up to the one before it in terms of collision shapes.",
      "Great to see a fellow blob game :)",
      "I'm always down for a fun little jumping game.",
      "For only having 2 days to work on it, this is nice.  The basics are all there.",
      "I really enjoyed the fact your HP falls constantly, and it is at the same part with the timer. So as a player I only have to look at one part. Great work on such a complex game! And at making all the art I assume!",
      "As others have mentioned, a little bit more animation and juice would have been nice, but it's a very fun and intuitive little game!  I liked that I could tell what was going on, and the little collectibles were very clear on what they did.",
      "The design of the monsters isn't too bad and I like that you've got one that moves sideways, I would have loved to see more movement and animation in the other ones. There is quite a number of bugs but considering you made the game in just 2 days, it's kinda expected and you've done pretty well with the time you had",
      "Though at first I thought it was a bit broken, after a couple tries I was able to get past the second room frame. An interesting idea of a game, combining these two genres! Though still a little rough around the edges in terms of falling off the edge or being clear how to jump up to a next stage when thereâ\u0080\u0099s not another platform. From the art perspective (this roundâ\u0080\u0099s theme), was a simplistic - could have used a little supporting animation on the characters or movement."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-16 14:17:46",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471143",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gosha-xe1ox",
      "member_since": "08 October 2022",
      "posts": "26",
      "topics": null,
      "followers": "1",
      "following": "2"
    }
  },
  "2470954": {
    "overal_rating": [
      "Score*",
      "3.500",
      "3.889",
      "3.389",
      "3.256",
      "3.000",
      "2.500"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "3.889",
      "3.389",
      "3.256",
      "3.000",
      "2.500"
    ],
    "participant": "jhice",
    "game_title": "Snap Cards Fusion",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 10,
    "comments_raw": [
      "I really liked the art and juice in this. Would have been great if you had time to implement a little more.",
      "loved the nice confetti popping up! I'm always fascinated with video card games, great, classy choice of art!",
      "The art on the cards is really nice and I like that they are set at a little angle so it looks good when stacking them. As Spike Studio already mentioned, I too think it would be better if you could have all the cards to snap with. I think a time limit to sort each round would be cool and if you make a mistake the game ends, perhaps getting faster each round. Really good game and the screen shake and confetti were great",
      "The juice when placing a card was really nice! I enjoyed the confetti, I so wish I was able to sort all cards though, instead of just the first 3 I decided to go with. I also liked the art of the cards, nice job!",
      "I like the idea, but it feels like you are limited to just 3 pairs of cards, which is a shame, however the game looks really nice and polished, and I like the confetti when you pair up the cards",
      "nice visuals and effects. I would like to see a game loop added on to this project I think you have a good framework for a fun and visually interesting card game!",
      "Great game feel to this, very satisfying animations and screenshake.  The visuals all work together really nicely. Nice work :)",
      "Simple, fun little game! The tweens were great and the cymbal crash added so much to it. I enjoyed trying to time the crash to the music, too.",
      "Nice job on the cards and animating them in & out. Something about the cymbal crash and screen shake that made the whole thing feel satisfying :)",
      "Thanks for the rating and the kind comment Marlin !Will check your game ASAP."
    ],
    "comments_posted": 6,
    "created_at": "2024-01-14 22:35:51",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470954",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jhice",
      "member_since": "25 May 2015",
      "posts": "121",
      "topics": "2",
      "followers": "18",
      "following": "21"
    }
  },
  "2470078": {
    "overal_rating": [
      "Score*",
      "2.744",
      "2.830",
      "2.693",
      "2.572",
      "2.830",
      "2.487"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "4.125",
      "3.925",
      "3.750",
      "4.125",
      "3.625"
    ],
    "participant": "potatuetata",
    "game_title": "Space PewPew",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 8,
    "comments_received": 8,
    "comments_raw": [
      "Really nice shooter game. The turret shot are a bit hard to avoid but it look like it doesn't stop you from playing. The music and art are fitting well together ! Congrats !",
      "OH NOOOOO! I don't have a PC so I can't play this game. (I'm on a mac.) It looks so nice from the screenshots. Any chance you could post a video? Obviously a web build would be incredible, but maybe that's not doable with the shaders and stuff. Thanks so much for playing my game and sharing feedback, regardless! Good luck with the jam!",
      "I really liked this game. The art and controls were pretty good, reminds of some 90s PC games I loved when I was a kid.",
      "GameMaker 2 squad represent!  The controls felt super smooth, and the recoil on shooting felt really great.  One thing I'd suggest is maybe less crisp edges around the enemy ship to make it look more natural, but overall the art was good and it was super fun!  Great job!",
      "Ah, my favorite GM2 developer! I was very interested to see what you did with the new particle system. Great job on all the visuals. The mechanics of the game (controls, knockback, etc.) felt just like I expected them to. Great work as usual!!!",
      "",
      "Very responsive game! I loved the knockback on the rockets. Made the shooting feel a lot more visceral. Great use of music and SFX, too.",
      "The movement in this game is so fun! Really liked all the visual effects and feedback, it made the shooting extremely satisfying. Nice job :)"
    ],
    "comments_posted": 42,
    "created_at": "2024-01-14 13:27:55",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470078",
    "coolness": 61,
    "participant_info": {
      "profile_url": "https://itch.io/profile/potatuetata",
      "member_since": "02 December 2018",
      "posts": "123",
      "topics": "1",
      "followers": "9",
      "following": "4"
    }
  },
  "2464736": {
    "overal_rating": [
      "Score*",
      "2.787",
      "2.787",
      "2.787",
      "2.269",
      "2.437",
      "1.556"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.071",
      "3.071",
      "3.071",
      "2.500",
      "2.686",
      "1.714"
    ],
    "participant": "vantaghost",
    "game_title": "Space Shooter",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 6,
    "comments_raw": [
      "There's something to be said for a nice arcade game that follows a known formula. Very fun to play and easy to understand. I like that you experimented with 3D ships instead of just pixel sprites, and I could tell there was a lot of thought in the background and particles back there.",
      "One of my favorite genre of games growing up. Well done with a good variety of enemies.  Only thing missing were some power ups. Well done.",
      "Nice entry! I appreciate the boss fight at the end! most games in this style are never ending so it felt really good to beat it. it was well done!",
      "Nice simple arcade game, really enjoyed the hit flash when your bullets hit enemies. I did find it a bit hard, maybe having the enemies shoot slower, or even convey their shoot with an animation before they fire would be nice. I also really liked the background graphics, nice entry!",
      "Really good fun, I liked the different attacks that the drone fighters did and I made it to the end :) The only thing that comes to my mind on how the game could be improved would be to add a full screen button which can be added by ticking a box during the upload process on itch",
      "I had fun with my peaceful, 0 points, no hit run. Did I actually help to stop the invasion?"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 12:46:51",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2464736",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/vantaghost",
      "member_since": "15 September 2019",
      "posts": "3",
      "topics": null,
      "followers": "3",
      "following": "7"
    }
  },
  "2470131": {
    "overal_rating": [
      "Score*",
      "3.094",
      "3.431",
      "2.623",
      "2.798",
      "2.489",
      "2.354"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.538",
      "3.923",
      "3.000",
      "3.200",
      "2.846",
      "2.692"
    ],
    "participant": "volutedberet",
    "game_title": "Space chase",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 7,
    "comments_raw": [
      "The tiny planets were fantastic and fun. It worked great with the gathering and crafting. Too bad you couldn't get as much done as you wanted, that would have really put this game at the top. Great work regardless.",
      "I was very confused even after reading the tutorial, as the others mentioned. But once I understood that the inventory system is litterally picking up items from the world with the cursor I was hooked :) Kept loosing couple of times, but then I found out, when you go to a planet that is already eliminated, you can stay as long as you want :D (its definetly a bug xD) I took my sweet time and crafted some stuff. Unfortunetly I couldnt figure out how the furnace works :/ But I did enjoy my time. The art looks good and there is definetly a hidden gem here",
      "As others mentioned a tutorial would go a long way, but this was really cool!",
      "I had a hard time understanding why I was losing and didnt really seem to be able to collect resources. That said this look so good. I love the visuals, mechanics like the world, map and planet travel. (I said \"woah!\" when I pulled up the map) and the unique  inventory ui. This could be a great game with full dev time",
      "The visuals look great, I love how the atmospheres on the planets look. I was a little confused about what the goal was but I had a lovely time just watching the sunset :)",
      "Really ambitious project. I was lost on what to do exactly to escape the alien and how to use the spaceship to travel. I may come back later to try to understand better because screenshot looks really promising. The starting planet is really cute !",
      "Please ignore how the title is not set up in the menu, was so tired yesterday when submitting, it completely crossed my mind"
    ],
    "comments_posted": 3,
    "created_at": "2024-01-14 23:27:10",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470131",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/volutedberet",
      "member_since": "25 June 2022",
      "posts": "63",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "2467910": {
    "overal_rating": [
      "Score*",
      "3.588",
      "3.294",
      "3.188",
      "2.941",
      "2.882",
      "3.235"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.588",
      "3.294",
      "3.188",
      "2.941",
      "2.882",
      "3.235"
    ],
    "participant": "magicalmcboss",
    "game_title": "Specta-COLOR",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 17,
    "comments_received": 8,
    "comments_raw": [
      "Simple and well executed mechanic, it was easy to understand and very fun to use throughout each of your levels! I did encounter a bug at the end of level 3, something with the dialogue glitched out and it didn't let me complete the level unfortunately, would have liked to progress past that and see the final two levels. Regardless though, I really enjoyed the game and your level design! Especially liked seeing a speedrun mode as this game does seem very speedrun-worthy",
      "I like how you added the speedrun mode for replayability, the only thing I donâ\u0080\u0099t understand is why is there a timer to the spectacles, I get it that they are magical, but it doesnâ\u0080\u0099t make a whole lot of sense, I mean that mechanic is rarely used and you just need 3-4 jumps to reset the timerâ\u0080¦ but other than that the game is really cool",
      "I really liked the running animation, and the storyline along the way was a nice way to tie it all together. I said this on stream, but having some indicators when the blocks are changing would be nice, both the timed ones and the ones that swap. It reminds me of the blocks in Mario that swap back and forth, nice entry!",
      "The alternating platforms was fun. The control setup was troublesome for me to get used to, but I eventually got it.",
      "Great job! I loved the leaderboards! the platforming could use some small tweeking. like coyote time and landing on edge. Overall great job! and whoever set those top times is crazy fast!!! also the art is amazing I absolutly loved the player character art",
      "Nice entry.",
      "Nice! I like the design of the character. Might've been cool to incorporate the hat into some of the animations.",
      "This was such a cool idea!  The art style and story were really immersive.  I think the jump mechanics could've been polished a little, as some of the jumps seemed more difficult than they needed to be, but overall a really cool game!"
    ],
    "comments_posted": 3,
    "created_at": "2024-01-13 06:31:57",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2467910",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/magicalmcboss",
      "member_since": "16 November 2021",
      "posts": "27",
      "topics": "2",
      "followers": "3",
      "following": null
    }
  },
  "2470648": {
    "overal_rating": [
      "Score*",
      "2.779",
      "2.340",
      "1.682",
      "1.755",
      "1.931",
      "1.097"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.455",
      "2.909",
      "2.091",
      "2.182",
      "2.400",
      "1.364"
    ],
    "participant": "fiinrii",
    "game_title": "Spectacle Show",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 11,
    "comments_received": 5,
    "comments_raw": [
      "Nice that you had a whole story pulled together here! A couple of the controls werenâ\u0080\u0099t very intuitive, you probably could get by with all on-screen buttons to press to navigate but with keyboard shortcuts, but thatâ\u0080\u0099s not the focus of this round anyhow. I do wish I could have seen a snippet of the show though! Pretty impressive though how you must have had all the dialogue branches in this amount of time.",
      "This game is pretty impressive for the short time you spent on it. The dialoge was good, i found some typos, but not a big deal. I tried some different combinations of conversation and everything worked as intended. A neat entry to the jam and definetly a genre i will look more into.",
      "I've been becoming a fan of these kinds of games, I think it was pretty fun and the dialog was pretty entertaining.",
      "I think this is super impressive for only 2 days!! I liked the story, and it linked well with the theme!",
      "Fun game! I like the all the chooses and world map. And only in two day nice work."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:32:36",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470648",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/fiinrii",
      "member_since": "21 June 2022",
      "posts": "65",
      "topics": null,
      "followers": "8",
      "following": null
    }
  },
  "2469072": {
    "overal_rating": [
      "Score*",
      "1.627",
      "1.410",
      "1.627",
      "1.410",
      "1.085",
      "1.302"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "2.600",
      "3.000",
      "2.600",
      "2.000",
      "2.400"
    ],
    "participant": "papasmokehouse",
    "game_title": "Spectacles:NetworkOperative",
    "platforms": [
    ],
    "rating_count": 5,
    "comments_received": 5,
    "comments_raw": [
      "Oh I'm so sad! I have a mac so I can't try this one. I'm working on an unreal game myself so I'm super interested to check it out. But I'm gonna guess that it's not trivial for you to make a mac build... please post a video so apple weirdos like me can take peek! Best of luck with the jam. See ya in the discord, prolly. :)",
      "The player character and pandas looked great. I feel like the aiming could have been better tied to the mouse, I had to move to get the character to aim where I was facing. I think it's a good start of a game.",
      "I really liked the visuals of cute pandas, althought it took me a while to get used to controling a gun, I think having an FPS would be more fun, but I enjoyed the game as it is now",
      "Why do I have to defeat such cute creatures ... because I must :D Its definetly a neat prototype. Those robot-pandas dying were spectacular :O",
      "The player controller feels really good! I apparently can't read and kept holding down Shift and wondering why I kept going slower. XD I also wasn't able to figure out how to actually damage the pandas? Maybe I just wasn't targeting them correctly! Great art for them, regardless"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-13 22:28:05",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469072",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/papasmokehouse",
      "member_since": "26 April 2023",
      "posts": "0",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "2469561": {
    "overal_rating": [
      "Score*",
      "3.889",
      "3.778",
      "3.444",
      "3.600",
      "3.778",
      "3.111"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.889",
      "3.778",
      "3.444",
      "3.600",
      "3.778",
      "3.111"
    ],
    "participant": "game-dav",
    "game_title": "Stevens Fusion Musical Spectacular - GDKO 2024 - Round 1",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 11,
    "comments_raw": [
      "This game is really fun. The soundeffects fit perfect. The audience mumbling in the main menu is such a nice touch. At first I was a bit confused where i can change the background, but other than that, the entry ist great. Good Job !",
      "Really strong entry for me. It's a very clever game play idea (which I know this round isn't really about, but it's still impressive.) The animation on the main character is great. If I had a suggestion it would be to experiment with some other fonts that are a little less blocky, to see if you like them better. Good luck with the jam! I'd be amazed (and appalled) if this doesn't advance.",
      "Love the pixel art and animations. They give the game a lot of character. Some of the art and menus could probably use more polish, but overall really great!",
      "What a great idea, that was fun. I can imagine this going farther with more and more things that need to be set up before the curtains raise.",
      "Fun! The art and sound effects were great.",
      "Hey you got the sign in there!  This turned out really good.  The infinity running animation, out of breath animation, etc... just felt so fun.  Good job!",
      "A great idea and pulled off really well. The animation of the character's feet dancing and facial expressions are great and l like how you have to hurry and pick the right props. The sounds certainly add to the spectacle but I didn't realise the background could be changed until reading others comments",
      "I really like the techno fit, and the gameplay loop is fun once you get used to it",
      "Fun! Some nice character to the clapping, and impressive having all sound and so forth in the entry (gives some charm, even if not a criteria specifically for this round). Took me a moment to realize how to change the background, some kind of â\u0080\u009chey Iâ\u0080\u0099m interactableâ\u0080\u009d when you walk by the pulley would be helpful. Also, at first I thought this was somehow going to be some riff off of Steven Universe and Gem fusions haha. Artwork was fairly simple, though still enough that I got the gist of the themes they went with, so kudos there.",
      "Interesting concept, and overall the art was pretty well done. The pixel art is different sizes though, so getting them the same resolution will help keep it fitting together nicely. Cool entry!",
      "I think your game fits the theme super well, and it's a cool concept. I think the props, backgrounds, and costumes fit well together, and you can clearly tell what is what theme. I think this has a lot of potential to be expanded on in the future, in another GDKO round or whatever you want really. I did wish that each game went on for a bit longer though, maybe with more rounds. Great job, I really enjoyed this!! :)"
    ],
    "comments_posted": 13,
    "created_at": "2024-01-14 23:59:00",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469561",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/game-dav",
      "member_since": "23 January 2021",
      "posts": "934",
      "topics": "19",
      "followers": "24",
      "following": "14"
    }
  },
  "2452786": {
    "overal_rating": [
      "Score*",
      "3.739",
      "3.496",
      "3.478",
      "3.304",
      "3.217",
      "3.739"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.739",
      "3.496",
      "3.478",
      "3.304",
      "3.217",
      "3.739"
    ],
    "participant": "spookyrobloxman999",
    "game_title": "The GREAT Spectacle",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 13,
    "comments_raw": [
      "I like the complex movement mechanics and the vibrant artstyle. Neat entry!",
      "I love the art style, I think this game has such a nice atmosphere! It took a bit of time for me to get used to the controls, but once I did, I had a great time!",
      "Nice mix between celeste and geometry dash. The challenge was a bit too high for me at some point but it was fun. Visuals works well together. Good job !",
      "This was really fun and challenging. The visuals were great too.",
      "Definitely could see the Celeste inspiration!  Overall your visuals were really good. There were a few things that started to feel a little busy, like maybe too many after-images for the player.  Still a very cool world and fun gameplay!",
      "I like the platforming challenges with all of the spikes and lasers. I got pretty far but I didn't manage to complete the game, although I might have been able to with some more determination. The player's abilities are cool and the platforms have a nice colourful style too",
      "I see you took a lot of inspiration from Celeste, and I really like the visuals and the movement is really fun, but I think thereâ\u0080\u0099s a little too much camera shaking",
      "The dashing felt good to control, although it was a bit hard for sure. I said this on stream, but I think some color changes would benefit this, as lasers and spikes sometimes were hard to see since the background color was similar. Still, nice entry!",
      "",
      "I see what you are trying to go for and it is in fact really fun just the last 3 levels had a very overwhelming difficulty curves, Thi hit box of the player felt a little wonky at times  I think I can make it but then I hit a spike but then I think I am going to die but I hit the same place on the spike and end up getting through alive, other then that I am not sure what the a/d does in the menu exactly.",
      "I really like the idea but for me the camera was really difficult to deal with. i often found myself dying because i could not see what was happening from the camera studdering. I really liked the controls thought and the speed running feeling",
      "Love this game. It takes a minute to get used to the controls but it's sooo worth it.",
      "This game has something addictive, I like how challenging it gets :)"
    ],
    "comments_posted": 2,
    "created_at": "2024-01-13 02:02:34",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2452786",
    "coolness": 35,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spookyrobloxman999",
      "member_since": "12 November 2022",
      "posts": "103",
      "topics": "3",
      "followers": "5",
      "following": null
    }
  },
  "2470526": {
    "overal_rating": [
      "Score*",
      "2.825",
      "2.489",
      "2.449",
      "2.556",
      "2.085",
      "2.287"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.231",
      "2.846",
      "2.800",
      "2.923",
      "2.385",
      "2.615"
    ],
    "participant": "mooltidude",
    "game_title": "The Lost Spectacle",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 6,
    "comments_raw": [
      "What a great idea of making wings out of the weapons you pick up! Love how you animated the wings growing as you picked up \"more\" weapons, lol. Would love to see more from this game!",
      "It was fun playing for a bit until I died. I really liked the concept of gathering weapons and using them as wings until you shoot them out.",
      "Really interesting concept!  I love the idea of the weapons becoming the wings.  And well animated, too.",
      "Very cool idea! I love how you animated the wings. It looks surprisingly believable as a physics object. More than I thought it would be for wings made out of weapons. XD I definitely missed the sound/music, so I hope you end up adding to it in the future!",
      "A very original idea, the art is very good and I like how the weapons can be thrown and collected",
      "Making wings from the weapons is a very visually cool idea."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 18:20:14",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470526",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mooltidude",
      "member_since": "06 November 2021",
      "posts": "0",
      "topics": null,
      "followers": "4",
      "following": "5"
    }
  },
  "2451008": {
    "overal_rating": [
      "Score*",
      "1.372",
      "1.200",
      "1.458",
      "1.269",
      "0.943",
      "1.372"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.000",
      "1.750",
      "2.125",
      "1.850",
      "1.375",
      "2.000"
    ],
    "participant": "bigeraser",
    "game_title": "The Secrets of the Universe",
    "platforms": [
      "windows",
      "osx",
      "linux"
    ],
    "rating_count": 8,
    "comments_received": 1,
    "comments_raw": [
      "The popping soundeffects were quite loud at the beginning, but otherwise thismightbe a hidden gem"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-01 21:56:42",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2451008",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bigeraser",
      "member_since": "28 December 2021",
      "posts": "121",
      "topics": "3",
      "followers": "3",
      "following": "18"
    }
  },
  "2469395": {
    "overal_rating": [
      "Score*",
      "2.779",
      "2.048",
      "2.048",
      "2.121",
      "1.682",
      "1.609"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.455",
      "2.545",
      "2.545",
      "2.636",
      "2.091",
      "2.000"
    ],
    "participant": "noahaslan",
    "game_title": "The Show Most Go On",
    "platforms": [
      "web"
    ],
    "rating_count": 11,
    "comments_received": 7,
    "comments_raw": [
      "The show most go on, my friend. Nice work!",
      "The music was a pretty good pick. I think some particle effects when passing through a ring would be nice. I liked how I didnt have to do every ring again, after respawning at a checkpoint. I also like the parralax background with all the spectators.One problem I noticed was, that when finishing the game and pressing \"R\" to restart, the music seems to be played twice ontop of each other.",
      "Awesome job!\nYou really implemented the â\u0080\u009cspectacleâ\u0080\u009d theme well.\nMusic made the game feel pretty intense and dramatic.",
      "Good job with spectacle and more is more!  Your collision testing only seemed to check the bottom of the main character, so you could slide through boxes connected at the corner, but that's not too big of a deal, just something to watch for next time.  Fun little game!",
      "I made it to the end but I think there was one hoop that I couldn't jump through as it was too high. I like that the hoops went up and down and there's some good platforming in it but I've never been a fan of the castlevania style invisible blocks though. There's things that I like and things that I don't. So firstly, I like what you've done with the stage lights, I like the checkpoint and I think the audience in the background is cool and is cohesive with the design of the main character. I think the balloons would be better if they moved more freely and could be interacted with.  Also, I think it would be cool if all the hoops could change colour after going through them or have a flame around them or something like that",
      "Well done on your entry to the jam.",
      "A decent platformer. Found it a bit irritating a few times, it's not really my thing, but I had some fun."
    ],
    "comments_posted": 3,
    "created_at": "2024-01-14 04:24:06",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469395",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/noahaslan",
      "member_since": "10 July 2020",
      "posts": "71",
      "topics": "5",
      "followers": "6",
      "following": "9"
    }
  },
  "2470533": {
    "overal_rating": [
      "Score*",
      "3.958",
      "3.625",
      "3.875",
      "3.467",
      "3.125",
      "2.750"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.958",
      "3.625",
      "3.875",
      "3.467",
      "3.125",
      "2.750"
    ],
    "participant": "dani-swordfish",
    "game_title": "The Spectacle Shop",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 18,
    "comments_raw": [
      "Pretty fun game! I am a sucker for papers please likes and so I really enjoyed this game. I will say that for a jam game it did feel a little long but It was still pretty fun!",
      "Very interesting gameâ\u0080¦ had me playing it for a long time",
      "I love this take on the theme! Nice job :)",
      "Great entry! I briefly had a similar idea when they revealed the theme but I wasn't sure how to design the game play. Making a 'papers please' type of game was a really great idea.",
      "Nice job. I liked the concept and gameplay. I think the rounds were a bit too easy and could have been shorter but the gameplay was great! Great game!",
      "Very unique idea, and well executed! Loved the variation in people generated - some kooky combinations! And fun story built up as we went along. Only gameplay nit (which is not the roundâ\u0080\u0099s category!) is that itâ\u0080\u0099d be nice if I could pull down by clicking anywhere on the machine, I kept moving my mouse there as it somehow felt more intuitive vs the slider.",
      "This was a really unique idea!  I really liked the effect of the blurry letters.  Good job!",
      "It was fun and unique with some pretty funny premises! I would have liked more consistency of line weight and perspective when making a cohesive art style for a game, though",
      "The artwork is really great and getting the right glasses for each customer by doing the eye test was cool. There gets to a point where there's a lot to remember for me but its all good fun",
      "Fun game! It also took me a bit to understand how to pull down the eye thing. The art is crisp and clean and the gameplay definitely fits the Papers, Please vibe of having certain, expanding rules you need to remember.",
      "A very unique game! After I figured out what to do, it was really engaging and fun to pick the correct glasses. Well done!",
      "Super interesting concept, didn't even consider that optimetrist simulator could be a game!I am really bad at remembering these things, so a post it note of sorts that I could check to see what type of customers wants what would have been great (unless I missed that), but I muddled through.The controls threw me off at first, but once I understood in which order I had to click them, it was very smooth sailing. Would have probably loved it even more if I had to rotate the actual device around for each eye, but using slider worked just fine!Cool entry!",
      "Nice game, the controls were a bit difficult at first.",
      "Food - Burger",
      "Fun game. Took me a bit to figure out I had to pull down the eye thing. After I failed the first guy though it was smooth sailing.",
      "Very cool game, you got a lot of work done in just a few weeks!\nThe focus/unfocus shader effect was very cool.",
      "I think this is a really interesting interpretation of the theme, this was a fun game, I had a good time playing it! I liked the blurring and unblurring effect when you adjusted the lens as well!",
      "Interesting minigame, I would've never thought to have a game about the eye doctor lol. Simple but nice entry, good job!"
    ],
    "comments_posted": 19,
    "created_at": "2024-01-14 23:19:01",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2470533",
    "coolness": 29,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dani-swordfish",
      "member_since": "07 June 2023",
      "posts": "205",
      "topics": null,
      "followers": "11",
      "following": "11"
    }
  },
  "2462086": {
    "overal_rating": [
      "Score*",
      "4.257",
      "3.886",
      "3.771",
      "3.794",
      "3.686",
      "3.371"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.257",
      "3.886",
      "3.771",
      "3.794",
      "3.686",
      "3.371"
    ],
    "participant": "just-a-mooshroom",
    "game_title": "The Spectacular DJ Dynamo - GDKO Round 1 2024",
    "platforms": [
      "web"
    ],
    "rating_count": 35,
    "comments_received": 21,
    "comments_raw": [
      "All visuals look really nice and polished, the atmosphere feels great. Gameplay is fun, but not very challenging. Well done!",
      "Fun memory game, also really love the visual style you've gone for! Mirroring Loten's concern, I thought some of the colors (mainly along the green/blue/purple part of the spectrum) were a bit too similar which ended up causing me some trouble, but that should be an easy fix. Despite the color confusion, I still really liked the color transition effects! If you end up adding to this, you could add another layer of trying to remember the timing of each color in the sequence, in addition to the actual color for each one.",
      "I was not expecting a memory game... lolBut that being said, I really enjoy it! I love the feeling of it and how it feels like you are the DJ and trying to keep the crowd happy!",
      "Your pixel art looks great. You obviously put some time into make the atmosphere look good.\nA good idea executed very cleanly.",
      "Itâ\u0080\u0099s great to see how far you have come since last year. Iâ\u0080\u0099m happy to finally see some artwork in your game and the pixel looks great. I wish the gameplay was a little faster pace, maybe instead of doing multiple rounds of the same number, just increase it by one each round. Also, the colors were a bit confusing, especially with the light, the purple/pink and green/blue were a little too similar, maybe some images go to along with the colors. Overall, great job on your round 1.",
      "I think my favorite thing about this game is that it's a great example of scoping appropriately for a jam. You focused on one fun mechanic and did so much with it, and still had plenty of time to make great visuals and add appropriate audio to enhance the experience.",
      "A fun memory game, worked really well with the DJ theme. The colors were different enough to not get confused even with all the lighting effects.",
      "The sound design is great, i like how every color has a different sound, that makes it easier to memorize. I rocked that leaderboard with a solid 13770. To be hones i was compleatly lost once it started to play 7 colors xDGreat game!",
      "I feel like we play similar kinds of games because I always love what you produce. The sound design in this is so fun, I can't tell if it was my brain imagining it or not but the crowd seemed to get more hype the better I did. I love the synthy sounds as the lights change. And THE LIGHTS! Such good lighting effects. Im wondering how I can execute something similar in unity. If I could suggest one thing. Adding a royalty free synthwave music playing in the background I think it would add some valuable ambiance to the game. Something like this in the background would go so hard and fit nicely with the sounds you already have.",
      "I have to say, the blacklights was the best. When I had no idea of the sequence, I just turned it all black.",
      "Love all the effects and atmosphere of this game. Was a bit challenging at times to differentiate some of the colours, but overall really nicely executed with awesome visuals :)",
      "Memorize em all da.\nLiked the concept and it looks prettyâ\u0080¦.",
      "This looks great! Really cool animations and good use of sound.",
      "Really like the lighting effects and the atmosphere you have created, especially with the jumping crowds. I also liked the leaderboard and got to third place but I imagine I'll get overtaken as more people have a go. I will say that I did get mixed up on some of the blue and purple colours as I'm a bit colour blind,  perhaps having a yellow and a deeper purple could help make them stand out",
      "It is very nicely polished, the game feels very cohesive :D",
      "Great Job! I love the twist! a few times I would lose and i wasnt sure why so im not too sure what to say about that but overall it was really polished and the animations were great!",
      "Dude this turned out really good!  The crowd, sound effects, notes, light, etc... made such a good, cohesive style.  FANTASTIC entry.",
      "I like how the whole scene is animated. Everything seems alive. I also like the music notes floating around. Might be cool to have some additional animations/effects when you get the sequence right. Overall really great!",
      "Nice twist on a memory game, and really enjoyed the spotlights going back and forth, they almost throw you off in a way. I mentioned it on stream, but making the colors more distinct, such as using the colors of the rainbow, and maybe a way to signify the start of a round, using the lights going black might be nice. Overall, nice job!",
      "I did not expect a memory test xD, I really like the visuals and the music, well done",
      "This was a really nice game! The gameplay was super intuitive and I really enjoyed the art. It was so colorful and I really enjoyed the main DJ guy."
    ],
    "comments_posted": 26,
    "created_at": "2024-01-14 23:43:39",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2462086",
    "coolness": 26,
    "participant_info": {
      "profile_url": "https://itch.io/profile/just-a-mooshroom",
      "member_since": "31 August 2022",
      "posts": "165",
      "topics": null,
      "followers": "7",
      "following": "20"
    }
  },
  "2469190": {
    "overal_rating": [
      "Score*",
      "3.569",
      "2.780",
      "2.568",
      "2.380",
      "2.630",
      "2.755"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.800",
      "2.960",
      "2.733",
      "2.533",
      "2.800",
      "2.933"
    ],
    "participant": "crimson-wolf-games",
    "game_title": "The spectacle of dance",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 15,
    "comments_received": 7,
    "comments_raw": [
      "I think I figured out a trick. Mash X with your left knuckle and time the spacebar presses with your other hand. Anyways, lovely game!",
      "I enjoyed watching this one develop in the discord! The game juice you added really amped up the satisfaction, so great job on that! I'd love to see a little more feedback on interaction, however, as I wasn't entirely sure how my actions were increasing/decreasing the score relative to the timer and number of tomatoes.",
      "A nice entry, short game, but i still had fun.  Its cool being rated by the judges. My score was 184 :)",
      "A really fun entry, the two buttons worked great together.",
      "I like the idea of the game, meets the theme well and it was good having the judges being the judges in your game. My score was 208. To improve the game, I think the game art could be more cohesive if it was all pixel art like the main character",
      "I agree it was cool how you incorporated the game jam judges. Some of the art seems a little rough around the edges.",
      "Cool idea, and I liked the fact that the game jam judges were judging the dancing, interesting theme!"
    ],
    "comments_posted": 9,
    "created_at": "2024-01-14 00:22:24",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2469190",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crimson-wolf-games",
      "member_since": "23 July 2019",
      "posts": "180",
      "topics": "2",
      "followers": "6",
      "following": "4"
    }
  },
  "2462116": {
    "overal_rating": [
      "Score*",
      "4.000",
      "3.393",
      "3.271",
      "3.143",
      "3.464",
      "2.357"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.393",
      "3.271",
      "3.143",
      "3.464",
      "2.357"
    ],
    "participant": "sycr0",
    "game_title": "Thrown n' Explowned",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 28,
    "comments_received": 16,
    "comments_raw": [
      "Very lovely game! It fully flaunts its minimalistic art style, putting the game at the core of the experience. However, this game demonstrates that minimalist graphics aren't bad, by using parallax stars, particles, screen shake, and a trail behind the player to give a certain weight behind your throws and explosions. Keep it up in round 2!",
      "Really fun and addictive ! Reminded me of those good old yeti games. Good job !",
      "Love a good ragdoll sim :D\nYou did a great job with this one, and Iâ\u0080\u0099m amazed how much you got done during the jam.",
      "I really enjoyed this!! The physics and effects are great, and the gameplay is really fun! It's been great seeing your progress, and I think you should be super proud of your entry, you've done a great job!",
      "Very satisfying and fun ragdoll throwing game! I know you said it wasn't the most creative use of \"2 buttons\", but I disagree: I think you implemented only two buttons in a very clever way that was simple to understand, but still provides a good amount of fun in experimenting with the best angles and timing of explosions to make the ragdoll fly farther and higher. Well done!",
      "The way the ragdoll looks is amazing, its so satisfying to chuck it lol. I would like to see some more content for this, its already a a decently fun game loop! Nice job!",
      "The physics work really great, I like how the character can bounce on the floor and how easy it is to get into the game",
      "This is one of the most fun ones I've played so far.  Something so satisfying about yeeting a stick figure.  Great job!",
      "tbh I played until I hit 15k and then I stopped myself very fun entire but The art is a bit lacking all the effects are nice, the only think I have to say, is difference between atomic bomb and the normal bomb?",
      "You created a fairly addictive game. I could spend a lot of time in it, but I have to move on playing all the other games.",
      "Fun game! Very addictive with some nice vfx :)",
      "Extremely fun! I played it for a long time. Great audio design, all the visual effects also look awesome. Very well done!",
      "Nice job i thoroughly enjoyed! The nostalgia to old flash games was great. the physics felt clean. great job!",
      "For such a simple idea itâ\u0080\u0099s surprisingly fun. The upgrades made it very addicting. I would love to see more from this game.  My favorite so far.",
      "Wow, this turned out to be much more fun, than the last time I played itâ\u0080¦ I really like the starry sky, and the fact that its just a goofy idea, executed pretty well",
      "This is pretty fun and addictive already lol."
    ],
    "comments_posted": 5,
    "created_at": "2024-01-12 09:51:17",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2462116",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sycr0",
      "member_since": "24 November 2023",
      "posts": "52",
      "topics": null,
      "followers": "3",
      "following": "5"
    }
  },
  "2471023": {
    "overal_rating": [
      "Score*",
      "2.079",
      "1.881",
      "1.624",
      "1.485",
      "1.485",
      "1.188"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "3.167",
      "2.733",
      "2.500",
      "2.500",
      "2.000"
    ],
    "participant": "felix-u",
    "game_title": "Tightrope",
    "platforms": [
      "windows"
    ],
    "rating_count": 6,
    "comments_received": 3,
    "comments_raw": [
      "A cool tight rope game. I couldn't make it past 3.",
      "I could only beat the first 3 levels, but the challenge made it pretty tense in a fun way.",
      "The art is nice, the controls did feel like standing on that rope xDI couldnt get past level 4 but i think thats okay, these levels are only for the real rope-pros"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:00:55",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471023",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/felix-u",
      "member_since": "22 November 2020",
      "posts": "2",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2458882": {
    "overal_rating": [
      "Score*",
      "1.627",
      "1.627",
      "1.302",
      "1.085",
      "1.085",
      "1.345"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.000",
      "2.400",
      "2.000",
      "2.000",
      "2.480"
    ],
    "participant": "redionion",
    "game_title": "Top of the village",
    "platforms": [
      "windows"
    ],
    "rating_count": 5,
    "comments_received": 4,
    "comments_raw": [
      "What a great take on the the network modifier, and I like how you named the difficutlies poor and rich, but it would be better if the order of the buttons was rich/poor, cause the rich is an easier difficulty, anyway the art looks amazing and the subtle background music is just perfect",
      "This was a cool little game! I like the vfx and feedback from the rocket. Good job :)",
      "Found the game to have a bit of fun for the first little bit. I enjoy these types of defense games.",
      "The game was either to easy or too hard, I couldnt find a way to get to the turret on the \"poor\" difficulty, and the \"rich\" was to overpowered. I did like the minimalistic artstyle and the fire effect on those rockes was really nice. You definetly hit the modifier \"networking\" (if the multiplayer works) but i think implementing the modifier this way took you too much time to polish the rest of the game.  BUT you can still be proud of yourself to even publish a game :) Thanks for letting me play it"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-07 12:51:17",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2458882",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/redionion",
      "member_since": "30 January 2023",
      "posts": "4",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "2471088": {
    "overal_rating": [
      "Score*",
      "3.296",
      "2.556",
      "2.274",
      "1.749",
      "2.085",
      "1.682"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.769",
      "2.923",
      "2.600",
      "2.000",
      "2.385",
      "1.923"
    ],
    "participant": "nuker0s",
    "game_title": "Tough Crowd",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 13,
    "comments_received": 9,
    "comments_raw": [
      "I really love this idea, but this game really misses some juice, like tomato splashes, crowds reactions, and so much more, just some polish, and this would have been wonderfull, I mean simplicity has its charm too, but I just wish there was something more",
      "Cute game that put a big smile on my face! Very easy to play and surprisingly challenging, at least for me hahaha. A couple of suggestions for future versions... 1) the font choice. I think trying some other fonts to add some extra flavor would be fun to try. 2) Audience members with expressions might be hilarious and cute. Good work and keep going!",
      "This was a cool idea!  Good job!  Loved the combo of clicking words to write cheesy jokes and shooting tomatoes.",
      "",
      "Great use of the two buttons to with the gameplay. Fun game.",
      "I love this take on the theme, it was a fun challenge :)",
      "Nice job! the right click would sometimes not work properly and i would need to mash to get control back. I was playing on browser if that helps diagnose the issue. I liked the jokes and the play on two buttons. really great job there! The concept was also well executed!",
      "The crowd is really tuff, event the good line didn't stop them from throwing tomatoes ! Nice take on the theme !",
      "I was actually hooked to read all the jokes you put there :) Good implementation of the theme. Overall I like the concept. My final score was 121 :O"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:35:16",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471088",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nuker0s",
      "member_since": "13 November 2020",
      "posts": "17",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "2449828": {
    "overal_rating": [
      "Score*",
      "4.444",
      "3.919",
      "3.889",
      "3.481",
      "3.704",
      "4.074"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.444",
      "3.919",
      "3.889",
      "3.481",
      "3.704",
      "4.074"
    ],
    "participant": "evengy",
    "game_title": "Unspectacular",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 27,
    "comments_received": 18,
    "comments_raw": [
      "Love this game! It has a very nice atmosphere, like you're in an old TV show. The models are simplistic, but eye catching. I just have to wonder,why is the character's performance so hated?I guess we'll never know...",
      "Of the balance mechanic games in this jam I've played so far, this one is the best tuned and easiest to learn. I thought your homescreen with the entrance to the circus was really pretty and consistent. If I had a small suggestion that would have upped my rating on this, it would be to have the in-game text use the same font and border as the signed on the homescreen. Overall a really nice entry that I bet will advance! Very nice work.",
      "I really like the atmosphere you created with the art style. Kind of reminds me of an old movie. Also great job on the menu. Really ties in well with the rest of the game. Would be cool to somehow apply the same style to the end screen. Another cool addition might be spotlights pointing at the character. Overall really nice!",
      "Interesting use of two buttons, like it!",
      "Ahh this is the tightrope entry I was waiting for! Mechanic worked well though, though curious to see how you can expand from here. Amazed the shadows and everything ran well enough in the browser for me - nice work!",
      "nice use of 2 buttons! the visuals were well done and it felt polished!",
      "Simple and fun. You nailed the creepy ambiance of a circus very well. Congrats !",
      "Great balancing game. Loved the art and theme as well. Great job!",
      "Very good use of two buttons, managed to get the hang of it after a couple tries! Would love to see a higher difficulty, maybe an unexpected twist in the middle of a second level or something. Really solid start though if you plan to build upon this!",
      "Love it! The two button feature is amazing would be fun to be able to throw a tomato back at them! lol",
      "Lots of really great attention to detail.",
      "Cool game, vary hard but I got it on my like 5 or 6 try. I love the into screen btw, it really sets the scene.",
      "Love the immersive menu and the audience shouting at you with the little speech bubbles. Nice job :)",
      "Really like how the crowd are booing and throwing oranges at you, with some that miss and some that hit. I also like how the hands stretch out to the sides too, it all looks good, including the menu screen. The game is quite tricky to be honest and I think it might benefit from having some way to measure the distance you've crossed to keep track of progress. I made it across to the other side :)",
      "Enjoyed this one a lot! Some of the most impressive camera work I've seen in any of the entries. You made an immersive experience from the second I saw the title screen. If I could give any suggestion would be to give a similar amount of love to the game over UI. Would love to see this expand. Could be cool to see how other acts deal with the rude crowd.",
      "From a colored dot to having both hands game improved a lot i enjoyed playing it â\u0080¦.\nKeep the good work up!!!!",
      "You really nailed the theme and circus vibe. The game became quite easy once I figure out the gameplay. I would like to see the game expanded, maybe different levels or difficulties. Solid round 1 game.",
      "One of the sickest menus that I've seen in a minute. The art style has an almost claymation feel to it, movieish. Smooth and simple, I dig it."
    ],
    "comments_posted": 7,
    "created_at": "2024-01-02 20:57:43",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2449828",
    "coolness": 62,
    "participant_info": {
      "profile_url": "https://itch.io/profile/evengy",
      "member_since": "15 April 2021",
      "posts": "43",
      "topics": null,
      "followers": "20",
      "following": "1"
    }
  },
  "2471122": {
    "overal_rating": [
      "Score*",
      "3.630",
      "3.306",
      "2.852",
      "2.528",
      "2.398",
      "2.398"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "3.643",
      "3.143",
      "2.786",
      "2.643",
      "2.643"
    ],
    "participant": "jackachulian",
    "game_title": "Vertically Challenged",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 8,
    "comments_raw": [
      "I really enjoyed the core idea here. Very funny concept to me. In a future version, a little more in-game indication of whether I'm doing a good job would be great. And it was be interesting to experiment with having the crowd bop up and down to the beat. Maybe some crowd sounds. But for a 2-week jam this is really solid.",
      "Nice game! Wasn't sure if there was anything I was particularly missing because I was playing with sound off but I still think it was pretty neat. I like this art style, I don't know why but it just resonates with me. Nice job!",
      "Ha. a funny concept for a game.",
      "I liked the lights and music!  I'd recommend putting some instructions in the notes for the entry.  It wasn't too hard to guess but it's still nice to know going it to it.  Overall good job, though!",
      "Art is really well done, love the music too",
      "I love the concept, and I think the art is very cohesive and fits in well with your theme. I do agree with 14rry's feedback about the lights though, I think adding some more lighting, and potentially even making the lights move around could really make the stage and the musicians pop. Great job!! :)",
      "Haha liked the idea ! First time i had 0 but second time i was pushing my way around and dancing in front. Really fun entry, good job !",
      "Nice! I like how the art is retro/pixelated but also has the hand drawn feel. The color palette is really great for making it feel like you're at a concert. I think the lights could be shining more on the musicians on stage."
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:58:57",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471122",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jackachulian",
      "member_since": "08 March 2019",
      "posts": "77",
      "topics": null,
      "followers": "8",
      "following": "4"
    }
  },
  "2467744": {
    "overal_rating": [
      "Score*",
      "4.565",
      "4.261",
      "3.696",
      "3.609",
      "3.261",
      "2.783"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.565",
      "4.261",
      "3.696",
      "3.609",
      "3.261",
      "2.783"
    ],
    "participant": "floofdoctor",
    "game_title": "Walden",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 18,
    "comments_raw": [
      "I loved the hand drawn art style of this game. Lots of work and very cohesive. A suggestion to consider for future versions: it might be fun to spend some time on the itch page itself, try some other fonts, maybe some embedded screen shots, that sort of thing. Good job!",
      "Loved the visuals very calming :))",
      "Love the art style, really nice job :)",
      "Amazing art style, one of the coolest looking games in the jam.\nNice job!",
      "Very adorable art style, simple but well done level design as well! I think the camera could be zoomed out a bit, because it was difficult to see obstacles without some trial and error. Loved the implementation of \"network\" though, some strong potential to build off of there.",
      "The artwork is really great in this game. Was hard to see where I was going, but I had a lot of fun playing.",
      "I love the art and animations. The camera could be more zoomed out, but the movement is really smooth. Nice entry!",
      "Really nice art, I like the hand drawn style.",
      "if ori was a weasel :D",
      "The artwork is beautiful and your weasel character is really awesome. The environment is well put together too but I think the tiles could flow better. I liked being able to move the camera up and down but there were times when I wished I could look further right.  An idea could be to have arrow keys to handle the camera and WASD for all of the movement. Spoiler - I managed to get to the end of the level and loved all of the butterflies :)",
      "",
      "I love the style! great art and animations. i felt the camera was a bit zoomed in for the platforming so i was just blindly guessing where to go, but overall i really enjoyed it. I hope you move on to round 2 so you can keep working on it!",
      "I really love your art style, and the animations for Walden are really fluid. I think the network modifier with the roots could have been expanded on further, but I enjoyed playing this, and loved the concept! :)",
      "Love the art syle idea. Platforming is a bit hard due to the low view distance so it feels a bit random. Good job !",
      "Very cute, and I highly appreciate all the hand paintings for each frame, it comes together really nice! Platforming controls could use some work e.g. not knowing where to go and just having to fling myself blind - but hey, thatâ\u0080\u0099s not the purpose of this round of GDKO, so no points off from me for that. Did notice a couple non-tiling areas/seams.",
      "The art is beautiful. I would've liked to see the root networks utilized a bit more often in the levels, but such is the way with game jams and the limited time we always have. Great entry and best of luck in the round!",
      "The painted art style is so cool. Really good job!",
      "I love the painting look. The run animation and leaves are really nice too. I did notice in some spots the tiles don't have a smooth transition from one to the other. Also might've been cool to have some kind of animation or particle effect when you bounce off the flowers. Overall really great!"
    ],
    "comments_posted": 1,
    "created_at": "2024-01-13 02:54:06",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2467744",
    "coolness": 40,
    "participant_info": {
      "profile_url": "https://itch.io/profile/floofdoctor",
      "member_since": "22 November 2023",
      "posts": "5",
      "topics": null,
      "followers": "4",
      "following": "1"
    }
  },
  "2453552": {
    "overal_rating": [
      "Score*",
      "3.316",
      "3.000",
      "2.842",
      "2.989",
      "2.632",
      "3.158"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.316",
      "3.000",
      "2.842",
      "2.989",
      "2.632",
      "3.158"
    ],
    "participant": "whodragon22",
    "game_title": "What Ya Watchin Son?",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 12,
    "comments_raw": [
      "Yep this was a game",
      "Hey there! Charming little game! If I had a specific suggestion it would be to expand your itch page a bit, and explain how it fits into the themes.",
      "The visuals are good and it is a pretty funny concept. Hard mode is definitely difficult! Good job",
      "The obelisks look really good and I like the shadow underneath it as it floats. The game is pretty fun and I completed the easy level with the help of the hiding mechanic. This is just my personal preference but I would have preferred Z and X to be replaced with N and M to make them easier for me to press",
      "",
      "This is a very funny aproach to the theme of spectacle xD I would like if it was a bit easier, but the core idea is so funny",
      "Fun stealth game.",
      "This was a really funny idea and a great way to use \"spectacle\" haha.",
      "This was a really funny idea and a great way to use \"spectacle\" haha.",
      "HAHAHAHAHAHAAHAHA!!!!!! 10/10 points for the concept and its very addicting. I was never able to beat it but I tried a bunch. Love the sounds design too, the transitions when you are caught are really cool too. Did you do that with two UI images as squares and you just trigger pulling those in when you get caught? Anyway very dope!",
      "Hah, very funny little game. I like how the sound/alert circle effect turned out! I found it pretty difficult, but I'm sure I'm just missing the walk patterns and need to get the timing right for hiding/slowing.",
      "When retrying press this"
    ],
    "comments_posted": 23,
    "created_at": "2024-01-14 01:37:58",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2453552",
    "coolness": 27,
    "participant_info": {
      "profile_url": "https://itch.io/profile/whodragon22",
      "member_since": "24 December 2021",
      "posts": "42",
      "topics": null,
      "followers": "3",
      "following": "6"
    }
  },
  "2463186": {
    "overal_rating": [
      "Score*",
      "3.333",
      "3.286",
      "2.905",
      "3.524",
      "3.152",
      "2.714"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.333",
      "3.286",
      "2.905",
      "3.524",
      "3.152",
      "2.714"
    ],
    "participant": "hermes3d",
    "game_title": "You hungry?",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 17,
    "comments_raw": [
      "This was super fun, and I think you fit the theme perfectly, both spectacle and more is more! Love the art style, and the music fits the vibe of the game really well! :)",
      "Cute game! The choice of assets was well suited to the whimsy of the gameplay. I did notice a major bug with the retry option in that I was unable to move my character. I had to just refresh the page and then load from menu instead.",
      "An interesting title. It's exactly what it says it is--a game about eating as many hot dogs as possible. It's a neat idea, but a little work could be done to make it feel much better, perhaps like an NPC to compete with? And, as other people have already said, it's definitely easy to cheese. Still, it's a cute game with an interesting premise.",
      "quick search with some screenshots reveals that this is an asset flip and other games use the exact same models. This is frustrating as the main focus of this game is the art and the gameplay is a bit lacking and quite buggy.",
      "The art of this game was really great and the hot dog eating was fun.",
      "I'm always impressed by what you can do with 3D in such a short time.  And the art style in this hits the mark for me.",
      "The art is amazing! Glad to have made it on the leaderboard, my technique was to start by filling my stomach with absolutely loads of water and then mash E",
      "Nice work! Lovely lowpoly style, although given the gamepaly I canâ\u0080\u0099t help but feel the mechanic of walking and sprinting around is a bit superfluous. Putting some of that energy into some custom matching UI would help it all mesh together! Watch out for some wordwrapping, but nice work getting a working leaderboard in place.",
      "LOVE this art style!  Fun and silly little minigame, and I'd for sure play a full game set in this world.",
      "Thought i was smart with my technique and then saw that someone did 700+ score...",
      "Fun game with great art.  The leaderboard is an excellent idea for a jam.  The game is quite easy to cheese, though. :P",
      "My arm hurts i was mashing so fast XD but im #1!!! Great idea and environment!",
      "nice cosy stile :)",
      "I love the character and world design of the game. It mixed with the music made me feel like I was out having a nice stroll out at the park. I like the concept and the use of the slider to track how much the player has eaten. If I could give any suggestions is to try playing around with different fonts and UI art assets. They could add a lot of pop to future menus and UIs.",
      "Great ambience and the music works really well. I did find the gameplay was quite easy to cheese just by spamming Q and E but I'm not going to complain about getting top of the leaderboard ;)",
      "Nice music and good job on the first person controller. Movement feels smooth and satisfying.",
      "Really like the ambiance and overall look of the scene. Might've been nice to have a few more animations and effects. Maybe some particle effect of crumbs when the player eats. Nice!"
    ],
    "comments_posted": 22,
    "created_at": "2024-01-10 00:57:47",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2463186",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hermes3d",
      "member_since": "14 February 2021",
      "posts": "151",
      "topics": null,
      "followers": "15",
      "following": "42"
    }
  },
  "2468489": {
    "overal_rating": [
      "Score*",
      "4.000",
      "4.156",
      "4.406",
      "3.950",
      "3.688",
      "3.500"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.000",
      "4.156",
      "4.406",
      "3.950",
      "3.688",
      "3.500"
    ],
    "participant": "charlie-oh",
    "game_title": "minute mail",
    "platforms": [
      "web"
    ],
    "rating_count": 32,
    "comments_received": 21,
    "comments_raw": [
      "REALLY GOOD!!I clipped out of the level - very fun :)",
      "Woahhhhhh!!!!\nThe intro animation was so funnyâ\u0080¦.\nLoved the art and the concept",
      "The game itself is amazing   but I did find a few little things here, 1st on the last delivery I kept clipping into the ground causing me have to wait to restart the last delivery, I would suggest adding a reset button for the player that mess up and don't have enough time, also some particle effects when jumping would be cool or maybe a dust cloud when landing or some more juice to players interactions or something, Anyways This game was a fun experience and would Love to see it expanded upon in the future (hopefully)   I am very impressed that you managed to pull a 3d platformer game with decent enough mechanics  and character controls off,",
      "I donâ\u0080\u0099t know how you managed to create a whole 3D world in such a short span of time.\nAmazing job!",
      "Really great job! I have been wanting to learn 3d in Godot for the last year so I am really impressed how much you were able to get done and in such a polished way! I used controller and it felt really clean. Great job!",
      "Impressive work for all that during this gamejam period of time! Even funny intro sequence, full-fledged settings and sfx controls and all.",
      "At the moment it's the game of the jam that hooked me longer ! I stop at the letter far in the high buildings...\"try to not do that again\"^^ awesome controls and level design !",
      "Controls are very smooth and parkour feeling is excellent. Love the bunny design too. Good job !",
      "I love the intro cutscene and the characters. Movement controls are very smooth so it's fun to deliver those letters. Great job!",
      "Really good layout for making the deliveries and the intro is nicely done",
      "Great game with a good difficulty ramp. Loved running around. Got trapped inside some walls but that didn't bother me too much.",
      "The movement was really fluid, had a lot of fun hopping around",
      "The visuals are awesome, and i liked the short story :) Running with this character controller feels satisfying, there are almost always multiple route to the goal, some are more expert than others. There is something nice about getting to the goal by  walljumping then grabbing the ledge and going a compleatly different route than intended :D",
      "The aesthetics of this game are absolutely amazing!",
      "i never want to be hired to deliver post without my consent again",
      "Nice character models, the bouncing text is a great effect.",
      "Love the opening made with Godot animation!! I really enjoyed the gameplay, especially trying to figure out the right route to take. The character models are super cute, and the city is simple but still looks really good. If this was a full game I'd probably play it all the time, it's so much fun!",
      "This game is so good.  The gameplay reminds me a bit of mirror's edge, and I love quality simple 3D art like this.  Excellent job!",
      "Awesome entry. The intro cutscene was animated really well. The models and colors are really nice and the city is laid out well. It might be good if there was some kind of texture on the buildings.",
      "Really cool idea! The parkour mechanics work exceptionally well. Love the environment and openness you get to run around in. Fun game!!",
      "I really liked the visuals of your game, altought I would love the idea expanded upon, I think it would be great if you could deliver more mails in the same timeframe, without collecting it from the office, or maybe add some more poststands, from which the mail can be collected, as it felt a bit tedious to go back to next mail, and then getting almost the exact same location to deliver the mail to again, And the whole idea of the game reminded me of this:https://www.youtube.com/watch?v=0Kvw2BPKjz0"
    ],
    "comments_posted": 40,
    "created_at": "2024-01-13 16:31:05",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2468489",
    "coolness": 58,
    "participant_info": {
      "profile_url": "https://itch.io/profile/charlie-oh",
      "member_since": "14 March 2020",
      "posts": "46",
      "topics": null,
      "followers": "8",
      "following": "1"
    }
  },
  "2471080": {
    "overal_rating": [
      "Score*",
      "1.400",
      "1.260",
      "1.400",
      "0.700",
      "0.700",
      "1.092"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.333",
      "3.000",
      "3.333",
      "1.667",
      "1.667",
      "2.600"
    ],
    "participant": "noobyderp",
    "game_title": "moretime moreproblems",
    "platforms": [
      "windows"
    ],
    "rating_count": 3,
    "comments_received": 2,
    "comments_raw": [
      "I liked the idea of having a timer for each room. I got stuck in like room 4 or 5 because even after killing everyone the guy didn't light up for me. I feel like the hit box was a few pixels bigger than the character when dealing with spikes, and that most of the jumps had to be timed exactly right which was a bit annoying. But overall it was fun to play.",
      "Unfortunelty only the first room is playable. When interacting with the first door the game crashes. The art looks amazing and the visual effects look great"
    ],
    "comments_posted": 0,
    "created_at": "2024-01-14 23:59:38",
    "game_url": "https://itch.io/jam/gdko-2024/rate/2471080",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/noobyderp",
      "member_since": "03 April 2023",
      "posts": "20",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  }
}