{
  "1921509": {
    "overal_rating": [
      "Score*",
      "4.280",
      "4.400",
      "4.080",
      "3.680",
      "3.320"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.280",
      "4.400",
      "4.080",
      "3.680",
      "3.320"
    ],
    "participant": "simoncb",
    "game_title": "A Duck on Wheels Part 2: Wheelectric Duckaloo",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 21,
    "comments_raw": [
      "It was so wicked playing this game again, now even better than ever!Thank you for sticking with it again, and blowing it out of proportion. Great visuals, great mechanics pushing in the cassette and ofc, radical new looks! AWESOME!",
      "this is a game i sadly missed in the last round! my god..... this is the 3rd game i've played on this jam that I've said this is STEAM material! I am at a loss for words.... OUTSTANDING!  5/5 you are not only moving onto round 3 but i can see you in the last round honestly.",
      "this was super fun! loved every bt of it and really hope you continue it next round",
      "Keep it going! I want more and more every round. Had a great time with this on stream this morning and left feedback throughout. Couldn't tag you on Discord because I'm not sure what your handle is there. Had a smile on my face all throughout. Love small touches that make this game so unique and enjoyable. Well done.",
      "Very nicely built off of your round 1 entry! The sounds you put together worked really well with the unique thematic you have going on",
      "Such a delightfully bizarre world you've created",
      "Oh man, a lot has changed since I played it in the first version.... Some launchers up.... On the plus side the sound design, you can see that it has been taken care of, on the + side you have added a lot of stuff to the game. On the minus is that there is no major storyline at the beginning.",
      "Loved it!! The progression of the music and Neon lights!!",
      "I love all the Neon you added, I love me a 90s style world!",
      "This is such a unique idea.  Especially considering (if I recall) you couldn't think of an idea in round 1.  You are really taking this to an amazing level.",
      "I fell in love with inserting a cassette :D",
      "I absolutely adore the gradual layering of the music. I love this one even more than Part 1, especially because of the changing art styles!",
      "Jesus what a great game. The new levels are insanely \"RADICAL\" and \"BODACIOUS\" and I love the way each audio log layers something on top of the music and adds new stuff to the level. The pixel art platformer section was really cool with great pixel art! overall super great game!",
      "I love this so much! Somehow even better than your first entry. I love this style of game",
      "I Love the Cassete mechanics and the TV visuals hahaha ...  enjoyed a lot this game .... congrats!!",
      "Really dig the style of the game. The platforming was fun and the music was great and the bonus was incredible.",
      "This is so cool. Love everything about it!",
      "Wow. Just wow. A duck on wheels has once again amazed me by the creativity of some people.",
      "You put a smile on my face. You really out did youself from round one. Love the new visuals and the audio was perfect.",
      "Damn thatâ\u0080\u0099s cool",
      "haha this is wild and I love it. Really liked layering of the music stems with the cassette deck switches and all the colours and stuff and the little touches like the duck icon moving through the tube, really well done stuff. Awesome entry!"
    ],
    "comments_posted": 0,
    "created_at": "2023-02-11 20:58:32",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1921509",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/simoncb",
      "member_since": "08 April 2015",
      "posts": "80",
      "topics": "1",
      "followers": "8",
      "following": "8"
    }
  },
  "1923565": {
    "overal_rating": [
      "Score*",
      "3.577",
      "3.699",
      "3.577",
      "3.759",
      "2.910"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.688",
      "3.813",
      "3.688",
      "3.875",
      "3.000"
    ],
    "participant": "zonlee1",
    "game_title": "A Little Lost",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 11,
    "comments_raw": [
      "This was a really good game! the effect of the echo location was super cool and I loved the way all the cubes bouncing off the walls. My only issue was the length of the effect where even if you do it may times in a row you only see the cave for a few seconds. maybe having the echolocation reveal the cave for more time could help players get a better idea of their surroundings. but still really solid game",
      "Thanks for the recommendation. I played on stream and had a great time and left feedback throughout. Such a cool concept and well executed. Great work.",
      "Very nice idea, simple concept but great execution! I could see a lot of game mechanics that you could add building off of this, would be really cool to see where you take it if you continue to work on it.",
      "That's a really unique idea. The music and sound effects are so relaxing!",
      "Loved the mechanics and how you had to use the eco to move around!",
      "I like the concept and using the echo sounds to find your way was very unique and fun. Nice job!",
      "interesting and beautiful mechanics. I liked the creativity of this game :)",
      "I really like the updated version and using the echo sounds to bounce off the walls is awesome. I managed to get reunited with the family and I think the music and sounds are really good",
      "The idea of the sound reflecting on the walls .... exquisite .... great job!!",
      "Great concept that was well done, this was a lot of fun.",
      "Good sound effects. Cool concept playing as a bat and emitting sound to explore and navigate the environment. Good job!"
    ],
    "comments_posted": 0,
    "created_at": "2023-02-14 05:22:30",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1923565",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zonlee1",
      "member_since": "28 January 2021",
      "posts": "12",
      "topics": "2",
      "followers": "1",
      "following": null
    }
  },
  "1926621": {
    "overal_rating": [
      "Score*",
      "2.765",
      "2.706",
      "2.588",
      "2.941",
      "2.412"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.765",
      "2.706",
      "2.588",
      "2.941",
      "2.412"
    ],
    "participant": "fennecfu",
    "game_title": "A Wild Ride",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 11,
    "comments_raw": [
      "What I want to know is who cut both the brakes!? Great work, FennecFu. I enjoyed the art style. It made the experience unique and interesting and worked really well for the cutscenes. As others suggested, a music track, or noises on scene transitions in the beginning would help a lot. I also wondered if the audio was working until the chase started. Good job!",
      "Good story, very minimalist. And don't be afraid to swear. Swearing is good, especially if this is the current situation. The only thing I can say is that the sound effects when the player moves left and right is a bit pain. The screeches kinda a bit too much, honestly. Could've had more sound effects to make it more immersive and alive, especially during the cutscenes. But overall, good entry.",
      "Cool story! Contrary to others I actually quite liked the art style, it was minimalistic but in a good way. I would have liked some sound to accompany the dialogue though, at the very least maybe some light music or something to set the tone/mood",
      "Dont know about others, but I had fun reading the story, it is fast and furious in minimal resolution :D",
      "I'm fan of these car games, and the story was entertaining. Felt like there could have been a bit more to the driving though.",
      "The art is not that high quality but the game has a great story.",
      "I like the storyline and the twist at the end is good. The sounds for the car are really good but it doesn't match the feel of the game in my opinion as the cars don't feel like they're moving as fast as they sound and you don't get to see the crash happen on screen. I also think deer walking across the road would be a bit better than bollards but it's still good having to dodge something. The sounds and story are what's important for this round and I think you've done a pretty decent job there",
      "Love the art style,  story's not too bad either! The gameplay is just incredibly dull and basic.",
      "Like the art style !!! good job!",
      "Was hoping for some need for speed action. An epic story though =D. And with a bit of bloom, the art style would be 10/10. Well done.",
      "Neat concept.  Would've liked to see a little more challenging gameplay.  Good job all around!"
    ],
    "comments_posted": 5,
    "created_at": "2023-02-14 23:23:21",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926621",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/fennecfu",
      "member_since": "26 June 2018",
      "posts": "515",
      "topics": "6",
      "followers": "33",
      "following": "18"
    }
  },
  "1877947": {
    "overal_rating": [
      "Score*",
      "4.240",
      "3.600",
      "3.520",
      "3.240",
      "2.640"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.240",
      "3.600",
      "3.520",
      "3.240",
      "2.640"
    ],
    "participant": "keltfire",
    "game_title": "Awake",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 17,
    "comments_raw": [
      "Me: I'm gonna rush this! Watch that speed grooow!",
      "The audio for this is perfection! I've played it the last couple of rounds and love what you've added to the end.",
      "The music fits the atmosphere well! Wish there was more story in the beginning though. But the gameplay was challenging and interesting!!",
      "I can't believe I beat it on my second try!!Loved it, even if I'm not the best at it. Gave me those \"oh, sh--\" moments that make for great gaming. Glad you could join the stream.",
      "Even thought I've already played this before, I still got a jumpscare when I played it again haha. I'm glad that there was more story this round too! I love this game, it's super fun and I've enjoyed playing it even more this round!",
      "Massively great improvements on this. Great music and sounds!",
      "I like the choice of music here, I think it really fits. I was interested in seeing where this would go, and I like the bits of story added near the end. I will say though, at first I didn't realize there was an end until I saw a comment that said to go faster, so I agree with what some others have said about having more story near the beginning.",
      "Tons of fun to play! Music was great and the difficulty was balanced. If I lost, it felt like I made a mistake, which is exactly what you want. Nice work!",
      "The music and story really fit together great and create a fittingatmosphere. The game was also quite hard.",
      "I really love the boss fight and the music is very apt, it gets really fun once you find a good speed for yourself. Would have loved more audio and story! I hope you get the opportunity to develop this even further.",
      "You can see that the game is a little more developed than in the previous round. At the beginning there is only one mention of the plot, \"Huh, where am i?\", I think you could have given it a little better plot. Otherwise a nice addictive game.",
      "That was fun, I like how fast you can go and how the story progresses with it. At first I didn't realize you were supposed to accelerate, I was moving slowly to make sure to not hit anything and I thought that was the whole game haha.",
      "The gameplay feels much better from Round 1.  Some fun new mechanics in there as well.  Took me a while to make it all the way through, but I had plenty of \"one more try\" moments.  The audio was spot on, too.  Super ominous.  Great job!",
      "This feels a lot better than round 1. I was able to make it much further this time around and it was fun instead of frustratingly difficult. I enjoyed the additional audio.",
      "really challenging and yet fun to play! the ominous sound was really fitting and it felt good dodging the attacks! I missed a lot of text and completely missed the pressing spacebar to stay awake the first time, because the text was top the top and bottom and I was too focused on not losing haha.",
      "Staying awake was challenging and I got a victory with 25 times falling asleep, which I'm sure I could improve on with another playthrough. I really liked playing the game and the sounds are still awesome. I also like the changes you've made and having to press space to stay awake near the end is really cool. One little thing I noticed was that the text can overlap at the bottom on rare occasions",
      "513.12 seconds. It was a huge improvement over your round 1 version imo. Really great use of sounds, that sting when the thing comes up over the horizon and when the red line of spikes shoots is really effective. Awesome work!I still got tripped up by some small spikes, or trapped here and there but the gameplay is fun so I really wanted to reach the end."
    ],
    "comments_posted": 50,
    "created_at": "2023-02-14 21:50:18",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1877947",
    "coolness": 53,
    "participant_info": {
      "profile_url": "https://itch.io/profile/keltfire",
      "member_since": "13 June 2020",
      "posts": "312",
      "topics": null,
      "followers": "12",
      "following": "3"
    }
  },
  "1926329": {
    "overal_rating": [
      "Score*",
      "2.892",
      "3.296",
      "2.892",
      "2.422",
      "2.623"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.308",
      "3.769",
      "3.308",
      "2.769",
      "3.000"
    ],
    "participant": "spadeship",
    "game_title": "Babywhale Rescue",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 9,
    "comments_raw": [
      "Soothing and enjoyable. It was just challenging enough without being frustrating. I like how the round task drove your theme. It was a great idea for the round. I ran into the seaweed after the happy ending because I hadn't hit them yet and wanted to see what would happen, I was just stuck in place. After a restart and running directly into them I saw your slick restart animation. Well done there. Might have been a good opportunity for linger for a few more frames though, make a more exaggerated failure sound or mom whale cry and then trigger the transition. Overall, great work.",
      "Simple and well executed idea, I liked it! Good sounds to fit the game as well.",
      "Thanks for playing! Your suggestions are really helpful!!",
      "I really liked how you did your controls.  Made it really fun and unique to play!",
      "It was really fun!",
      "Simple and unique.  Took a bit to get used to the speed of the sub.  Felt a little fast.  Maybe allow the player to control the speed forward?  (Not sure if it would work.  Just brainstorming.)  Overall, good entry.  Nice job.",
      "Nice atmosphere",
      "Great concept and a fun game.",
      "I managed to get a happy ending. Really nice game with great underwater audio"
    ],
    "comments_posted": 11,
    "created_at": "2023-02-14 19:13:00",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926329",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spadeship",
      "member_since": "13 March 2022",
      "posts": "264",
      "topics": null,
      "followers": "1",
      "following": "1"
    }
  },
  "1926551": {
    "overal_rating": [
      "Score*",
      "2.623",
      "2.960",
      "2.354",
      "2.287",
      "1.883"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.000",
      "3.385",
      "2.692",
      "2.615",
      "2.154"
    ],
    "participant": "projectpaddy",
    "game_title": "Boxing Day Sim (GDKO 2023 Round 2)",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 9,
    "comments_raw": [
      "Not exactly what I was anticipating but funny and a good environment nonetheless!",
      "Super funny game concept with very fitting music!",
      "Fun game with a lot of improvements from the last round.",
      "Really made me laugh. Funny/10",
      "Somehow I wish the scoring made less sense, like you could add dividing and subtracting in for really arbitrary reasons, start a drift combo, etc. There's so much chaos already here and yet so much space for more. Great work.",
      "Some nice updates to this one.  I particularly like the movie quotes used throughout.  The scoring didn't quite make sense.  And it felt MUCH easier with the timer reset (good or bad could be debated).  Focusing on audio, though, there were some good additions.  Nice job!",
      "I'm probably going to be the only person to say this but I actually prefer the first version for the gameplay as I felt it had a more fun challenge to it but the sounds which is more important for this round I really like in this Boxing Day version. The characters say some funny lines and really glad you kept the welcome to Costco intro",
      "Fun little game. I really like the new sound effects, they are fun to listen to while you are going through the store, and the controls felt really nice.",
      "The game feels a lot better from round 1, small changes like UI, arrow pointing to the next gift, and zoomed out a bit more, really made the difference. The audio had me laughing. Love the Idiocracy reference."
    ],
    "comments_posted": 0,
    "created_at": "2023-02-14 23:17:26",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926551",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/projectpaddy",
      "member_since": "24 November 2020",
      "posts": "177",
      "topics": "3",
      "followers": "21",
      "following": "186"
    }
  },
  "1902729": {
    "overal_rating": [
      "Score*",
      "4.750",
      "4.833",
      "4.806",
      "4.778",
      "4.833"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.750",
      "4.833",
      "4.806",
      "4.778",
      "4.833"
    ],
    "participant": "endmarkgames",
    "game_title": "Coffee Date",
    "platforms": [
      "web"
    ],
    "rating_count": 36,
    "comments_received": 26,
    "comments_raw": [
      "Outstanding effort! Love who you worked in the names of other Devs. A joy to play through. I managed to make it to the end of the date :)",
      "You had me laughing out loud.  Super great concept, loved the multiple endings.",
      "It has coffee and farts... loved it! Really good job on the use of music and having the player interact!",
      "Mega cool game, I enjoyed it, it actually feels polished. Sounds added, and I really like the chill music in the background. Very cool game, polished various details, such as this fart, for example.",
      "Great game, i laugh a lot with the farts mechanics XD!!! ... Love it!",
      "Ooooh, great game with a great story and pretty funny.",
      "The music is nice, and the story and gameplay is so funny!! I kept ruining the date but managed to succeed at last haha",
      "Amazing! So funny and such engaging and hilarious gameplay too! 5 stars across the board! I can't say anything bad about it haha",
      "Wow, you really took this round to the next level.  I really love how you have additional sound effects playing along with the narration adding to the feel of this game. Best game Iâ\u0080\u0099ve played so far, you really nailed this task.",
      "Very funny experience but also genuinely wholesome, especially with the GDKO references you've snuck in there. Really awesome job!",
      "lol that was great!",
      "Whouh, for me thats one of the the best entry considering the theme. Great Job!!!!",
      "This is so polished, and fun, and great, and full of farts, and cute <3 it's a win, bravo ! Seriously I'm amazed by the quality of your entry, very well done ! here take my stars *****",
      "Endmark, buddy, bro... this game is a masterpiece. Seriously you took this round and completely went ham on the humor and writing, I'm not usually a guy for toilet humor but this is fantastic, and thanks for the shoutout ahha. 5 stars, on all. I don't joke.",
      "Amazing! Great story, great use of the audio as a mechanic, great mood, music and art.",
      "Damn this game was spectacular. I have a lot to say so Ill go down the list.",
      "I WANT THAT NOVEL! Spacespy vs Ghostbit.  So many great references in there.",
      "This is excellent. Really funny story and gameplay to match",
      "HILARIOUS!",
      "That was hilarious! I had a lot of fun spotting all the references and the game fit the theme perfectly. Great job!",
      "Iconic. Inspiring. Absolutely amazing.",
      "I just couldn't stop laughing with this. I see GOTY potential here",
      "A dating app named lerp! Also this got a real laugh out of me, what a concept to put to such a fine tuned execution. Well done indeed :D",
      "This exceeded my expectations in so many ways! What an insanely polished and hilarious game, and it fits the theme so perfectly as well. 5/5",
      "Absolutely loved it! Hilarious narration, great audio and really cute pixel art! I had to play though and get all the endings, and each one was a joy to experience! Fantastic job!",
      "This was super fun HA HA! Finally found love, after so many ruined dates :)"
    ],
    "comments_posted": 36,
    "created_at": "2023-02-14 22:38:26",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1902729",
    "coolness": 38,
    "participant_info": {
      "profile_url": "https://itch.io/profile/endmarkgames",
      "member_since": "09 July 2020",
      "posts": "766",
      "topics": "2",
      "followers": "30",
      "following": "17"
    }
  },
  "1924058": {
    "overal_rating": [
      "Score*",
      "3.923",
      "3.808",
      "4.077",
      "4.038",
      "3.808"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.923",
      "3.808",
      "4.077",
      "4.038",
      "3.808"
    ],
    "participant": "game-dav",
    "game_title": "Comet rocket - GDKO 2023 - Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 18,
    "comments_raw": [
      "THIS IS SO GOOD! I love how the audio mixed so well with the narrative in the beginning of the game and the voice acting for the audio logs *chefs kiss*. Its also such a great organic progression of your last version.",
      "I really enjoyed this entry. The sound design was very well done and evoked a kind of dreamy spacey melancholy. Very cool.",
      "The atmosphere and music is incredible! I love the new features you've added, especially the map and the audio logs. You've done such a good job!! :)",
      "Really loved the music, and how you had to go around finding the audio logs!",
      "Love all the updates. Was a pleasure to play on stream. Well done.",
      "that was such a great game! loved the story, atmosphere, and entire feel of it!",
      "Your game really has a great feel to it.  The music gives it a nice mysterious feel.",
      "Very cool and elaborate storyline and the whole beginning.",
      "Very apt sound design overall, from music to speech, a big level up from the first round!Unrelated to this round, but the amount of controls can be a bit excessive, I would recommend to limit it to just the keyboard, and simply autoplay the logs when you pick them up to keep the player immersed in the beauty of space~",
      "Very nice story addition to your round 1 entry with the audio logs! As mentioned in discord before the submission deadline, I think it would be cool if there were some small clues to audio log locations in dialogues you have with the various creatures.",
      "Really nice story, mysterious and intriguing. I hope I didn't miss the ending, I only got the 5 logs and didn't know if there was any more from there :)",
      "WAW. Seriously a big step up from the previous version, here evrything come together. I was very intrigued by the story and it was great to see these little aliens again. The voice (I don't know if it's yours ?) is very well acted too ! Good job !",
      "I like how you've expanded on the idea, the sound and mood work really well together. Great job.",
      "You've definitely improved on what was already a great game. The map and audio logs were really cool and I like the screen wrap and the aliens and the story objective, it all works really well together",
      "I was already impressed by this one from Round 1.  And the addition of sound just takes it to the next level.  Really nicely done!",
      "I really like this one. This is solid, everything feels well together. Very atmospheric, really nice audio, moody art and great dialogues and story. 5 stars.",
      "Really good job adding the audio story elements! That Minimap helped a lot also, I'm glad it didn't give away the locations of the audio logs though!",
      "The wrap around really made the game feel a lot better and the minimap really helped to get around to find all of the different locations. The audio felt just right for this type of game. It would be nice to listen to the audio logs while flying around and to have keyboard controls for playing the logs."
    ],
    "comments_posted": 23,
    "created_at": "2023-02-14 03:14:33",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1924058",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/game-dav",
      "member_since": "23 January 2021",
      "posts": "934",
      "topics": "19",
      "followers": "24",
      "following": "14"
    }
  },
  "1924715": {
    "overal_rating": [
      "Score*",
      "2.340",
      "2.413",
      "2.267",
      "2.267",
      "2.486"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.909",
      "3.000",
      "2.818",
      "2.818",
      "3.091"
    ],
    "participant": "dementedsoul",
    "game_title": "Crashed",
    "platforms": [
      "windows"
    ],
    "rating_count": 11,
    "comments_received": 5,
    "comments_raw": [
      "Help, I'm naked in a cave!! I played on stream this morning and had a great time with it. Left feedback throughout my playthrough, but the primary critique is I wish I had an option of inverted or not mouse controls. Nice and creepy, with excellent use of sound to reinforce the dread.",
      "Great horror experience the sound really helped make it scary.",
      "I like the atmosphere of the game with the sound and effects, really immersive. Good job.",
      "Its a nice game but it needs to be improved",
      "I managed to make it out! Very spooky and haunting, great atmosphere you've set up with effects and sounds alike."
    ],
    "comments_posted": 0,
    "created_at": "2023-02-13 16:24:51",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1924715",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dementedsoul",
      "member_since": "17 February 2021",
      "posts": "36",
      "topics": "2",
      "followers": "11",
      "following": null
    }
  },
  "1925888": {
    "overal_rating": [
      "Score*",
      "3.176",
      "2.722",
      "2.528",
      "2.463",
      "2.917"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "3.000",
      "2.786",
      "2.714",
      "3.214"
    ],
    "participant": "aerial301",
    "game_title": "Dawn of Chaos",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 9,
    "comments_raw": [
      "Nice working having a story to follow! The magic fighting mechanic at the end seemed like it was the start of something further, I was intrigued how certain tunes would play based on the attack, not sure if I missed there being a rhythmic element to the battle but that could have been quite interesting. Good atmosphere, and +1 for going the extra mile to have some spoken dialogue.",
      "Great start to a fun-looking RPG game! Would love to see how this gets expanded on, especially if you keep with the already great sound effects you have set up.",
      "Really great voiceover and atmosphere! Story was quite interesting too.",
      "omg when i was at that surely part, i said out loud, and don't call me shirley. next dialog. was just that! lmao yes! i popped for that lol",
      "Very nice work, interesting use of AI to produce assets quickly and a decent story",
      "Like the universe of the game and the story. Surely something you can build on. Great work!!",
      "The story telling with the audio was really well done, especially liking the laughter and sounds with the messy mist boss. I think the 2 magic powers could have been more different like one could be fire and the other lightning but other than that, I think this is fantastic. Also like how you see the rain start inside the house and the ending is really nice. Excited to see more",
      "This is a fun game with an intriguing story leaving a lot to look forward to.",
      "The atmosphere is really nice in this.  The crackling fire, the lightning crash.  Would've like to see a touch more gameplay.  You definitely have me intrigued.  I want to know more about that evil.  Nice work."
    ],
    "comments_posted": 11,
    "created_at": "2023-02-14 14:29:37",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925888",
    "coolness": 45,
    "participant_info": {
      "profile_url": "https://itch.io/profile/aerial301",
      "member_since": "12 November 2022",
      "posts": "312",
      "topics": null,
      "followers": "9",
      "following": "7"
    }
  },
  "1926442": {
    "overal_rating": [
      "Score*",
      "3.273",
      "3.545",
      "3.591",
      "3.636",
      "3.318"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.273",
      "3.545",
      "3.591",
      "3.636",
      "3.318"
    ],
    "participant": "rsdnrs",
    "game_title": "Death Labaratory",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 14,
    "comments_raw": [
      "Really loved this one! the narration was really good and the art was also nice! I really loved the variety of challenges like playing piano and math. plus the final chase at the end was cool.",
      "I like the narration part and the art! Nice!",
      "Played on stream and left feedback throughout. So cool that you were able to take the same character and make a completely different style of game. Really well done.",
      "Interesting game...",
      "Clever narration/commentary with a fun story. Also liked the callback to the first combination the narrator mentioned, was a clever puzzle to figure out! I got a bit stuck towards the end though, couldn't figure out how to get past the fist chasing me, as I know other commenters have pointed out.",
      "Really love the color palette and the narration! The piano level was super fun. I had difficulty with the hands level like some other commenters, but got to the end eventually. Great work!",
      "Great use of limited colours here! I loved your puzzles and all the panels and control rooms and the pianos! (really liked how you could bump to the first piano and make noises!).",
      "The narrative was interesting, I liked the piano level. Some of the art was a bit wonky in terms of pixel scale, but I really liked the colors and simple vibe you were going for with it. Good game.",
      "Excellent game! I made it to the end and like the whole story, sounds and gameplay. I didn't read the spoiler in the comments until now. I thought there'd be one last panel to go through with those numbers written by the hand and maybe something with 506 I think it was. Anyways, the puzzles were fun to solve and I really like the use of the piano in the game and the whole idea in general is awesome!",
      "Game's way too hard on the hands part, it's way too hard to understand. Some of the puzzles are also hard to solve because of your voice. I can tell your first language isn't English, so if you ever feel the need to use AI tools for more clarity there's no harm.",
      "",
      "The animations for the cat are so cute! I wish it was clearer how to get past the hand but I wanted to know how it ended so I kept going :)",
      "Thanks for hanging out on stream. The pixel art is really nice here, just some audio levelling issues. The hands were definitely the hardest part, maybe the cat could \"think\" a hint for the player? Enjoyed playing your submission :)",
      "I had fun, the concept was great and the audio was well done. I couldn't get past the hand though and quit after trying several times."
    ],
    "comments_posted": 11,
    "created_at": "2023-02-14 20:20:16",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926442",
    "coolness": 24,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rsdnrs",
      "member_since": "04 October 2021",
      "posts": "91",
      "topics": null,
      "followers": "2",
      "following": "3"
    }
  },
  "1926422": {
    "overal_rating": [
      "Score*",
      "3.456",
      "3.214",
      "3.032",
      "3.335",
      "2.547"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.563",
      "3.313",
      "3.125",
      "3.438",
      "2.625"
    ],
    "participant": "jackawaka",
    "game_title": "Desolate Artifact",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 11,
    "comments_raw": [
      "Those were some bouncy jumps! The audio on the floor was great, as well as the ambience in the cave. Great work overall, with the intro and the camera work. At some pints the platforming felt weird with the collision, but the inclusion of the falling platforms combined with the underwater gravity kept things fresh! I played on the browser, and it felt great btw.",
      "",
      "Nice use of sound effects to decorate the different areas. The sandstorm was super cool.",
      "Fun platformer, solid sound effects. Nice!",
      "Really cool platformer, it was fun.",
      "You did a lot with some really simple art.  The controls felt really good!",
      "I liked the dash, some things felt a little like I cheesed it rather than being purpose built for me to reach a platform, really engaging intro whilst the game was loading",
      "Good concept.  The intro really helps get you interested in the story from the start.  Using shift kept bringing up Sticky Keys.  I did that in round 1, but with Control.  Someone pointed out to me that Shift, Control, and Alt are really common hotkeys on Windows and should (typically) be avoided in game development.  Unsure of who specifically told me that, but thought I'd pass that along.  It helped me out.",
      "Thanks for playing my game - it led me to yours! Great sound work in the opening cutscene, and the transition from cave into the \"final area\" had me leaning forward in my seat... and you delivered a great cliffhanger. I hope you make it to Round 3! I have to know.......",
      "Love the dramatic intro and the story is really good, especially when you find out the cause of the magnetic disturbance (I won't spoil anything). I think having a character would add a lot to the game. The sounds all sound great, love the wind, the metal surface, the footsteps on the sand and especially the water. The only sound I didn't like was the footsteps on the orange platforms but that could be just my personal preference. The shift key when pressed five times brings up a sticky keys dialogue window on my windows laptop so I think pressing Spacebar would be best for dash but I like that the right mouse button also works. Overall, a really great game that feels good to play.",
      "Nice little platformer, loved how different surfaces sounded different."
    ],
    "comments_posted": 9,
    "created_at": "2023-02-14 20:16:31",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926422",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jackawaka",
      "member_since": "16 January 2017",
      "posts": "62",
      "topics": "2",
      "followers": "9",
      "following": "12"
    }
  },
  "1926528": {
    "overal_rating": [
      "Score*",
      "3.850",
      "3.500",
      "3.400",
      "2.950",
      "2.950"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.850",
      "3.500",
      "3.400",
      "2.950",
      "2.950"
    ],
    "participant": "rio85",
    "game_title": "Dream 1",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 11,
    "comments_raw": [
      "Nice music!!!",
      "Ok... where to start...",
      "Very nice addition to your round 1 entry! Good cinematics and sounds to accompany them, well done!",
      "The art and sound really leave me wanting to see more of this.  My only input would be that for a jam, the intro where you can't control anything could be a little shorter.  I feel like the point got across quickly, but I started to wonder if I was supposed to do something after a while/unsure if I was still waiting.",
      "Love that wrapped back around into the round 1 entry. Awesome seeing this come together more and more. I played on stream this morning and left feedback throughout. Another great entry. Well done.",
      "Ohhh I wasn't expecting this would be built over your first round, nice ! I really liked all the little additions you've made here and the weirdness of your sounds perfectly fits your game. Well done, I want to see more :)",
      "When there was a start, and that red person started to fall, it was a little too loud. But that's besides the point, the game much more developed than the previous version. Added a large amount of sound, and details most at the beginning. It's cool that you added the beginning, because that's what makes the game more immersive. Cool game!",
      "I am divided about this one rio85... but just because I happened to play your Round 1 submission! Of course I will rate this unbiased, but here are my thoughts:",
      "",
      "Wow, that was awesome! The sound effects and music alone gives off otherworldly vibes. And the character animation looks great too!!",
      "This was super interesting! I loved the opening cutscene it was super trippy and the music accompanying it was also great. there was a bug through, when I got to the main section all the audio cut out and I didn't hear anything"
    ],
    "comments_posted": 8,
    "created_at": "2023-02-14 21:26:02",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926528",
    "coolness": 14,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rio85",
      "member_since": "04 July 2017",
      "posts": "38",
      "topics": "2",
      "followers": "5",
      "following": "2"
    }
  },
  "1926670": {
    "overal_rating": [
      "Score*",
      "2.661",
      "2.310",
      "2.380",
      "2.731",
      "2.170"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.167",
      "2.750",
      "2.833",
      "3.250",
      "2.583"
    ],
    "participant": "zhzh",
    "game_title": "Dream Core",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 10,
    "comments_raw": [
      "Story is straightforward, short, and simple. It's a bit lacking of more engagement, but it delivers something. Good submission.",
      "Iâ\u0080\u0099ll be straightforward and say I wasnâ\u0080\u0099t able to really play (and accordingly didnâ\u0080\u0099t rate, so no harm done to your score). The browser graphics were too demanding and was seeing like 1-5fps. Admittedly Iâ\u0080\u0099m on a laptop, but most other unity 3d games were running nicely in browser - maybe too many post processor effects? Just thought you should know!",
      "Cool portals mechanic, fun story to read through!",
      "Interesting and fun game. I liked the portals and the ending.",
      "This was a fun submission - i really liked that there was no punishment for getting it wrong, just more flavourful story to read :) hope to see more of you in GDKO!",
      "Loved the portal mechanic!!",
      "The portal mechanic is really fun (and visually awesome).  I would love to see that expanded on, but in a different way.  (Seriously.  Push this further.)",
      "The portals look really cool. The audio mechanics are interesting, but I feel that they could have been expanded on a bit more. For example, maybe having multiple endings, and different paths instead of one \"right\" choice every time.",
      "Portal system is fun :)",
      "It's alright, I don't think the FPS style controls really fit the text adventure theme, it all feels a bit slow and clunky. However that portal mechanic's brilliant and I'd love to see it in a different context."
    ],
    "comments_posted": 0,
    "created_at": "2023-02-14 23:54:45",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926670",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/zhzh",
      "member_since": "12 December 2022",
      "posts": "33",
      "topics": null,
      "followers": "3",
      "following": null
    }
  },
  "1909600": {
    "overal_rating": [
      "Score*",
      "3.111",
      "3.306",
      "3.435",
      "3.176",
      "2.722"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.429",
      "3.643",
      "3.786",
      "3.500",
      "3.000"
    ],
    "participant": "theduckcow",
    "game_title": "Echoic Recall",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 11,
    "comments_raw": [
      "What a beautiful little game and unique concept. Perfectly executed, just the right length for a jam entry, and a perfect match for the theme. Top marks from me.",
      "Such a unique concept, I had a great time playing this!",
      "I really liked the concept and music!",
      "Nice use of sound to literally drive the story!",
      "Short and sweet - I like that you play as a shadow self. I wonder if you could start to see more of the character as they get closer to remembering? A great foundation to build on with more, nice work!",
      "Very enjoyable experience, I loved the story.",
      "Really loved this, as it felt personal and hit a personal string for me. Also loved how after you fully remember everything the music got loud and amazing!",
      "Interesting story.  Feels very personal.  Would like to see a little more in the way of sound.  Though (as a fellow pianist) I love that you performed it yourself.  Good job.",
      "Cool story and take on the theme! Also very much enjoyed the piano music",
      "The piano music is awesome and I really like the story behind the game. I think adding a voice to the dialogue would have improved it but it's still great and I like the other sound effects and how the character is discovering things about himself",
      "Obviously some pretty deep subject matter here. I think weaving audio into the story was done well and your piano cover was evocative and set the tone. Nice work!"
    ],
    "comments_posted": 13,
    "created_at": "2023-02-14 22:34:49",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1909600",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/theduckcow",
      "member_since": "30 January 2021",
      "posts": "269",
      "topics": "3",
      "followers": "23",
      "following": "9"
    }
  },
  "1870211": {
    "overal_rating": [
      "Score*",
      "2.444",
      "2.889",
      "2.222",
      "2.333",
      "2.278"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.444",
      "2.889",
      "2.222",
      "2.333",
      "2.278"
    ],
    "participant": "lucky2337",
    "game_title": "Escape the dungeon",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 7,
    "comments_raw": [
      "not sure what the bear traps were about, but you can be sure I stepped on every one!",
      "So glad you could join on stream. Had a great time with this one. The movement felt improved. I like the speed pickups and the added hazards. The textures all look great and I enjoyed exploring the dungeon once more.",
      "Liking the dungeon you have set up, just like from round 1. Couldn't quite figure out the easter egg step, but regardless it was a fun environment to explore, and would be interesting to see how you expand on this!",
      "The way the cutscene just bursts into action is incredible, and a feeling that I wish more games could accomplish. And the medieval dungeon mixed with the modern lamppost and bins.... somehow works for me? I wonder about the deep lore that could explain it...",
      "Loved this game last round, and i still love it now!",
      "I like the way the first mission with the trash has been changed as it looks nicer and noticed that some things have changed positions and there's also the inclusion of bear traps and chevrons but unsure what they do, perhaps will find out in a later build but they make a good sound nevertheless",
      "Some nice changes on this from Round 1.  Can tell you took the feedback to heart.  Would like to have seen the audio pushed just a little more.  But the changes are there and things are on the right track.  Nice work."
    ],
    "comments_posted": 15,
    "created_at": "2023-02-14 23:02:20",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1870211",
    "coolness": 28,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lucky2337",
      "member_since": "03 January 2023",
      "posts": "143",
      "topics": "4",
      "followers": "2",
      "following": "1"
    }
  },
  "1925581": {
    "overal_rating": [
      "Score*",
      "3.850",
      "4.050",
      "4.100",
      "3.500",
      "3.750"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.850",
      "4.050",
      "4.100",
      "3.500",
      "3.750"
    ],
    "participant": "cjtheegamedev",
    "game_title": "Find and Bond - GDKO 2023 Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 13,
    "comments_raw": [
      "I really like the overall feel of this game.  Looks amazing!",
      "I found. I bonded. I jammed!!Great update to your initial entry. I had a great time with this, but I am disappointed you took away my ability to breakdance! And would love to have the rhythm section mini-game keys be on opposite sides of the keyboard, but maybe that's just my brain. Great work.",
      "first a spongebob reference, now a pinky and the brain reference? lol I liked the whole mentoring thing that could be explored in future, got a lot of potential for story. I'm personally not a fan of quizzes haha so wasn't enthusiastic about the goal but amazing music, great concept, lovely visuals and full of character!",
      "Really enjoyed it, loved the Pinky & Brain reference!",
      "Liking the improvements from v1, got some more dope tracks in there and didn't expect a wild guitar hero to appear! The dialog system is clean, smooth and fluid. For the quiz portion I would add a secondary button to confirm the selection or maybe a click to select - sometimes I would hit space by accident on the wrong answers. Can't wait to see the next round!",
      "This game is nice! I love the music and the atmosphere! Good job!",
      "You picked some really good music, and I really like the little talking sound haha. I also love the names of the npcs, and the story is great!! Literally love this game so much!",
      "Love seeing the continuation from your round 1 entry, and a natural continuation at that! Fun focus around the music in interacting with the combat guy, only thing was that the timing on the rhythm minigame felt a little bit off to me. Overall though, really awesome!",
      "Super great game! Still love the art style and the music and sfxs are amazing. I also loved all the dialogue and the fun rhythm mini-game was a nice addition",
      "loved it! and i liked how you actually had to remember the things you read on the jukeboxes",
      "Still a great vibe. I loved the conversation and mini-game part with the combat director that was tied into the songs.",
      "Very well put together, feels like a complete game.",
      "A chill atmosphere with great tracks sprinkled in privacy (I could poo in peace in EVERY Js' room!)"
    ],
    "comments_posted": 10,
    "created_at": "2023-02-14 06:09:02",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925581",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/cjtheegamedev",
      "member_since": "03 November 2022",
      "posts": "59",
      "topics": null,
      "followers": "10",
      "following": "35"
    }
  },
  "1926635": {
    "overal_rating": [
      "Score*",
      "2.661",
      "2.310",
      "2.100",
      "2.591",
      "2.170"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.167",
      "2.750",
      "2.500",
      "3.083",
      "2.583"
    ],
    "participant": "samagana",
    "game_title": "Forest Treasure",
    "platforms": [
      "web"
    ],
    "rating_count": 12,
    "comments_received": 6,
    "comments_raw": [
      "Looks gorgeous and sounds great too! I felt like a bit of a fool, I took the initial person's advice to heart and actively moved away from the sounds of singing. I thought the goal was to get through the forest without being caught by whatever was singing! I got curious what happened if I did get caught, so I restarted and realized the goal is to seek the out. Probably just a foolish me thing. Great work this round.",
      "Amazed it ran in my browser as well as it did - although the visuals would completely freeze up for about 10 seconds once every minute, which made it tough to stick with exploring as much as I wanted to.",
      "I liked wandering through the forest and exploring. I only wish there were a few things to find or a few variations in the forest. Great work on this one.",
      "Great concept.  The story, the environment, the audio.  All good.  It did take quite a while to find things.  With little diversity in the landscape, it made it hard to get a feel for where you were.  Maybe a landmark or two would help?  Overall, I'm impressed with this.  Nice job!",
      "Neat idea, locating through sound! I'm not sure the game finished for me properly though, I got to the leprechaun's hat and tried interacting with it, but it just brought me back to the main menu.",
      "I found the fairy but the dialog clipped into the ground haha."
    ],
    "comments_posted": 7,
    "created_at": "2023-02-14 23:41:54",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926635",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/samagana",
      "member_since": "21 September 2022",
      "posts": "14",
      "topics": null,
      "followers": "7",
      "following": "2"
    }
  },
  "1907463": {
    "overal_rating": [
      "Score*",
      "4.900",
      "4.800",
      "4.400",
      "3.750",
      "3.050"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.900",
      "4.800",
      "4.400",
      "3.750",
      "3.050"
    ],
    "participant": "jebouin",
    "game_title": "Freight Groove",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 20,
    "comments_received": 14,
    "comments_raw": [
      "Awesome entry! The low poly models were really nice and the art and effects were super clean. The gameplay was incredible and super cool to get into that flow of hitting the notes and moving the paddle. My only issue was the focus of the game. It was weird for me to have to look to the ball screen to the notes and back over and over again. I found if I focused on one id loose focus of the other and miss a bunch of notes or drop the ball. besides this, the game was still really solid.",
      "Another incredible entry. I played on stream this morning and had a blast with it and left feedback while playing. I want to download the windows build and revisit it to see how well I can do with some of the levels. This feels like it could get addictive quickly! Incredible that you're putting out what feels like a full release game for the task.",
      "The music and the visuals were amazing and the gameplay was really well executed. The beats and the music matched up well and it felt great to play.",
      "This is amazing. I don't know how you were able to make this in just 2 weeks. It feels like a complete game you would pay for. I would buy it.",
      "Outstanding for 2 weeks work",
      "Dude you should publish this.",
      "I just adore this game. 5/5",
      "Really awesome and addicting, I could easily see this being a steam game",
      "Great game, very addicting.",
      "this is SUCH AN AMAZING GAME LIKE WHAT THE HECK. i love the combo of breakout and a rhythm game and i love how the whole game looks and all of its biomes do! but tbh anything higher than a 2 star level was basically impossible for me to do lol",
      "this game is amazing for 2 weeks, seriously impressive",
      "Amazing game here. Love the music and the sounds go great with the game. As someone who enjoys rhythm games this is one is tough. Canâ\u0080\u0099t wait to get back to this one when I have more time.",
      "having trouble with this, cant seem to get it to start? it just lingers after i choose between the to options on the split path. Also starts with \"Cleared, Acuracy: 00.00%\" which doesnt seem like it supposed to do that?",
      "I can't believe you made this in two weeks, it genuinely feels impossible. This game is amazing and one of the best I've played so far. My only feedback would be to make missing notes more punishing, for example, you could shorten the width of the paddle every time you miss, and regrow every time you're on beat. There's also not much of a \"story\" despite the introduction at the start of the game, wish there was more there considering it was the topic of the round. Great showing, seriously, knocked this out of the park."
    ],
    "comments_posted": 5,
    "created_at": "2023-02-14 23:58:39",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1907463",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jebouin",
      "member_since": "20 December 2013",
      "posts": "116",
      "topics": null,
      "followers": "106",
      "following": "16"
    }
  },
  "1926009": {
    "overal_rating": [
      "Score*",
      "3.810",
      "3.714",
      "2.952",
      "3.381",
      "3.190"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.810",
      "3.714",
      "2.952",
      "3.381",
      "3.190"
    ],
    "participant": "bluegamemc",
    "game_title": "Haunting Melody",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 13,
    "comments_raw": [
      "Very interesting use of sound, I really think you nailed the theme. Interesting idea overall actually, fun game and a great entry. Nice job!",
      "Really loved it!! I just really suck at keeping a rhythm so it made this game very hard for me. But I really enjoyed it!",
      "The story is great, the gameplay is great and the sound is awesome! Great job!",
      "Really great game mechanics, linking each part of the song to the timing of obstacles! It was simple yet effective design, with an intriguing story that left me hanging at the end",
      "Love the concept of layering music, each linked to a different type of obstacle.I'm surprised by how many others were able to make it to through, I personally never really got the hang of the controls :( but I'll take their word about the great story!",
      "Great take a on rhythm game and connecting it to a story. I really wanted to make some kind of rhythm game this round, but itâ\u0080\u0099s hard to think of anything good beside hitting the button to the beat.",
      "Very cool game.",
      "I would never pass the lazer parts if there werent any sounds :D raged, but like it :))",
      "I like that it is a rhythm game with a platforming twist! Scarrryyyy story lol. That poor guy will be running in the dark forever",
      "really nice! reminded me of the game 104! my only problem were that the controls were really slippery but other than that great submission!",
      "Really clever! I'm really liking the rhythm elements, I wish the story was better incorporated instead of notes scattered about though.",
      "The story on this was really interesting.  Did not see the ending coming, but I actually thought it was really interesting twist.  The music elements didn't quite line up rhythmically in a few places, but still could get past them after a few tries.  Really well done all around.  Nice job!",
      "I like a lot about this game, it's clever to use the timing of the audio to do the double jumps and love the little challenges that you have to do to progress. I couldn't figure out how to get past the blue spikes but still had a really good time playing it"
    ],
    "comments_posted": 9,
    "created_at": "2023-02-14 14:38:59",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926009",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bluegamemc",
      "member_since": "23 January 2022",
      "posts": "154",
      "topics": "7",
      "followers": "1",
      "following": null
    }
  },
  "1900764": {
    "overal_rating": [
      "Score*",
      "4.108",
      "3.568",
      "3.649",
      "3.541",
      "3.027"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.108",
      "3.568",
      "3.649",
      "3.541",
      "3.027"
    ],
    "participant": "brainfartstudio",
    "game_title": "Heartsong",
    "platforms": [
      "web"
    ],
    "rating_count": 37,
    "comments_received": 30,
    "comments_raw": [
      "Nice sound design! I was very frustrated with how slippery the character was though. nice simple art direction that works well for the game :)",
      "A door that goes nowhere... what a useless developer LOL - nice an atmospheric. I liked how you tied the mechanics into the coloured orbs.",
      "man, I forgot how bad I am at platformers. Easy to play, has great audio, nice general aesthetic.",
      "loved it!, will not say how many times I fell on the first jumping skill area... lol",
      "The game is really great. I really enjoy it. The game has the ability to draw you in and the movement is much improved from the first version. The controls are intuitive and the graphics are sharp and detailed. The sound design is also excellent, adding to the immersive experience. The game is challenging, but not impossible, making it a great choice for players of all skill levels.",
      "The movement is much better than in your round 1 entry and the audio fit perfectly. I just wish the game was a bit longer!",
      "Nice neon effect on the elements and the music layers ... good job",
      "Great audio to complement the fun game play. Ended way too soon for me. I would love to see more from this game combining all the different obstacles into new challenging puzzles. Felt great to control and I always appreciate the controller support for platformers.",
      "Beautiful sounds and music, with some nice platforming. Simple yet effective!",
      "really good game! simple and fun, not much of a story though",
      "Really like the music. Calm and cool. Even the art style match the Jam theme. Great Job!!",
      "Really nice work! The aesthetic is beautiful and the music slowly building up is a great addition,Neon Beats on Steam (steampowered.com)Reminds me of this.",
      "It's a Yes ! I think we went both for the idea of layering musing throughout the game, but I have pretty much 0 gameplay ahah. I think you did amazing, the gamefeel is much better then in your first entry IMO and the visuals suit well the music. (or the contrary ? hmm) Maybe the movement feels a bit slipery but hey, it adds some difficulty and fun ! Well done !",
      "I really like the sound and art here, very well made. The neon effect was also a nice addition, it's easy to go overboard with post-processing but I think you used it pretty well. Overall, great job.",
      "Thanks for the feedback.  I appreciate it!",
      "Great game, fun and simple.",
      "I really enjoyed this one! I liked how the music layered on top of itself as you collected more items and the end song was super nice.  The neon touches were also really great",
      "I feel like there could be a little more to the story but the gameplay and audio is really nice and also think it's awesome that you made the sounds yourself. The level is really well thought out and like that the green push blocks can't get trapped against walls and even when it is underneath a blue one everything works fine. The best bit for me was hearing the orb charging up, especially paired with the visuals, really well done and hope to get a chance to see what is behind the door in the future",
      "Great execution, this was a fun game and I always appreciate the controller support.",
      "â\u0080\u009cIts just a simple game. Donâ\u0080\u0099t go to crazy with the soundtrackâ\u0080\u009d\nYou 3 days later:",
      "I don't have a single doubt that this game will not make it to round 3",
      "I'd say you knocked it out of the park with this one! I was super engaged, the music was awesome, the post-processing effects were vaporwave-y, the particle effect for getting the orbs was super cool, and everything was just well put together! One little gripe would be to make the controls snappier and make the text appear more gradual and paced out throughout the levels but other than that you did an awesome job. Would love to see more of this!",
      "Definitely a fellow fan of trying to layer in the music to represent progression, and likely that there were visual color themes to match what entered the picture.",
      "I struggled to get very far because of the controls, but this is a very beautiful game, the music and sound effects are great and I love the art style!",
      "I love the audio and effects of the environment. The controls were a bit difficult to handle though, but I am not good at platformers.",
      "good game but really slippery controls made it hard to jump on moving platforms, also idk if the end was the end but i waited for a while and nothing happened so i am just going to assume that it was, good job!",
      "Glad you were there to see this one on stream. I left a lot of feedback then, but just to reiterate one point, I think the art style works really well, but you could squeeze even more out of it by adding some effects the player character/box. Squash and stretch, image angle rotation depending on movement. Juice it up a little more. Felt great to control and look forward to seeing more from  you.",
      "Cool game! The music was amazing. And the ending was awesome lol.",
      "I like the minimalist style and the ambient music. Like someone else said, the movement was a bit slippery but otherwise felt good. I liked the particle effects too.I also thought it was an interesting choice to display the character's thoughts.",
      "The controls feel great and the design, while simple, is also good. Great job :)"
    ],
    "comments_posted": 32,
    "created_at": "2023-02-14 05:37:06",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1900764",
    "coolness": 53,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "306",
      "topics": "2",
      "followers": "34",
      "following": "26"
    }
  },
  "1924711": {
    "overal_rating": [
      "Score*",
      "2.486",
      "1.828",
      "1.974",
      "2.121",
      "1.828"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.091",
      "2.273",
      "2.455",
      "2.636",
      "2.273"
    ],
    "participant": "steven-the-gamer",
    "game_title": "In The Limbo",
    "platforms": [
      "web"
    ],
    "rating_count": 11,
    "comments_received": 6,
    "comments_raw": [
      "Very fun concept, with some funny and witty commentary! Could maybe have used a little bit more guidance from the narration, but all in all it was still great.",
      "the person talking helped keep the game entertaining, possibly needs more content still, but great use of cueing to the player what they're doing even if they cant see",
      "Interesting concept.  Tough to navigate without more audio clues (which I know is the whole point).  But by making the audio the focus, I think you did exactly what you set out to do.",
      "",
      "Hard to play, but the SFX work very well and the idea is pretty interesting. Great job.",
      "Hm, tough game. Good use of audio."
    ],
    "comments_posted": 7,
    "created_at": "2023-02-14 09:08:10",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1924711",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/steven-the-gamer",
      "member_since": "28 November 2018",
      "posts": "297",
      "topics": "22",
      "followers": "103",
      "following": "25"
    }
  },
  "1861207": {
    "overal_rating": [
      "Score*",
      "2.568",
      "2.818",
      "1.440",
      "1.566",
      "1.753"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.733",
      "3.000",
      "1.533",
      "1.667",
      "1.867"
    ],
    "participant": "someidiotic",
    "game_title": "Infested & Sons Inc. LLC. Ltd.",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 4,
    "comments_raw": [
      "Cool little game!  I thought the room changes were really creative.",
      "Nice new music and sound effects, seems relatively similar to your round 1 entry though. Would've liked a bit more story elements behind it, even if just a small narrative at the beginning of the game.",
      "I didn't notice many changes from the first round, or a storyline really, but I still enjoyed the game, and the choice of music was nice!",
      "Nice work! Not much of a story, it seems. However the art is nice :)"
    ],
    "comments_posted": 0,
    "created_at": "2023-02-06 16:33:55",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1861207",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/someidiotic",
      "member_since": "13 May 2021",
      "posts": "19",
      "topics": null,
      "followers": "1",
      "following": "4"
    }
  },
  "1925898": {
    "overal_rating": [
      "Score*",
      "3.176",
      "2.722",
      "3.047",
      "2.658",
      "2.269"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "3.000",
      "3.357",
      "2.929",
      "2.500"
    ],
    "participant": "headband-house",
    "game_title": "Juliet and the Submarine [GDKO 2023 Round 2]",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 8,
    "comments_raw": [
      "I'm not sure if I was doing something wrong but I couldn't pick up the second gold sphere thing. I really love this though, I love the gradual piecing together and then finally making sense of it all! Really big improvements + additions since round 1!",
      "Cool idea of building up audio fragments! Didn't quite understand what was going on until the 3rd or 4th fragment, then I had that \"aha!\" moment which was quite awesome. Would have liked to see a proper ending to resolve it all though, really curious who Juliet is now.",
      "i like that the message got clearer as it felt like a \"you won't hear what you need to hear until it's too late\" kind of thing",
      "Under water trapped in a sub and listening to some creepy message really started to build the tension for me. Nice use of the audio and a great upgrade to your original game.",
      "This was a great game! I love the ambience of the sea and exploring around the cave was cool. That ending was insane and it was cool that it was kind of hinted at throughout the level.",
      "Absolutely brilliant, the audio revealing itself over time kept the mystery and the whole experience had a creepy ambience to it.",
      "You've really expanded your game a lot since round 1 and I like how the audio gets clearer as you progress and also like the exploratory level layout. I think it would be really cool if the sub had an arm attachment for collecting the gold thing and if the audio at what I assume to be the end was perfectly clear but it's really great overall and the audio adds a lot to the feel of the game",
      "I really loved the atmosphere of this game. It was fun and creepy."
    ],
    "comments_posted": 6,
    "created_at": "2023-02-14 23:54:56",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925898",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/headband-house",
      "member_since": "13 January 2023",
      "posts": "21",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1926647": {
    "overal_rating": [
      "Score*",
      "3.027",
      "2.422",
      "2.220",
      "2.018",
      "2.018"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.462",
      "2.769",
      "2.538",
      "2.308",
      "2.308"
    ],
    "participant": "wolfenrahd",
    "game_title": "JustanotherRPG",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 13,
    "comments_received": 6,
    "comments_raw": [
      "High level: hitting the retro game tune and style, nicely done!",
      "Classic RPG vibes in the best way possible. Would love to see a more complete version of this, but had a great time with what you submitted still. Good job.",
      "Wow, you made an RPG - that's no small task and it has an overworld and everything, congrats. Nice intro, really like the retro music and it matches with the brilliant pixel art perfectly. Like others have mentioned, there were some bugs. I myself couldn't talk to the villagers and it was like my mouse was not able to click on the attack button or even slide the music and sound levels when paused. I also noticed that I could get stuck in place if walking too much into the people and luckily found that pressing space allowed me to move again. I have seen your youtube video and it looks really cool, love the different ways the attacks can be done. Since this round is about story telling and audio, I think you'll do well, top marks from me anyhow, love what you've created so far",
      "Seems I ran into the same issues as others here - but everything I saw I liked! The music is especially nice, as well as the different footstep sounds for each floor type! I can never get enough of that. <3 All the best for this round!",
      "I always love a good RPG.  And this one certainly grabbed my attention.  Especially the art style.  Had some issues within the town, specifically on the edges.  I could just keep going forever if I missed the transition collider to the east.  And I never could do anything once I got in combat.  But with judging being on the audio, I think you're on the right track.  Reminiscent of old NES RPGs.  Nice work.",
      "Really liked the music and thought the art style was unique! Ran into some problems with gameplay though, namely controls; I couldn't figure out how to attack once I got to combat. Not sure if my game bugged maybe? From the beginning parts that I saw though, I liked the direction it was going!"
    ],
    "comments_posted": 3,
    "created_at": "2023-02-14 23:24:58",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926647",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/wolfenrahd",
      "member_since": "11 October 2016",
      "posts": "134",
      "topics": "2",
      "followers": "57",
      "following": "35"
    }
  },
  "1916281": {
    "overal_rating": [
      "Score*",
      "2.779",
      "2.340",
      "2.486",
      "2.486",
      "2.925"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.455",
      "2.909",
      "3.091",
      "3.091",
      "3.636"
    ],
    "participant": "stuckarcader",
    "game_title": "Look at Bob",
    "platforms": [
      "windows"
    ],
    "rating_count": 11,
    "comments_received": 7,
    "comments_raw": [
      "Bob is causing me heart attacks!",
      "Nice concept, the controls were slightly annoying at times and sometimes when I was trying to look at Bob as fast as I could I would still lose. Music is really good too. Great job.",
      "I played on stream and left feedback throughout. I love so much about this game. When I have a moment to revisit with just my computer speakers I want to see if I can make it home. The concept is so great for the task. This is an awesome entry.",
      "Really interesting concept.  Given you only worked on it for 2 days, really well done.  I love the artstyle, especially the (I'm assuming) shader you're using.  My one complaint is that the walking felt really slow.  Maybe a faster speed or a shorter distance?  Just my opinion, of course.  The sound was really well done.  Very ominous and had a good balance of music to Bob.  Good job.",
      "Neat concept! Controls felt slightly clunky at times, and I it sometimes felt like I was looking as fast as I could but I'd still lose so there might need to be some small tweaking there. Those minor issues aside though, I really liked the idea!",
      "Love how the game combines the left and right earphones with the gameplay and it feels very tense and enjoyable to play. I feel that the final stretch could be shortened slightly or perhaps more storytelling there but overall, really nicely done and the creepy sounds are perfect",
      "I recommend inspecting the game page.\n|https://stuckarcader.itch.io/look-at-bob|"
    ],
    "comments_posted": 15,
    "created_at": "2023-02-07 22:08:54",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1916281",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/stuckarcader",
      "member_since": "20 November 2021",
      "posts": "268",
      "topics": "20",
      "followers": "28",
      "following": "31"
    }
  },
  "1926637": {
    "overal_rating": [
      "Score*",
      "2.693",
      "2.505",
      "2.630",
      "2.818",
      "2.129"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.867",
      "2.667",
      "2.800",
      "3.000",
      "2.267"
    ],
    "participant": "snaro",
    "game_title": "Magical Flute",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 11,
    "comments_raw": [
      "The flute mechanic is a bit confusing for me. I'm not sure how the attack mechanic can hurt the enemy. The audio could've been better, maybe more variety of sound effects for the flute can help. Good job submitting it.",
      "Interesting idea, I managed to beat the game though I also had a hard time using the attack mechanic and missed a lot of notes. I think it would have been great to start with a basic flute with slower notes and have a way to upgrade it with faster and more powerful notes after you get used to the mechanic. Maybe you could also start the level with objects you have to destroy that don't attack you back. Good job, I hope to see more of this game in future rounds!",
      "Nice! Fun idea for a mechanic, though I wish I could actually hear the flute notes when played or that it would reveal some part of the music track, would have really welded it all together. It wasnâ\u0080\u0099t clear that you had to really spam the attack button, but I got there and defeated all the enemies - I think this, too, could be nicely reinforced if more of a flute track shined through on its use.",
      "I don't really understand the attach but I did finish! Interesting game, nice job :)",
      "Ooof. Had a really hard time getting the hang of the attack mechanics but I found them very interesting.",
      "Glad I managed to complete this - I had a crisis briefly where I thought I was too old and slow to use the mechanic haha.  I like the setting and the little lore we know so far, but I think the music loop is a little... relaxed maybe? But you've done some good work so far, hope to see you in Round 3!",
      "Pretty good start, the flute attack idea is very cool and has room to grow. I think it needs a lot of refinement though, especially in how fast the notes travel and how it interacts with enemies. It was sometimes hard to tell if I was even damaging them. I think if you put some more time into fine-tuning it though, it would turn out to be a really fun combat mechanic!",
      "The idea of the attack mechanic is quite interesting, but a little hard to handle ... i think",
      "The setting and story that I saw at the start as well as the sounds are great. I agree with da-dam and Mitchell Opitz about the attacks being difficult to do and I only just about managed to kill 1 enemy. I think attacking with music is cool and the idea of rotating inside the circle is good from a technical standpoint but I think a much simpler method would be better and slower enemies please or at least to start with. I think you've got a promising game and I liked what I played of it",
      "Very interesting concept, but still needs workaround ! It is a bit hard to use the attacks right now, and hard to keep the ennemy targeted. But there is definitely a good start IMO, well done :)",
      "Interesting concept.  The controls were a little awkward.  Couldn't keep many notes inside, so ended up just spamming LMB.  Would be curious to see this idea developed a little more.  Good job!"
    ],
    "comments_posted": 8,
    "created_at": "2023-02-14 23:18:33",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926637",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/snaro",
      "member_since": "29 August 2016",
      "posts": "11",
      "topics": null,
      "followers": "1",
      "following": null
    }
  },
  "1917548": {
    "overal_rating": [
      "Score*",
      "4.105",
      "3.632",
      "3.789",
      "3.789",
      "3.526"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.105",
      "3.632",
      "3.789",
      "3.789",
      "3.526"
    ],
    "participant": "sijilum",
    "game_title": "Memento",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 13,
    "comments_raw": [
      "this is one of the best executed stories of the jam! also love how you can find secret rooms by paying attention to the room layout when it suddenly flashes!",
      "Sad ending but very engaging nonetheless! Also really liked the art style and visual elements you had going on.",
      "Had a great time with this on stream. A perfectly executed, self-contained story that made great use of sound. Perfect entry for the task. You nailed it.",
      "Great game! Great art and sounds.",
      "great job! had me engaged thoughout  the entire story!",
      "Really good game. The music, sound effects and story fit perfectly together. I feel like you could already sell this.",
      "poor that guy(",
      "Simple, but effective.  Would've liked to see a little more to interact with.  But it did exactly what it set out to do.  Nice job.",
      "Overall, it's a very engaging storyline.",
      "Great use for the sound enhancing the story. I really liked the 1 bit art style and how if you venture off the path there are some other secrets to find.",
      "This was a super cool game! The story was really interesting and it was cool to figure out the story as you went along and like others have said, the ending is really great.",
      "Really nice game. My favourite part is what the player says about the rain. Love the ending and the sounds all sound great",
      "Despite it being another one of those \"The character doesn't realize they're dead\" games I think you really knocked it out of the park here. Great work."
    ],
    "comments_posted": 10,
    "created_at": "2023-02-13 23:33:29",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1917548",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "111",
      "topics": null,
      "followers": "34",
      "following": "10"
    }
  },
  "1916398": {
    "overal_rating": [
      "Score*",
      "3.632",
      "3.565",
      "2.960",
      "3.363",
      "2.892"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.154",
      "4.077",
      "3.385",
      "3.846",
      "3.308"
    ],
    "participant": "solisu",
    "game_title": "MiDoMi",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 12,
    "comments_raw": [
      "The environment is awesome and I love the entire vibe of the world. I'm not musically-inclined, so the main mechanic was tough for me to use effectively. I think like Patrick said below, if you let me store a phrase once I successfully played it then it would make advancing some of the conversations easier.Really unique take on the task. Well done.",
      "Wow, inventing a whole language here! I thought it was super interesting - just hard to keep track of all the combination, and hard to tell if I was making any progress. Might be nice that you have a dictionary or something of recent phrases, and also visually show which keys align to each staff position, any kind of crutch to help us along a little bit more and enjoy the rest of this wonderful entry.",
      "Dope art and  super unique mechanics :) Had the same problem as others with figuring out what to do next but nonetheless still a good experience",
      "great idea and execution but as others have said i wish there was a way to remember what codes meant or like a guide to help with what emotion words a person wanted but either way great submission!",
      "I really love this concept, I got a bit confused but I liked playing around and figuring out which combination of notes made what words. I agree about adding a reference that shows which combos you have unlocked, that would have really helped me. I loved the story and talking to all the characters!",
      "It's a good concept of combining music with story but for me it was rather confusing on what to do. Maybe more feedback from the people you talk to could help.",
      "Love this idea so much! This was originally what I was planning but thought it was too big of a scope haha. Really enjoyable, I love the element of discovery and how open and non-rigid it felt (even if that's just an illusion) Great job!",
      "Had to give up playing after a while but it was what I managed to get through was fun - the little girl character has some great lines! I wish there was journal or list of phrases you've discovered that could be referred back to, to save repeating through the conversation trees over and over. But the core mechanic is great and has a lot of room for interesting developments! Good job <3",
      "I thought your idea was fantastic, especially for the game jam prompt.",
      "Interesting game, I spent a lot of time here messing around before getting to the story,",
      "Very cool idea, honestly I'm mostly just intrigued by how you determined which chords translate to different emotions/phrases. I was trying to figure out if there was a pattern that you set up, such as major chords being happy, minor being sad, or something like that, but that didn't seem to be the case.",
      "Really interesting concept.  The musician in me really likes the idea of using music as a literal language.  I think I'd like to see certain notes have their own \"meaning\" so you could control responses a little.  But definitely on the right track.  Would love to see this idea developed more.  Great work!"
    ],
    "comments_posted": 2,
    "created_at": "2023-02-14 23:53:21",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1916398",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/solisu",
      "member_since": "14 March 2019",
      "posts": "31",
      "topics": null,
      "followers": "18",
      "following": "24"
    }
  },
  "1926669": {
    "overal_rating": [
      "Score*",
      "4.111",
      "4.167",
      "4.111",
      "4.278",
      "4.111"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.111",
      "4.167",
      "4.111",
      "4.278",
      "4.111"
    ],
    "participant": "nutt3d",
    "game_title": "Mr. Television",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 9,
    "comments_raw": [
      "nice game and liked the minigames and the twist! but i think i found a bug because i was waiting for the audio to end at the start and then i saw in the description it said esc skips it so pressed esc but then it loaded two guys next to each other and food was flying sideways lol i think i pressed esc right when the game was about to load or smth idk, but still nice entry!",
      "Love the twist. So well executed. I played on stream this morning and left feedback throughout. One of the more unique and enjoyable entries this round.",
      "Perfect. The environmental sounds doing storytelling is exactly how I envisioned this round to go, and this was a excellent and polished execution of that. 5/5",
      "That got creepy quickly. Like you said the beginning was a bit long but being able to skip it on reply really helped. Just need a bit more polishing and you will have a great game here. Great use of audio for the story. Well done.",
      "I think you nailed the SCP vibe you were going for! Ran into a couple bugs but the audio still delivered really well",
      "This was fun and the sounds worked out great.",
      "The mini games were a lot of fun and love how they change into something a bit more brutal, really nice artwork there and I like the sounds too, they fit nicely in the game. You've already mentioned some shortcomings, the only other thing I would have liked to see is the screen go static with the static noise and then some text saying The End. I think you've got a solid entry and I think you'll do really well",
      "I checked 20 games for now and this one is TOP - 1 for me. audio, design O_O",
      "Changing channels for minigames is an awesome idea. We need more Wario Ware inspired games out there, thank you for your contribution >:)"
    ],
    "comments_posted": 12,
    "created_at": "2023-02-14 23:48:24",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926669",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nutt3d",
      "member_since": "07 August 2022",
      "posts": "587",
      "topics": null,
      "followers": "49",
      "following": "2"
    }
  },
  "1923947": {
    "overal_rating": [
      "Score*",
      "3.842",
      "3.579",
      "3.316",
      "2.684",
      "2.316"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.842",
      "3.579",
      "3.316",
      "2.684",
      "2.316"
    ],
    "participant": "kingjaw",
    "game_title": "Murder Virus",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 9,
    "comments_raw": [
      "Really solid entry! I loved all the improvements and updates from the round 1 entry like some updated art and effects. I also liked the round based system with an upgrade shop in between.",
      "really fun! i managed to get to the heart first run and then never got further than that lol. but the game is great! i love the controls and all the unique enemies!",
      "Played this on stream (but lost the recording cause first time doing it, sorry!)As the comments also point out, great work on the new systems and the overall gameplay! The boss had nice binding of isaac vibes, and i really enjoyed the whole gameplay.I am being nitpicking here, but would have been curious how the sound could be used to tell a story.",
      "The upgrade system is a nice addition to your game. I really like how when collecting the â\u0080\u009cmoneyâ\u0080\u009d you have a sense of urgency or it will disappear, adds a bit of risk vs reward. The music was a bit loud, so it was hard to make out the narration. Great job.",
      "the upgrade system was a great addition! the only thing i did not like was that the music was louder than the FX. overall good job",
      "Even more fun than your round 1 version, love the inclusion of the shop upgrades! Though I will say I'm pretty sure the attack speed upgrade far outweighs the others, but that's just a small balancing issue",
      "A great leap forward since the last round and it was great in that round.",
      "I really liked this game in Round 1.  But you definitely managed to take it to the next level.  The upgrade system was a great addition as well.  Great job!",
      "I can't stop but keep loving this game, the addition of the story was really cool, I love how you actually have to \"pay attention\" instead of it being spoonfed to you. Also I beat the Dwayne Difficulty so I'm clearly amazing."
    ],
    "comments_posted": 3,
    "created_at": "2023-02-14 01:42:02",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1923947",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/kingjaw",
      "member_since": "14 August 2020",
      "posts": "441",
      "topics": "4",
      "followers": "38",
      "following": "4"
    }
  },
  "1922484": {
    "overal_rating": [
      "Score*",
      "4.154",
      "3.615",
      "4.000",
      "3.923",
      "3.654"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.154",
      "3.615",
      "4.000",
      "3.923",
      "3.654"
    ],
    "participant": "h4zm4tt",
    "game_title": "My Last 2 Brain Cells 2.0",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 17,
    "comments_raw": [
      "I LOVED this. The way you were able to make the jump sounds mesh with the background music no matter how many layers of the track you created really impressed me. Im not sure if you could go in any order but the order I unlocked the switches sounded perfect.",
      "Wow, this was awesome! Everything looks cool and fun. GREAT GAME!",
      "great job! i've always wanted to make a game similiar than this! loved it no complaints",
      "Holy crap such an improvement from the first round! Love the mechanics of using both characters! The music was awesome!",
      "You get all my stars here. This was the most fun I've had with an entry this round. Really glad I got to stream this one.The use of sfx to build and add to the full game soundtrack was executed so well. I could have just ran back and forth through the door in tune with the beat and had a great time. Excellent work.",
      "great game! liked the little story and the platforming but  WHY A CLIFFHANGER D:",
      "Great work with the music and improvements from the last round.",
      "The way you had the music tacked on as you get each puzzle done and timed with the sound effects was really neat! Enjoyable to play and would love to see more of this",
      "I really enjoyed the layering effect of the music, felt rewarding to unlock them. It was fun just to play with the switches and such as it was to the beat. Nice upgrade from round 1.",
      "Really enjoyed the game and the song! It felt rewarding unlock more pieces of the tune. Great work!",
      "Great stuff, I enjoyed the gradual build-up of the song",
      "fun mechanics with the switching and jumping off walls, funny and also really nice tunes",
      "Switching between the characters, very nice .... goog job",
      "This was a really great game! I loved all the improvements made from the round 1 game like the new sound effects and mechanics, plus the intro and ending dialogue. My one issue was that it wasn't very clear that  the lever on the side of the wall in the blue room activated the jump pad, but overall it was really good!",
      "I love switching between the two characters, gives an extra layer of gameplay. Brilliant work.",
      "It's a good story and really like how you can control two characters. I like the ledge hang with the big one and the wall jumps with the little dude. I was only able to get the green part of the brain activated but it's a really fun level to move in and hope to see more",
      "Nice concept :)"
    ],
    "comments_posted": 20,
    "created_at": "2023-02-12 07:23:10",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1922484",
    "coolness": 41,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "200",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "1925834": {
    "overal_rating": [
      "Score*",
      "2.960",
      "3.363",
      "2.758",
      "2.758",
      "2.422"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.385",
      "3.846",
      "3.154",
      "3.154",
      "2.769"
    ],
    "participant": "winerentertainement",
    "game_title": "Neptuna",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 10,
    "comments_raw": [
      "I really like the style of this entry. Really unique eerie environment with great character design. There's a few issues with the web build, but I really like this concept. Nice job!",
      "Very nice audio and unique visuals! As others have stated, controls were quite confusing, but I think you have a cool start to a nice puzzle game here!",
      "Thank you !!!. Hope you enjoyed it",
      "Seems like an interesting setup for a story! Mechanics-wise, was too much control text all at once without understanding why Iâ\u0080\u0099d be using these different parts - and was pretty odd to control direction using first person-like looking controls even though it moved into a platformer side view. So the controls hindered it a fair bit for me. Also agree movement could be faster (and run via shift key instead of right click feels like itâ\u0080\u0099d be more natural as a convention!)",
      "The audio is really good in this one, and it works with the robot very well too. The controls could use some work but apart from that, this is a great entry. Good job.",
      "Thanks for sharing the link in Discord. I had a good time with this one on stream. I will have to update my driver to play the download version, because I want to revisit all the puzzles. Very ambitious and impressive.",
      "Overall, a very cool storyline. You could improve that at the beginning when the music was flying, so that the noise was not there. Only later when the player gets the ability to move. And so it is otherwise very cool.",
      "",
      "Was playing this in browser on stream, but couldn't get the controls to reappear using O/P. Really like the visuals of this so far but will need to come back to it when I play some downloaded versions. (will edit this comment when I do!)",
      "Impressive work! Very cool story. It took me quite a while until I got the hang of the controls, and it was an enjoyable experience. I just wish the movement speed was a bit faster, especially since I soft-locked myself by activating the platform before I stand on it at this part:"
    ],
    "comments_posted": 7,
    "created_at": "2023-02-14 23:23:26",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925834",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/winerentertainement",
      "member_since": "07 January 2023",
      "posts": "56",
      "topics": "2",
      "followers": "2",
      "following": null
    }
  },
  "1926240": {
    "overal_rating": [
      "Score*",
      "3.699",
      "3.881",
      "3.941",
      "3.941",
      "3.517"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.813",
      "4.000",
      "4.063",
      "4.063",
      "3.625"
    ],
    "participant": "crayonmelon",
    "game_title": "OCCUPIED",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "Amazing vibes <3 Took me some time to find that secret ending but it was worth it lolz ;)",
      "I was about to give but I am happy for the man aged 25 outside the bathroom and his choices regarding the authorities.",
      "This was really cool, never actually seen a game made entirely by LIDAR generated models. The way you used them and the PS1 vibe that you gave to everything, it feels so good and feel so satisfying to watch, and makes you forget about the chaos that this kind of models create.  My only issue is that I couldn't find the gun despite having tried everything.Amazing entry!!",
      "Surreal setting but really cool! Couldn't figure out how to get the gun so I could survive the end, but fun nonetheless!",
      "This game was insane and I love it. I absolutely loved the surreal style and the low poly models were really cool. The absolute insanity of everything going on was a blast to watch and play through. my only issue was sometimes some things were unclear. Like I just was aimlessly wandering around the game for 10 minutes before I realized where the water bottle was or that there even was a water bottle. maybe giving hints or making necessary objects more clear could help players. but still awesome game.",
      "I didn't know what to expect from the screenshots but this is an interesting concept and executed very well. The audio is also used very well, fantastic work.",
      "10/10. Nice game",
      "Not sure what to say about this. I was awesome and fun.",
      "that was the most fun i ever had in a fever dream! also in the screen shot i saw you could get a gun but i could never find it, i did manage to escape with a full water bottle tho lol",
      "P is for Pause, and for Papyrus :O",
      "That was a trip.  Well thought out.  Really good use of spatial audio.  Nice job!",
      "I saw screenshots of this on twitter and didn't really know what to expect, but that was wild. I got the good ending on my second try. Just a really interesting well put together surreal experience, fantastic work.",
      "Nice ï¼¡ï¼¥ï¼³ï¼´ï¼¥ï¼´ï¼¨ï¼©ï¼£ï¼³"
    ],
    "comments_posted": 3,
    "created_at": "2023-02-14 22:00:31",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926240",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crayonmelon",
      "member_since": "22 May 2019",
      "posts": "189",
      "topics": "1",
      "followers": "60",
      "following": "13"
    }
  },
  "1924344": {
    "overal_rating": [
      "Score*",
      "4.682",
      "4.818",
      "4.773",
      "4.591",
      "4.318"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.682",
      "4.818",
      "4.773",
      "4.591",
      "4.318"
    ],
    "participant": "loten",
    "game_title": "Once Upon a Stormy Night",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 18,
    "comments_raw": [
      "Wow, definitely got a range of emotions out of me. Whole thing felt very polished, lots of good little details. Spatial audio did a lot too, nice work all around.",
      "you did fantastic! great job! my god. had me scared.",
      "I absolutely hate horror games but I enjoyed this one! I was really expecting a jumpscare but it never came lol, but great job, this is such a cool game!",
      "brilliant! it's amazing what sound effects can do. very scary game with clean art. when the opening scene popped up i knew i was gonna like this",
      "Awesome sound design! At first, I thought it was a game about interacting with objects. But then came the best part lol. Great work!",
      "Excellent use of sound to boost all elements in this entry. I really enjoyed this and glad you could watch the stream. Loved the art, though I know that's not one of the categories. This had some of the most thoughtful sound placement out of the entries I've played so far. Really well done. Top marks all around.",
      "Oooh, this is so good.",
      "Very immersive experience! The use of sound is wonderful and the pacing felt great. Nice work!",
      "Dude phenomenal little horror game.  The sound did such a good job of guiding me through the game.  Felt like I was really playing a snippet of a full fledged horror game.  My only teeny tiny note for this masterpiece is that maybe the part once the visuals cut out could have been shorter?  It was long enough that I wasn't sure if I was supposed to be doing something or quite what had happened.  Still a 5 star game all across the board for me.",
      "Okay... I wasn't aware people were making horror games.... nearly fell out of my seat at the first jump scare...... loved it.. all of it. I need more of this!!",
      "Really fantastic mood and atmosphere that you set, I was constantly on edge for a jumpscare that thankfully never came. This could easily be built off of if you wanted to make a proper horror game, even the simple interacting with objects system has a lot of room for creativity.",
      "Nicely polished game. It's cool that you added a toilet, knocking on doors, and a nice atmosphere. There's even a game within the game. It would be great to see some sort of ending to this game, as it could be a cool horror game with some more thought put into it. Of course, it's not fair to judge as it was made for a game jam and there's no need to create a full-fledged game for it. Anyway, it's a very cool game.",
      "\"You could pee all night in this game!\" - IGN",
      "Jesus this game. At first I was kind of confused I just interacted with objects without knowing what too do. and thus followed the most tense few minutes of my life. that very real horror, the horror of small things going bump in the night and the dread of not knowing was will come next. It was super tense and on top of that the art was amazing and the sound design added an amazing finish to it all, like a cherry on top. Absolutely great!",
      "Very spooky stuff. Neat art style and good use of the sound effects. Excellent work putting this together.",
      "Very good work with the audio, it drove the story and was the main element on the game as the round required. Very nice ending too.",
      "All of the sounds set a really good atmosphere and love the visuals and the story, particularly the ending which is awesome",
      "Oh my god, all the audio usage, it's all really well executed, from interactions not working after the big twist and that suspense building up, it's all amazingly done. Wow."
    ],
    "comments_posted": 24,
    "created_at": "2023-02-14 12:46:42",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1924344",
    "coolness": 42,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "159",
      "topics": null,
      "followers": "15",
      "following": "6"
    }
  },
  "1925915": {
    "overal_rating": [
      "Score*",
      "3.767",
      "3.296",
      "3.162",
      "3.162",
      "2.556"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.308",
      "3.769",
      "3.615",
      "3.615",
      "2.923"
    ],
    "participant": "da-dam",
    "game_title": "STARDUST - GDKO 2023 Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 11,
    "comments_raw": [
      "Mesmerizing and a stunningly beautiful in its minimalist art style. I love this entry. Way to take the round task and crush it. Great work.",
      "Really beautiful use of visuals and sound!",
      "Very beautiful and nice sounds! As I think others have said it gets a bit too hard to find other stars after finding the first one, I thought I was close a few different times for the second one but then the trail would fall short, and I wasn't sure if I was following the right sound.",
      "Super cool concept.  Definitely fun to nerd over the sounds with a fellow synth/mod friend!  As some have already mentioned, I could see how it would be tricky to hear the \"new\" parts.  Of the top of my head, though, I don't have any good suggestions.  Overally, very cool.  Great job!",
      "Great use of your modular system, was curious about what you would do with it and it fits perfectly to the game atmosphere. Very atmospheric, well polished and audio/visually pleasing.",
      "Very relaxing game to listen and play. I really enjoyed the art and color palette. It did get a bit hard to find the objects once all of the music started to layer, overall a great experience.",
      "I was able to find one and it's a really cool using the headphones to find it. The sounds are great and it's awesome that you made them yourself. I think having a counter to know how many to collect would be beneficial. Liking the art of the planets and stars, also I'm liking the feel of the movement",
      "Beautifully done, the music's got a nice peaceful mood that pairs with the visuals perfectly",
      "I enjoyed this one. The art was really nice and the music was great and super chill. My only issue was the the game play which was good but I felt was a bit to difficult. I may just be stupid but I found it really hard to locate the objects with sound so I kind of just wandered around the map aimlessly until I found the collectibles. but this was still a super relaxing game and I really like it.",
      "i think this game is beautiful and the music is really lovely. I could listen on loop for a long time <3",
      "This is a perfect execution of the prompt - I wish for many people to play and rate this! At first I thought that it was too hard to hear the new layers once there were already 3+, but now I think it helps with the feeling of the game. A brilliant submission."
    ],
    "comments_posted": 7,
    "created_at": "2023-02-14 22:57:48",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925915",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/da-dam",
      "member_since": "10 June 2020",
      "posts": "52",
      "topics": null,
      "followers": "5",
      "following": "2"
    }
  },
  "1877968": {
    "overal_rating": [
      "Score*",
      "3.569",
      "3.131",
      "2.755",
      "3.194",
      "2.755"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.800",
      "3.333",
      "2.933",
      "3.400",
      "2.933"
    ],
    "participant": "hermes3d",
    "game_title": "Scrap Planet",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 12,
    "comments_raw": [
      "The oxygen tank restriction would have made for a tense experience! Gorgeous audio that fits so perfectly and sets the vibe for the game. Love what you did here. I do think the scrap was too difficult to identify. I would suggest putting the first piece relatively close to the start point and maybe define them further visually with a glow or outline or anything really to help them standout and unify them. I do wish when I put it on the table it was visually there. Small nitpicks. Great work here.",
      "Nice improvements from round 1 for sure. Looks and sounds nice, good atmosphere. I found it very difficult to find the scrap though haha",
      "The beginning is SUCH a strong start. The cinematic fly overs took me OUT! I felt like the music, and sound effects are perfect for this game. For me it was a little hard to know what to do once I got started but it may have just been a me thing.",
      "The story had a strong start, nice setup intro without being too sluggish - and such a world setting! Nicely integrated audio - minor nitpick that the running sound was the same as walking, but thatâ\u0080\u0099s a subtle thing.",
      "Nice addition to your round 1 entry! Liked the music and added hints of story. The scrap was a bit difficult and tedious to collect, maybe an indicator or outline of some sort to help guide the player to where each scrap piece is?",
      "Excellent choice of music and sfx, the audio overall is very pleasant and atmospheric, it reminds me of similar commercial games that are set in space.Unrelated to this round, but the camera bobbing when walking was rather nauseating for me :\") and I might be dumb but I could not find any scrap haha, I think an example piece near the table would have helped me a lot.",
      "Cool to see your progress from Round 1, starting to fill out the world. Keen to see who we will meet next on this Trash Planet!",
      "The visuals on this still floor me.  Fantastic 3D work.  Character movement felt good, though the camera was a bit sensitive.  Took me a minute to figure out what I was supposed to be doing with the scraps, but once I did it fairly straight forward.  The ambient sounds and the music were a solid choice.  Nice work.",
      "Great to be back in space!The story was delivered through the cutscene and the dialogue, plus the scrap collection. SFX usage and music fit nicely as well. A solid submission! I was wondering if you had any other ideas on how to implement the theme that didn't make it in the final version.",
      "A great looking world and collecting the scraps was fun.",
      "The story and objective is awesome and love everything you've added to your game",
      "I managed to find all the scraps!"
    ],
    "comments_posted": 16,
    "created_at": "2023-02-13 17:45:41",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1877968",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/hermes3d",
      "member_since": "14 February 2021",
      "posts": "151",
      "topics": null,
      "followers": "15",
      "following": "42"
    }
  },
  "1920501": {
    "overal_rating": [
      "Score*",
      "3.941",
      "3.471",
      "4.059",
      "3.824",
      "3.706"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.941",
      "3.471",
      "4.059",
      "3.824",
      "3.706"
    ],
    "participant": "unburntstudios",
    "game_title": "Sometimes You Feel Sad",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 17,
    "comments_received": 12,
    "comments_raw": [
      "Loved it! I love a good adventure rhythm game. It was great how you incorporated it into the actual gameplay rather than making it its own level. I didnt do that and the way you've executed it makes it way more immersive!",
      "Loved it! I love a good adventure rhythm game. It was great how you incorporated it into the actual gameplay rather than making it its own level. I didnt do that and the way you've executed it makes it way more immersive!",
      "Love it. What more is there to say! Glad you could join on stream. What a wonderful game filled with heart and care. Excellent work.",
      "My wife has a thing for cute birds, so extra points from her. Such a sweet game with great music to go along with it. I had a bit of a hard time trying to figure out everything to do, but used your cheat notes on discord to reach the end. The open world part was nice, but just need some kind of hints if a  player gets stuck. Amazing entry.",
      "I like the music. It's quite good. And the story feels understandable, even if it's a bit vague at the start.",
      "",
      "Fantastic art style! The pixel filtering is almost too intense sometimes, but it's soooo close to being perfect. I was streaming this, and had to give up on reaching the snake, I could not get that jump working for me - but everything else was a great experience. Hope to see you in Round 3!",
      "I agree",
      "That was lovely and cute, very well done.",
      "Wow. Both of your submissions for this jam are absolutely brilliant! You are obviously very creative and your games show it in every way shape and form. Wonderful job!",
      "Felt a little confusing at first, but once I figured it out I honestly just fell in love with this game. I think you nailed it: other entries have a story that's explained out through audio, but yours is abstract, emotional, and open for interpretation and I absolutely love that. The final scene with the crow friend really tugged at my heartstrings.",
      "This was a great game! the style was really nice and kind of reminded me of A short hike, but I could barely  play due to insane lag. I don't know if my computer is just bad but even when I downloaded the downloadable version it was still laggy. But the music was nice and overall it was a nice little game"
    ],
    "comments_posted": 20,
    "created_at": "2023-02-10 23:02:04",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1920501",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/unburntstudios",
      "member_since": "27 February 2021",
      "posts": "223",
      "topics": null,
      "followers": "8",
      "following": "2"
    }
  },
  "1917091": {
    "overal_rating": [
      "Score*",
      "3.695",
      "3.306",
      "3.435",
      "3.565",
      "2.722"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.071",
      "3.643",
      "3.786",
      "3.929",
      "3.000"
    ],
    "participant": "puree-adventure",
    "game_title": "Space Walk",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 9,
    "comments_raw": [
      "Awesome stuff. Love your art style, can't wait to see what you make in the next rounds",
      "Really good use of sound!",
      "I love the art style, and I'd also love to see more levels! The way you incorporated audio was great!",
      "Neat little game! Would love to see more levels/see this built off of!",
      "Good job with the audio puzzles ... very interesting",
      "Love the art style! Feels like it was drawn by a child(that know the fundamentals of art and design somehow) really great stuff! The puzzles were fun to solve and feel accomplished too :)",
      "great game! nice audio puzzles",
      "The audio driven puzzles were fun and I loved the art. Everything fit well together.",
      "I love the way the audio is used to progress in the game. It's a really neat idea and really well made"
    ],
    "comments_posted": 0,
    "created_at": "2023-02-14 20:49:56",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1917091",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/puree-adventure",
      "member_since": "10 May 2021",
      "posts": "242",
      "topics": null,
      "followers": "127",
      "following": "37"
    }
  },
  "1903381": {
    "overal_rating": [
      "Score*",
      "3.577",
      "3.092",
      "3.517",
      "3.274",
      "2.971"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.688",
      "3.188",
      "3.625",
      "3.375",
      "3.063"
    ],
    "participant": "n3wtworldorder",
    "game_title": "StayTuned!",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 9,
    "comments_raw": [
      "Very nice fourth wall breaking, well done!",
      "Really charming and interesting little game, awesome work!",
      "This was very fun.",
      "Really interesting experience.  Got some good Stanley Parable/Beginner's Guide vibes.  I think the pace could have been quicker, though.  Something bizarre like this can feel slow at times.",
      "asmr gamedev experence",
      "Really interesting concept.  Love the playing with player psychology and breaking the 4th wall.  I was waiting for a jump scare most of the time.  Would like to see a little more gameplay.  Not much to do aside from moving and reacting to the instructions.  But overall, I like where this is going.  Looking forward to seeing it progress.  Nice job.",
      "Visually very well done. The narrative is interesting, but I wish it had a more defined start and end though. It doesn't feel like there was a conflict or resolution. Although I do think the voicing was pretty well done.",
      "Really cool intro! I loved the meta commentary and enjoyed the aesthetic and narration. Great work!",
      "I missed the start of the narration because I had my  sound off- only because you nailed the horror aesthetics so strongly at the start! The rest of it was a nice exploration that didn't outstay it's welcome. Great work on this Round 2!"
    ],
    "comments_posted": 4,
    "created_at": "2023-02-14 23:11:14",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1903381",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/n3wtworldorder",
      "member_since": "08 December 2020",
      "posts": "22",
      "topics": null,
      "followers": "4",
      "following": "2"
    }
  },
  "1925624": {
    "overal_rating": [
      "Score*",
      "3.455",
      "3.682",
      "3.773",
      "3.500",
      "3.364"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.455",
      "3.682",
      "3.773",
      "3.500",
      "3.364"
    ],
    "participant": "ghostbitstudios",
    "game_title": "Sweetland",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 15,
    "comments_raw": [
      "i am scared of the dark forest",
      "I really enjoyed the new gameplay you added, and the story as well! I can't wait to see what happens next. Your choice of music and SFX is nice, really adds to the overall atmosphere of the game, especially in the dark forest area. The AI voiceovers also sound fairly realistic too, which is great!",
      "Glad you joined the stream for this one. Had a great time with it. I like the idea behind the battle system and think you're onto something special with it, just need to work out some small kinks. The main thing is just more clearly communicating through the UI what's going on, what I'm queuing up and what it'll do. That would help a lot. Would be cool to be able to shoot enemy projectiles too. Overall, great entry.",
      "nice additions from last round! The sudden switch in tone really surprised me but i did not understand why you could not just keep drawing cards and then using them immediately in the battle segments? but other than that great entry!",
      "Great story telling, I like how the tone of the game changes when it goes dark and the audio is great throughout. I also like the card fighting mechanism a lot, but I think the health could do with healing a little more. The timing of the shield was good fun and I like the attacks and how it can be built up. I think it would be cool if your bullets could destroy or deflect some of the enemy attacks. I like how the cherry ducks down and would love to see an enemy in a future battle that can move around on the screen and more enemies at once but I'm sure you got this planned already. Once the things you mentioned in the description page like the voice overlap and card problem gets fixed, it'll be really good. I noticed some bugs you may or may not be aware of. If just the health card is on the screen, you can press space to draw the cards causing the health card to overlap. I somehow got the shield to stay on the main none battle screen and could then become invincible in battles, not sure what I did though. Bugs aside and can be expected in everyone's jam games, I think you've got a truly great game here and can't wait to see what will happen in sweetville",
      "One thing I noticed with the voice overs was that if you pressed z to skip the sound kept going, so you could easily  get a jumbled mess of everyone talking at once.  Overall good game!",
      "Loved seeing the direction you took this from round 1, I think the card system could use some fine-tuning cause it felt a little clunky, but seeing as this was an audio round it's all good. Really liked the twist at the end too, wondering where that may lead.",
      "Excellent work! Those voiceovers are good, especially the right-hand  card servant one. I really like the card system. I think it would be  better instead of aiming with the mouse, it aims and fires  automatically, but every shot has a chance to miss. Very good and  enjoyable game overall. Looking forward to the final release.",
      "This was the game that I was most looking forward to trying for this current round (big fan of card games).",
      "The VO work is amazing and the story is great.  Took me a while to get used to the battle mechanics but it was easy after a short time. The card drawing aspect of the battle system was interesting, I want to see how this game develops.",
      "Seriously.  Terrifyingly cute.  And I still love it.",
      "Pretty good! got a bit confusing at times but overall was fundid encounter a bug where a buncha different voicelines played overlapping every time a character spoke, my ears hurt lol",
      "This was a pretty cool game! I liked the art and the combat system while taking a while to get used too was pretty fun when I got the hang of it although I did find it too easy to just spam drawing cards, collect a bunch of bullets and shield and just destroy my enemies.  I also like the story.",
      "Wow lol!You got Vegeta to do the voiceovers? Sick casting! Well done to everyone involved!(I was looking for links or references as to who they are, well done for the passion and commitment!)",
      "Great showing! Rival, I really like the combat system you've added, could be polished up a bit more, and the aiming feels quite useless, however it's a great idea! I think the biggest issue is the fact that you can just activate cards and instantly draw a new hand, there's no timers on anything."
    ],
    "comments_posted": 11,
    "created_at": "2023-02-14 06:41:30",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925624",
    "coolness": 30,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ghostbitstudios",
      "member_since": "30 June 2019",
      "posts": "721",
      "topics": "13",
      "followers": "43",
      "following": "48"
    }
  },
  "1926401": {
    "overal_rating": [
      "Score*",
      "3.071",
      "2.340",
      "2.633",
      "2.706",
      "2.413"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.818",
      "2.909",
      "3.273",
      "3.364",
      "3.000"
    ],
    "participant": "r3games",
    "game_title": "TERRA-4",
    "platforms": [
      "web"
    ],
    "rating_count": 11,
    "comments_received": 7,
    "comments_raw": [
      "It was dark and scary. Quite an entry. Although I feel like the audio is a bit too loud and there's something off about the audio when it was mentioning the log from the blue orb. It's like the audio is forced to be either on the left or right, but never between the two. Still, good entry,",
      "Spooky, well done crafting the atmosphere with the audio. I wish the footfall sfx wouldnâ\u0080\u0099t harsh-stop when you stopped moving, but thatâ\u0080\u0099s a detail. Definitely a solid entry in terms of delivering a feeling driven by sound.",
      "The atmosphere was great and the sounds helped that out.",
      "Nice atmosphere and sound effects, dialogue could have been a little bit clearer around the hexagon as it seemed to be a lot quieter for me.",
      "For being somewhat minimal, the art is awesome.  Not much in terms of gameplay.  Would like to have seen more there.  But the story you have is really interesting.  Would love to see where this would go.  Nice work.",
      "pretty short and sweet, love the aesthetic.",
      "I am in love with the art style of this - there's a lot of character that you pull out of not many pixels! I wish the game could be a little longer, but I think you do a good job with what you have here."
    ],
    "comments_posted": 0,
    "created_at": "2023-02-14 20:09:18",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926401",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/r3games",
      "member_since": "29 April 2020",
      "posts": "72",
      "topics": "1",
      "followers": "9",
      "following": "2"
    }
  },
  "1922092": {
    "overal_rating": [
      "Score*",
      "4.097",
      "4.097",
      "4.129",
      "3.581",
      "4.097"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.097",
      "4.097",
      "4.129",
      "3.581",
      "4.097"
    ],
    "participant": "spacespy",
    "game_title": "The Cave Of Sound",
    "platforms": [
      "web"
    ],
    "rating_count": 31,
    "comments_received": 23,
    "comments_raw": [
      "Very well done. I loved the playing mechanics with the platforming.",
      "Excellent art and sound design, I especially love how well polished the playing of the chords feel and the ripple looks great. Caught the little wordplay with the sequences at the end as well. Here's wishing your grandad a speedy recovery ð\u009f\u0099\u008f",
      "Beautifully heart felt, amazing pixel art and nice story with rockin' guitar riffs!",
      "Amazing work Spacespy!The game felt 100% complete and polished, great visual and sound effects, everything clearly communicated and working cleanly!Nice touch with the poem and the personal touches, linking great with the words you also had to form, as well as with the over all gameplay, being nice and carefree at the start, to more complicated as the melancholy increased. First time I heard the poem, very interesting choice with the rock and roll and the whole musical theme of the game. I would love to hear about your process creating this. Congratulations! (I almost forgive you for not making more of meatland! XD)",
      "This is so beautiful, honestly I have no words, this was absolutely incredible, and the story is really moving, I wish you and your grandad all the best!",
      "I like the idea of forming words with chords, it also served the gameplay well by making them easier to remember. And the player movement was very satisfying, it made me wish there was more platforming involved!",
      "Really beautiful game and story behind it! I'm sorry to hear about your granddad, I hope he gets better soon.",
      "I am a guitar player. Its was fun to play this game. Like it!!!",
      "Excellent work tying the mechanics to the story perfectly! Great game!",
      "Beautiful! The limited palette, the story, the sound. All of it is wonderfully polished and a treat to experience. Amazing work!",
      "Ok this is genius. At first I thought that maybe the chords were a bit too joyful for the story, but when I figured the patterns actually form words serving the story... Very, very well done.",
      "Amazing game! I can really tell you put a lot of effort into this. The story is very interesting, the audio works very well with it and the pixel art is amazing. Great job!",
      "simply amazing lol",
      "Love how you can make simple pixel art look amazing. Great color palette and audio.",
      "Wonderful idea, great execution!",
      "Beautiful idea and execution Spacespy. Very poetic. You did a great job telling the story and the last notes combinations were a clever way to end the game.",
      "I like the poetry for the story telling and the special effects and sound are awesome. The animated environment is nice too, especially how it creates the paths. When I first played I was pressing 1 and 2  together with thinking of keyboard chords but having the letters come out individually as they are pressed helped with that problem and I soon got to the end. Really nice game and also hope your grandad feels better soon",
      "It's been so fun watching the development on this one.  And I gotta say, you really knocked it out of the park.  The tie in with your grandpa was very personal.  My one complaint was with using 1-4 as the chords.  Felt a little off.  Though I'm not really sure how I would recommend an alternative...  All around, amazing job!",
      "This was such an incredible game. The sound is perfect and I love the sounds the puzzles make while you solve them, It feels like your making your own song. and the way the story tied in was really nice, it was cool to see the progress of this through discord and it did not disappoint!",
      "this is so good! the sound effects were super satisfying, only complaint is the text was hard to read at times",
      "Really lovely game space! it was super creative to have playing chords to solve puzzles, and the poem was very well written :)",
      "really polished and atmospheric! great job!",
      "Excellent execution from concept, to level design, to art direction and story flow. A beautiful tribute to your Granddad, Spacespy.Update to my comment, because I do want to leave some feedback you can work with. If I remember correctly, I think you could touch up your poem voiceover. You don't need a crazy recording setup, just make sure you're in a well-padded place (closets are great), and record your lines in there. Use your DAW of choice, or even Premiere has audio editing, and I think with a small noise pass and a slight de-ess, your audio would be even cleaner. Again though, excellent work."
    ],
    "comments_posted": 23,
    "created_at": "2023-02-12 00:37:51",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1922092",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spacespy",
      "member_since": "06 June 2020",
      "posts": "477",
      "topics": "7",
      "followers": "127",
      "following": "140"
    }
  },
  "1907573": {
    "overal_rating": [
      "Score*",
      "3.750",
      "4.083",
      "4.000",
      "4.083",
      "3.500"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.750",
      "4.083",
      "4.000",
      "4.083",
      "3.500"
    ],
    "participant": "dev-pirates",
    "game_title": "The Knocking",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 19,
    "comments_raw": [
      "Great to see you using Godot! Amazing first project WOW! You had checkpoints, parallax backgrounds, collectibles, multiple endings, very very impressive!",
      "loved it! got the best ending after getting every pendant  and almost rage quit the game because i accidentally pressed the quit option when i was near the end but i just played it again ._. but great game with a good story and fun platforming!",
      "An awesome entry thatâ\u0080\u0099s even more impressive because you made it an all new engine for you! Played on stream and left feedback throughout. Had a blast with it. This game is right up my alley. Well done.",
      "I am so glad you spend time polishing the controls! i thank you so much, cause when i failed it was my own doing and not bad controls, i was able to beat it, the \" I got to know where that sound is coming from\" drove me to complete this! I ended with the good ending, fantastic job, oh and also WELCOME TO THE GODOT TEAM!",
      "The controls felt great to use, and I love how the story gradually revealed itself, and the different endings possible.  Love this game!",
      "Very cool and fun platformer! The completionist in me kicked in and I got all 25 pendants, I would've had to start all over again if I ended up missing one.",
      "Good stuff, the knocking was a good hook for the story and the game played pretty smooth! It would be cool to have some subtle footstep/jumping noises and there were a few Leap of faith moments where you couldn't see where you were jumping, but overall I enjoyed it! Satisfying pickup noises and the music kept the tension up too",
      "The story was very engaging and well delivered, the platformer controls were great as well. Even though both elements were great individually, I feel that the action packed platforming took away from the mystery of the story, and a slow puzzle platformer would have accompanied it much better. An excellent submission nonetheless.",
      "Challenging platforming with great controls. I liked it a lot!",
      "The controls in the game feel great. Also great job of including multiple ending.",
      "Felt really good to control.  Nice to see a story in a platformer.  Don't always have that.  Nice job.",
      "Really great submission! Controls feel nice and the story is well paced and engaging. Played through and got all three endings and really enjoyed doing it all three times! Great work!",
      "Haunting with the pipe banging. I really liked the movement and jumping, felt satisfying to get past obstacles :)",
      "25/25! The platforming of falling and then mid-air jumping to go under an obstacle is so satisfying. The difficulty curve is also fair and balanced. Great job all around. Knock..... knock knock....",
      "i got 23/25 of the coins and there still was a hint that tells \"there is better ending\" so I wonder how many endings are there hehe",
      "I really liked it, and it felt really good for doing this while learning how to use Godot!!",
      "Good feedback, thank you for playing.",
      "Controlling the player really felt great and I appreciate the controller support. I really like the hints at the story and what the knocking may be.",
      "Really enjoyed playing your game, the sounds and story is really well done and certainly builds up a lot of intrigue and has fantastic endings"
    ],
    "comments_posted": 39,
    "created_at": "2023-02-13 06:58:43",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1907573",
    "coolness": 52,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "540",
      "topics": "1",
      "followers": "11",
      "following": "12"
    }
  },
  "1907795": {
    "overal_rating": [
      "Score*",
      "3.389",
      "3.556",
      "3.167",
      "3.056",
      "2.389"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.389",
      "3.556",
      "3.167",
      "3.056",
      "2.389"
    ],
    "participant": "reillystudios",
    "game_title": "The Lost Orb",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 10,
    "comments_raw": [
      "It's crazy how just giving an orb a name gives it personality. I'm not sure if the friend names are also randomized, but when I saw Keith I was excited because my father-in-law is named Keith. In my head I was like, \"Come on, Keith. Join the team!\" Super impressive how early you finished and that you also have it working on mobile. Excellent work. One small issue I had was when I left a room my orb friends wouldn't follow with. Their names were still being sung, but they didn't cross into the room with me. I went back because I couldn't leave my friends behind! Great work.",
      "The game felt so magical with the relaxing music. Beautiful game!",
      "Beautiful concept and execution! Despite the randomness factor, it still feels genuine, which is hard to achieve with random level generation.",
      "still impressed how fast you made this game, overall the game is pretty great! though some of the sounds are a bit too high pitched and as others have pointed out not much of an actual story",
      "Very neat. Would be nice if numbers also generated a tone. Cool concept though.",
      "Nice idea, the SFX work very well but there isnt much of a story here. Overall, good job.",
      "Great concept and the music worked pretty well when the orbs joined up together.",
      "Interesting concept.  Love the idea of using the name to generate the tones.  Would liked to have seen the pitches match the key of the backing track, but that's probably just the musician in me talking.  I also love the little tails on the orbs.  It's a small thing, but surprisingly satisfying to watch.  Great job all around!",
      "It's a cool idea, not much of a \"story\" going on however making a song out of names is super unique and I dig it.",
      "Nice concept"
    ],
    "comments_posted": 0,
    "created_at": "2023-02-04 12:08:21",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1907795",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/reillystudios",
      "member_since": "30 May 2021",
      "posts": "29",
      "topics": null,
      "followers": "14",
      "following": null
    }
  },
  "1867862": {
    "overal_rating": [
      "Score*",
      "3.955",
      "3.182",
      "3.500",
      "3.455",
      "3.000"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.955",
      "3.182",
      "3.500",
      "3.455",
      "3.000"
    ],
    "participant": "malek-elsady",
    "game_title": "The mouse, The cheese, And the disembodied arm",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 19,
    "comments_raw": [
      "Controls were a little confusing for me but I love the atmosphere that you've created. All of the little sfx in the background layered on top of eachother to make you feel like youre in this small scary space is pretty cool!",
      "I remember i hated the controls in the last round, it takes quiet awhile to get use to, and no player health or UI indicating what my health is. and well everything else has been said previous already, by others. i sadly could not beat the snake boss. controls were frustrating as it was, and moving that quickly away from the boss was hard.  weirdly the controls grew on me after awhile. otherwise good job!",
      "Like others have said, the controls are the biggest hurdle, but I enjoy the challenge around learning them. (Reminds me of QWOP.) Great use of audio to push the story forward and a wonderful extension of your first round entry. Great work!",
      "Difficult at fist  to grasp the controls, but after that it was awesome and fun!",
      "I will beat that third boss! Sorry I had to stop partway through on stream, but glad you could join in. Really impressive how much you added this round. Well done.",
      "Imagine trying to hire more guards when they just invested in the big cheese shipment, the stuff Jason has to deal with smh.Fun \"rage game\" style mechanic I think. The controls are intuitive enough and suite the gameplay, it's definitely tricky though. Funny too.",
      "It took me a while to embrace the controls hah, but once I embraced them it was fun to play. Creativity at a high level.",
      "Really felt the audio felt just right for most of it.  It did almost feel out of place when there was a voice recording, though.  Almost felt like the text/beeps used in other places fit better?  Really cool game, though.",
      "Fun game and still nice creative idea carrying over from round 1!",
      "This is some really next level creativity",
      "the mouse is controlled with mouse controls haha, fun game.",
      "",
      "Beautiful game. I'm glad you added the trackpad support, though having it be WASD as well would be nice. The snake boss was fun and brutal. Sadly my game froze when I tried to move to the 3rd floor so I didn't get to beat the other boss :(The save points are cool but I wish there was some indication like a pop up or sound effect that let me know I saved my point, just for confirmation.",
      "This was a really great game! the new additions were super cool and I like the new audio logs. Jason is the best character in video game history. I also really enjoyed the gameplay and the snake boss was super cool.",
      "My desire for a game where you brutally murder people as a mouse has been fulfilled",
      "Excellent game, I like the idea, the story and art work very well together. It was hard to tell when the enemies would die but apart from that the gameplay was pretty good too. I didn't finish the game because the snake battle was pretty hard, and I didn't know when it would end. Overall, great job.",
      "Brilliant game, top marks from me, love what you've added to your previous round. The story clips are great, it feels good killing the guards and the snake boss is awesome. I wasn't able to kill the snake but it is such a cool battle and I get about 10 or so shots before I die, don't know if I am close to finishing it? I'd suggest having a health bar for the boss and feedback for each shot landed and maybe head shots do more damage. Also I think the bouncing knives would be better if they didn't bounce as it's already very challenging and maybe snake venom might be a bit better. Anyways sorry for my ramble, I think the game is totally awesome!",
      "The moral of the story is \"Let Jason eat his food! No more guards!\"\r\nDon't  want to spoil anything, but on that really cool boss fight on floor 1,  was thoroughly enjoyable! Pushing the mechanics in a primal situation. \r\nThe  foreshadowing was greatly appreciated as well, nice use of the audio  logs, not only as collectibles but lore-wise as well. Please give my  best to all the people involved in the voice overs! Amazing job, brought  a smile to my face.",
      "Not bad! The contrast between the dark world and the goofy story was a bit jarring,  but the new levels feel very appreciated."
    ],
    "comments_posted": 21,
    "created_at": "2023-02-14 23:52:56",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1867862",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,031",
      "topics": "14",
      "followers": "44",
      "following": "50"
    }
  },
  "1910715": {
    "overal_rating": [
      "Score*",
      "3.652",
      "3.739",
      "3.826",
      "3.522",
      "3.609"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.652",
      "3.739",
      "3.826",
      "3.522",
      "3.609"
    ],
    "participant": "midorimonki",
    "game_title": "The sound of grief",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 14,
    "comments_raw": [
      "Great audio and story. Music is simple, but it hits perfectly well. I like the walking sound effect and the talking audio as well. Good job.",
      "very interesting story you chose to cover! Not often you see this in games, where things are simplified for quick and easy to digest messages. This struggle was sweet to experience, and the surrounding environment, the lighting and the weather changes show your levels of cinematography and story telling.Great work! PS: loved the monkis!",
      "The story was so sad, but so beautiful. I had a bit of trouble finding the second note but apart from that no complaints at all this is literally incredible. Good job :)",
      "Heartbreaking story, but loved it nonetheless. Another excellent entry! I still really like your 2D characters in a 3D space style.",
      "Bobabobo. Bubabhabo.That was me saying this was another excellent entry. Great work, Midori!",
      "is very good, i enjoy the rei and the fball. very deep metafor with the 5 sages of brief. iunderstandfball when he bok hismusicbut then we go on a gourney and help him find his love for it agian. very nice <3",
      "I really like that you created a full story arc through the game, it felt like a complete end to end experience. Also some really neat visual effects in there like the snow shader. Nice entry!",
      "Your art style is just awesome, Midori.  The story and metaphor are on point.  Took me a bit to find the 2nd note.  I kept looking down in the snow that was disappearing beneath me.  Maybe a little context clue?  But that aside, it's a fantastic entry.  Very well done.",
      "Loved playing a little ditty at the end with the backing track lol. F-Ball is cute, love their art direction also :)",
      "Amazing. The art, sound and gameplay are all great. Good job!!",
      "simply amazing! i have like zero complaints lol",
      "Damn, it's great. The visuals, the characters, this mechanics that I love from Zelda OOT (and the sprite of the Ocarina ahah), I really enjoyed it. I also love the sound design you've put here. Very well done !",
      "Fantastic game. Love the interaction with the characters and how the snow melts when searching for the ocarina. Playing the instrument was a lot of fun and works really well with the game",
      "Really beautiful little game, I love the character designs. Glad to see I'm not the only one to make a game where you play notes :)"
    ],
    "comments_posted": 2,
    "created_at": "2023-02-14 19:58:30",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1910715",
    "coolness": 51,
    "participant_info": {
      "profile_url": "https://itch.io/profile/midorimonki",
      "member_since": "02 December 2020",
      "posts": "88",
      "topics": null,
      "followers": "18",
      "following": "5"
    }
  },
  "1925700": {
    "overal_rating": [
      "Score*",
      "3.519",
      "3.926",
      "3.926",
      "3.741",
      "3.519"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.519",
      "3.926",
      "3.926",
      "3.741",
      "3.519"
    ],
    "participant": "lio-lim",
    "game_title": "Unity",
    "platforms": [
      "web"
    ],
    "rating_count": 27,
    "comments_received": 16,
    "comments_raw": [
      "Gorgeous.",
      "great game story and visuals! but i never managed to get past the third level :(",
      "Loved the story and how you controlled both stories at the same time!",
      "Played on stream this morning and love the new twist and way you tied the story into the updated gameplay. Left a lot of feedback if you want to watch it.My dog was asking to head out, otherwise I think I would have kept going on stream to finish it. I feel like I was so close! Will definitely revisit.",
      "Love this so much, especially the duality of the story, and how it eventually becomes united. 5 stars across the board this is just so great! :)",
      "Very beautiful game with a compelling story.",
      "The visuals, sounds and music fit perfectly together. Great job :)",
      "Really nice visuals and the sound works with it perfectly. It was definitely slow at times but apart from that, fantastic work.",
      "Overall it's a fun game, only on that first \"level\" my head was going crazy because of the reflections. And yes it's a cool sound design, talking, that music in the background. I admire the idea.",
      "Really beautiful game, the art's superb even if you didn't make it yourself, and the edition of the audio makes it a whole lot better.",
      "Once again beautiful visuals, now paired was equally gorgeous sounds and music. Really excellent submission!",
      "This should definetly qualify in the next round",
      "This was really great! the art and effects were spectacular. My only issue was the section where you control both players was a bit too difficult and I wasn't able to complete it. but the story I saw was really nice and overall it was a fun experience.",
      "Great story and narration! Really nice to see how you built up your round one entry! The visuals and audio are both superb. Great work!",
      "Really beautiful game. Love the story telling and the gameplay is excellent. Like the challenge of controlling two characters at once. I wasn't able to make it to the end but definitely want to come back and give it another go",
      "The effects here are mind-blowing. Keep up the good work!"
    ],
    "comments_posted": 10,
    "created_at": "2023-02-14 21:50:39",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1925700",
    "coolness": 11,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "342",
      "following": "28"
    }
  },
  "1926668": {
    "overal_rating": [
      "Score*",
      "4.250",
      "3.750",
      "3.750",
      "3.563",
      "2.875"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.250",
      "3.750",
      "3.750",
      "3.563",
      "2.875"
    ],
    "participant": "spoonsweet",
    "game_title": "mmmissing signal",
    "platforms": [
      "web"
    ],
    "rating_count": 32,
    "comments_received": 24,
    "comments_raw": [
      "Loved the short intro sequence! Really clever use of audio and an adorable ending. Like other commenters have pointed out, the wall bump sound was just a bit too loud, other than that, great work!",
      "Nice work, and as beautiful as ever. I think it was a good use of the theme to derive movement based on the material sound you walk over. I also had difficulty getting anywhere, made worse by the switch lights going out after a little while :o and didnâ\u0080\u0099t get as much of astoryper se (I didnâ\u0080\u0099t get far past stumbling in the dark, so that may be part of it), but still all around great work. Appreciated the subtly of the missing flyer in the wind at the start.",
      "Great looking game. Listening to the footsteps was a bit tricky and I enjoyed it. Great game!",
      "great art! sounds were nice and informative even without knowing what i should be walking on. It felt a little short, as I  managed to walk directly to the end without triggering any lights on the way, then played it through a few more times to see if i missed anything.",
      "Played on stream this morning with feedback throughout. Love the thoughtfulness you put into the level design. Very clever choices and I was happy to revisit this world. Great work as always, Spoonsweet.",
      "Great stuff, the bump noise was a bit jarring but overall a nice game!",
      "Very nice and clever idea! I didn't realize at first that I could walk on the liquid areas, I thought it would result in a loss so I was avoiding it for a while but eventually figured it out. Also loved the art style as I'm sure you're used to hearing!",
      "So glad to see this continued from R1.  And still hoping to see more.  Your animations are just awesome.  Could hear the sounds from the floor, but had a little trouble identifying which way to go from just the sound.  Still got through it pretty easy though.  Really can't wait to see what you do with this in the future.  Great work.",
      "I really enjoyed this one, felt like a continuation of the first entry.   Did you build off the previous one? 3D audio was very groovy and nice.  As always amazing art.",
      "I really love the art of this game! I love the gameplay too!",
      "Wow, amazing art. The games starts off in a nice way too, and using the audio cues to find my way was very fun. It would be nice if the lights stayed on or lasted longer though. but apart from that, great job. With a little more time this could be a full game :)",
      "That game is so nice. The art work is so mindBlowing. Im a bit sad that the theme got you hiding the beauty of this game. But i think this is a game that deserve to be finished and shiped.",
      "loved it, loved how i kept getting lost and had to rely on the sounds of my feet to try and go in the right direction!",
      "I like the way the game starts with the player being able to hear the music and sounds of bumping into the walls and then seeing the poster fly away to reveal the warning behind. I think it would be better if the lights stayed permanently on and if there were perhaps a few more. I think going into the darkness was fun and the different audio cues you used worked well to drive the story of finding the missing animal",
      "Mr. Spoonsweet, I'd rather say my honest opinion than praise (so that you give me a high rating lol).",
      "Great use of audio to help guide the player through the level. I think I missed some of the switches that lights up the room, maybe they could be a little bigger. Overall great entry and artwork.",
      "nice game! liked the use of audio and again, gorgeous visuals!",
      "This game looks gorgeous! Really nice use of audio too. It was already one of my favourtes on round 1 and even more impressive now. Good job!",
      "Super cool concept. As usual the art was fantastic and I loved the feeling of blindly walking in the dark and having to listen to tell where you where. I also liked the ending",
      "Really Innovative system! I really enjoyed the aspect of the different sounds telling you how off course you were...",
      "This was soooooo good! Iâ\u0080\u0099ve been looking blessed with the art since day 1 and youâ\u0080\u0099ve made it even more cinematic/immersive! Great job!",
      "Really interesting game-play concept with the footsteps, I think it works well with the theme and I was able to finish it without getting frustrated so I think it was a good size/length. The art is also gorgeous. I also really like the intro scene with the particles and snow/wind blowing. Cool entry!",
      "Loved this, and listening to the sound your footstep makes on each material was really fun gameplay!",
      "Wow the art in this one is amazing! Well done spoonsweet! I managed to find the pet :D"
    ],
    "comments_posted": 20,
    "created_at": "2023-02-14 23:47:09",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1926668",
    "coolness": 26,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "894",
      "topics": "3",
      "followers": "152",
      "following": "66"
    }
  },
  "1923165": {
    "overal_rating": [
      "Score*",
      "3.929",
      "3.679",
      "3.821",
      "3.179",
      "3.357"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.929",
      "3.679",
      "3.821",
      "3.179",
      "3.357"
    ],
    "participant": "gamefavorites",
    "game_title": "one-eyed Pete (Level 1 & 2)",
    "platforms": [
      "web"
    ],
    "rating_count": 28,
    "comments_received": 22,
    "comments_raw": [
      "great game! i tried getting all the coins but i could not manage because some were really hard to get lol",
      "I like the addition of the voices, and the extra sounds were good too. I didn't expect the story to go in the direction it did, especially at the end. The end credits were a nice touch too.",
      "this is a great example of using the theme to your advantage, and Improving your game! fantastic job! this is definitely getting you in a higher spot! its safe to say you will make it to the next round, everyone clearly liked it, and so did I",
      "It's cool that there's a storyline. Well, and that convenience with the auto grab, helps quite a bit.",
      "The voice acting ð\u009f\u0098­ Loved this sequel to Pirates of the Caribbean.Unrelated but the controls also feel much better compared to the first round, great job!",
      "The music was really fitting, and I feel like the voice acting was quite well done!  Also your environments are super well put together.",
      "I still love the idea :)",
      "Made it to the end! Good game",
      "I wanted to check out your game because you played mine! It was pretty hard for me but i really like the little bit that I saw. The music and the visuals go well together!",
      "I remember playing this in round 1 and struggling with the rope grabbing mechanic, but the addition of the auto-grab feature is a really nice QoL touch and brings it together very well! Also really liked the new cannonball double jump mechanic.",
      "Great fun game with a lot of character, awesome stuff!",
      "So fun. Very cool new stuff. And as others already mentioned, auto-grab is really appreciated. Good job!",
      "I very much enjoy seeing you continue building on your first round entry! Nice cutscenes and the cannonball mechanic is a clever one. Bonking that last guy was a treat. Well done!",
      "I really appreciate the auto-grab feature. I did not make it through your first round because I was having problems without it. The music feels really good when the action gets going.",
      "The music and the cutscenes are awesome! The auto grab feature balanced the difficulty significantly. I liked it a lot!!",
      "I think you really built on your round 1 entry a lot. Auto grab came in clutch as I had a lot of problems with the previous version and I really enjoyed the canon ball mechanic as well, it was fun to use. Sound design was well done I think as well, I think the cut scenes book-ended the whole experience nicely. Nice work!",
      "Really fun idea and a great game!",
      "Pretty good! I liked the art and I really enjoyed the double jump cannon ball in level 2. my only issue was that sometimes jumping off climbing stuff like that sunken pole in level two was kind of tricky but the auto grab helped a lot",
      "Really good stuff! I love the mechanics introduced in the 2nd level!",
      "I liked this game in round 1, it has greatly improved this time around. The story is great and the auto grab helped me a lot.",
      "Had a great time with this on stream and left feedback throughout if you havenâ\u0080\u0099t caught it yet. Love how you expanded on this. I like inclusion of the auto grab, but I think you tweaked the grab so weâ\u0080\u0099ll that I didnâ\u0080\u0099t need it anymore. Great work!",
      "thank you for sharing the video of the gameplay, it was a bit hard to reach all the places.Awesome work on the audio and the story!I am always amazed by your unique level design (Dungeon King, Egg baguette etc form last year) and here it shines as well!"
    ],
    "comments_posted": 33,
    "created_at": "2023-02-12 18:54:23",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1923165",
    "coolness": 34,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "786",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "1875614": {
    "overal_rating": [
      "Score*",
      "3.250",
      "3.450",
      "3.450",
      "3.500",
      "3.000"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.250",
      "3.450",
      "3.450",
      "3.500",
      "3.000"
    ],
    "participant": "just-a-mooshroom",
    "game_title": "trAPPed - GDKO 2023 Rounds 1/2",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 16,
    "comments_raw": [
      "So happy you stayed in the game and submitted! I had a blast! Love the extra adds!",
      "Great to see all the extra effects on this! Really added to the whole experience!You had a strong story driven game, so well done on compounding with this version!",
      "I miss this in the last round! so I'm coming in fresh! it took me awhile to solve unfortunately, but when i did it felt great! good job",
      "Yeah same, I should definitely add a few more, it was a bit of an oversight on my part, some of the puzzles are very difficult, so I will definitely add more if i get to the next round :)",
      "Glad to revisit this game, and on stream so you can see Iâ\u0080\u0099m not a total idiot when I have the right keyboard! Ha. Loved the updates and left feedback during my play through. Great work.",
      "nice game! i loved all the notes but i never managed to escape lol",
      "Awesome update! Keep going with great games!",
      "Great game, following the clues was fun, the audio additions were great improvements to round 1.",
      "I'm so sad you didn't add music for theimportant tutorial:(",
      "Very nice added audio, sounds and music! I like the setup you have going: following along with the notes as they lead to the next, but would love to see another layer added to the puzzle.",
      "After failing to escape in round 1 I was determined make it out this time. Grabbed a pen, a notepad started to follow the clues. After spending way too long analyzing each note very carefully, I typed in the password and escaped on my first try. I actually got really excited that I escaped.",
      "Really cool idea.  Love seeing unique stuff like this!",
      "Cool concept, hopping around the different notes, digging deeper and deeper! A quality polish you could do is maybe fade the volume of the different note audios to a lower level after a few seconds, some are quite intense to keep listening to while reading the notes. I like that you could come across the notes with hidden meanings in any order, it's only when you follow them the right way that you can be sure you've solved it :)",
      "Great game! Very fun and interesting!",
      "good improvement from round 1!",
      "Not bad! All the little notes are relatable af! And cute! Wish there was a bit more going on however this is a job well done."
    ],
    "comments_posted": 18,
    "created_at": "2023-02-14 19:15:40",
    "game_url": "https://itch.io/jam/gdko-2023-round-2/rate/1875614",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/just-a-mooshroom",
      "member_since": "31 August 2022",
      "posts": "165",
      "topics": null,
      "followers": "7",
      "following": "20"
    }
  }
}