{
  "3315648": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "mess3",
    "game_title": "10 Robots",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 21,
    "comments_raw": [
      "Delightful puzzles. I got all the way to the end! Didn't expect the twist, cool story beat. I honestly don't know if I have any critique. The puzzles were quick to restart if something went wrong and I feel all the criteria were well incorporated. Great job ð\u009f\u0098\u0081",
      "I really liked it! I dont know why but I kept pressing R to rotate and reset the level (prob me and my stupid brain but felt wort mentioning it). the levels are very clever and greatly designed ao great job on that! I do feel like the dog was more in the way of things then ussefull in the first levels and whilst I get that that also is a design option for levels I would switch them up a bit so that sometimes you gotta lead to robot and sometimes you got to make sure eddison doesnt die.Other then that great implementation of the criteria and awesome job!!",
      "Superb, one of the entries that humble me when I see how well some people can fulfill the round's criteria. I can't see level's number but I'm probably near the end and it is quite enjoyable experience.",
      "This is one of my favorites from the round!  The voice acting and story snippets were great, and the puzzle mechanics were super solid.  Full five stars from me!",
      "Amazing Work! All the mechanics are really intuitive, yet can be really unique. I beat the last level without ever touching a button, like the VA didn't even finish there sentence before the robot walked into a laser, but the previous 9 levels made up for 110% of any finale. Great work!",
      "",
      "Amazing work. Nice voice acting! The art style was simple but readable and pleasant to look at, perfect for a puzzle game in my opinion. I loved how you could adjust all the elements of the map AND move the dog around.",
      "Very cool puzzle game! Had a great time playing it!",
      "I really like the mechanics, it's the classic \"laser + mirror\" deal but you've added so many twists to it that it feels completely fresh, and very engaging to play! I especially liked that the projectiles had limited range + having the range extender. The story was solid and the last level was very clever with revealing who the narrator was. 5 stars across the board.",
      "Great game with amazing storytelling! The puzzle part is quite solid, and the art style is really pleasing. I really like the reveal of the narrator's identity and how you made the last stage. Probably one of my favorite stories from this round.",
      "Very solid entry. Puzzle designs were great and it all came together nicely with narrative elements, visuals and sound design. Good job!",
      "I like how the story is told every level, it added a lot of flavor to the gameplay. The puzzles were nicely designed and I enjoyed solving them, but I did not find them to be that challenging. Overall a very nicely done and enjoyable game, good job! :D",
      "That was just fabulous! Great job! I really have nothing to add. :)",
      "the game looks and plays coolthe only thing that it lacks is the animal chracter becose the player character doesnt count",
      "9/10. You lost a point by making me cry at the end. Great story.",
      "I loved the story and the mechanics. The puzzles were fun and challenging. Fantastic game!",
      "Very satisfying",
      "",
      "I managed to get to the eighth robot and would love to know what the solution is and what the other levels after are like. Having voice to tell the story was really good and I liked the puzzle designs very much. The amplifier and the one that can make the beam pass through solids are an awesome way to enhance the projectiles",
      "Simple puzzle game but itâ\u0080\u0099s so satisfying and as it introduces new elements it makes for new and interesting puzzles. And with voiceover narrative makes this even better.",
      "That are some nice puzzle levels you got there :) Good job on the design, i was stuck a bit on the 8th level. I think the story was a bit in the background, but still a nice entry for this round"
    ],
    "comments_posted": 55,
    "created_at": "2025-02-13 19:48:15",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3315648",
    "coolness": 55,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mess3",
      "member_since": "06 June 2020",
      "posts": "268",
      "topics": "4",
      "followers": "3",
      "following": "2"
    }
  },
  "3317493": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "dev-pirates",
    "game_title": "A Girl and Her Spider",
    "platforms": [
      "web"
    ],
    "rating_count": 30,
    "comments_received": 26,
    "comments_raw": [
      "Excellent job as always!  You had a really impressive amount of polish here, and the level design did a really good job of introducing the mechanics over time.",
      "Very enjoyable, cute story and well thought projectile mechanics, nice job!",
      "Great game - very polished!  I absolutely love the spider friend. really clever use of an animal and I love the mechanic for when the spider broke boxes and retrieved the ball.  The only challenge for me was missing a shot and then having to go next to the enemy to get my ball for a second shot.  Lastly, great story, I played all the way to the end and just wish there was more.  This is one of my favorites so far and I hope you get to continue it.",
      "Nice and cute experience.",
      "I absolutely love how satisfying the throwing feels with how the ball bounces on hit. The sound effects are great too! Cool mechanic with being able to break boxes by making the spider run though them.",
      "I think this was the first game I played before the voting period started and so it got burried in the back of my mind but here we are. It is cute and enjoyable, loved the fetching spider, and looking at rating criteria you got it all amazingly well covered, for indeed the animal is crucial to  gameplay and even has to do with projectile, great job.",
      "I loved the artstyle and the ball chasing mechanics! From the other comments it looks like this is a prequel to your other submissions, so I will have to check them out!",
      "Oh! It's a prequel story to previous GDKO games ? Very engaging)",
      "First of all, the art is gorgeous (as expected). The tie in with Crunkle's was unexpected but fun. I think that the animals and projectiles were done exceedingly well, as both have multiple uses and both have uses that tie in with one another, amazing job with that. The story wasn't as integrated with the gameplay as I might have liked. Also minor nitpick but I don't think a single one of the signs was ever helpful to me, every one I read I'd already discovered the mechanic for myself, which was more fun in my opinion. They were probably a good inclusion for any players that didn't figure out the mechanics but for me personally they kind of took away immersion. This really came together as a complete product so great job with that, wonderful work!",
      "That was pretty fun! The story felt a bit random at times but it was enjoyable nonetheless. Seeing the spider barge through boxes was pretty unexpected and a funny game mechanic. Overall a pretty nice game :D good job!",
      "Fun art style. We thought of a similar concept somewhere (like an animal friend going to fetch stuff for you and puzzles based on that). But our implementation is flawless. Loved it.",
      "The shooting mechanic was fun, and worked really well with the animal companion. I really liked how the projectile had weight to it, felt really purposeful when I was shooting it. The art is gorgeous and the progression is tight with a nice easy to remember backtrack path that makes the world feel really open. It was also a really good length for a jam game, long enough to give an experience but short enough to not outstay its welcome. bug free too. I look forward to the next episode!super awesome job!",
      "Such an awesome game, I love to see the tie in with Crunkle's Sideshow!",
      "I love the art style. Reminds me of Bomberman Quest in a way. Fun mechanics, and my playthrough way bug free, unless you count the spider as a bug. I have no criticism.",
      "This is only part 1? Already felt like a complete game. Can't wait to see what's next",
      "You could tell me that this game world was ripped straight out of any of the Zelda games on GB, and I'd believe it. You did such a good job on the environment and I love it. Half expecting an owl like figure to tell me where to go to find the master sword. The story was really cool and loved how you've made it as a spin off to a larger universe. Projectile system was perfect for the task and you nailed the criteria for this round. Awesome job.",
      "Great game and story",
      "Love the chunkiness of the art style!",
      "Throwing the ball and having the creature bring it back to violet is a really cool mechanic, especially with how you expanded the mechanic to directing the creature to smashing the crates. I like the story too and it's good to see crunkle again :)",
      "Great game and story! The projectile and spider work well together. I really like the art style.",
      "Well deserved 5 star rating. Really good job! I like how the spider has multiple purposes, even breaking walls i cant traverse without it. Great story too and it fits so well into the universe you built with your other games. :)",
      "Graphics and sound are awesome!",
      "Very cute polished game! The art is amazing and once I knew what the spider could do I even loved it more. It would be cool if the spider could damage too so you can shoot 2 balls to create some sort of track for it to follow and damage enemies on it",
      "Excellent game ! The shoot and catch mechanic is a really cool idea. Congrat !",
      "Now I want a spider friend to bring me things...",
      "Honestly haven't had a chance to play it but judging the title I already adore this game....love love love spiders. If it's a lil girl with a spider like the title suggest my heart will melt ."
    ],
    "comments_posted": 59,
    "created_at": "2025-02-10 23:43:55",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3317493",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "975",
      "topics": "1",
      "followers": "25",
      "following": "23"
    }
  },
  "3320613": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "magnusfurcifer",
    "game_title": "A Girl and her Dog (GDKO 2025 - Round 2)",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 15,
    "comments_raw": [
      "This was a really impressive game, and your mechanics worked great!  I found that when I tried to slide under one of the swords from the trap, the character automatically stood back up after sliding instead of staying crouched, so I got hit a bunch by sliding instead of crouching by accident, so I would recommend crouching after a slide, but that's just a little nitpicky thing.  Great game!",
      "I really want to see this being expanded on! Liked the story and the gameplay. Smart and unique!",
      "It's still an impressive mechanism. The story and map go well together.",
      "I really liked this platformer a lot.  I think you did a great job of teaching us how to play.  And, I really liked that the difficulty wasn't that hard.   The spear mechanic was also very cool, both for killing and for getting to higher areas.  Really well done.",
      "Well done ! I like the whole look and setup of the game. I did not pass the part where i had to dodge projectible and fighting monster at the same time. But i definitely want to try again. well done !",
      "This game has come a long way from round 1. The platforming was overall very enjoyable, I did struggle with the section when you have to climb the pillar using multiple spears. Couldn't always get the spear to throw when I was standing on another, something to do with the ground check I'm assuming. Overall you hit all the main criteria for this round so well done! Great job!",
      "Great spear mechanics!",
      "Love the dialogue and the cute art. Nice voice acting. The character animations were super polished. The spear platforming and the sliding under the oncoming projectiles was very satisfying as well.",
      "Loved it. It had a very cinematic platformer feel , like prince of persia or flashback.",
      "hi the story are great animal fits the game perfecly the only thing that i hate is that the jumping is realy slow and it slowes the paste of game but exept for that nice game",
      "This was cool! I had a lot of trouble with the platforming, but I can see what you were going for. I love some of the puzzles!",
      "Ah, very excellent spear mechanics and the dog was a great. Had some issues with the controls, but it was really fun.",
      "Another metroidvania! This was cute but everything just felt slow, especially with the amount of times you need to navigate back and forth through the same areas. I really liked having the central mechanic of a spear that you upgrade throughout the game but the dog as a mechanic felt horrible and was very glitchy, the part where you need to use it on the button I just skipped over. The spear being used for both platforming and combat was neat but the combat was lacking and with only a limited amount of enemies in the game that don't respawn I was left wanting a little more.  Having most of the falls result in you just having to repeat a section you've already done several times was a little bit cruel. I still got some enjoyment out of it, though. Overall, nicely done.",
      "Almost everything out the movement feels great! With the exception of the spears, they feel overall slow. The amount of times I tried to throw a spear while jumping, or running and was just denied is countless. The story however, was really fun! It's simple, but made a great addition. Still one of my favorite games from round 1!",
      "I really like the idea behind throwing a spear and being able to use it as a platform. Good work."
    ],
    "comments_posted": 8,
    "created_at": "2025-02-13 12:15:10",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3320613",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/magnusfurcifer",
      "member_since": "23 August 2015",
      "posts": "323",
      "topics": "1",
      "followers": "41",
      "following": "12"
    }
  },
  "3322491": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "proudani",
    "game_title": "Billy World v1.1",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 12,
    "comments_raw": [
      "Very nice game ! Poor hedgehogs )",
      "I like platformers and this was no exception.  Normally, I'm pretty terrible at wall-jumping, but I was able to do this, so great job not making that too hard.  I like your sense of humor and I had a good time playing this.",
      "I liked the game when I played it last and I think it fit really well for round 1. I see how you extended it but it doesnâ\u0080\u0099t feel significantly different nor aligned with the task for round 2. I wish there was something about the shooting projectiles a little earlier.",
      "Great work. The platforming feels even better than what I remember from last round, and the story delivery through signs was a good choice to keep in there. It's a minor criticism but I wish you had added some new dialogue at the beginning instead of re-using old dialogue from round 1, but it's not enough to detract from my overall rating since all the story stuff was extra last round anyway.",
      "This was a cool concept.  I'm pretty confused by the level design, and I'm even more unsure what the story was about, but the platforming controls feel great! At the same time, for some reason the dash stops working during the lava part, and I can't always get the walljump to work.",
      "Well done! We all need a friend like Billy :D",
      "this game has a really good walljump, i may be weird starting with that but i love the walljump, its really smooth, hedgegod and bullet were cool but i wanted more animals.. but overall pretty cool!",
      "This game was still cute and still fun. There was still some jank from the first round and I'm not sure if the secret and desert levels are meant to loop. pew pew noise funny.  The platformer controller felt good, I still had the same issue with the camera as I did in the first round. I wish it stayed as zoomed out as it was in the tutorial level(s). The platforming is very fun and it was an enjoyable enough time, nicely done!",
      "I'm not sure if I missed something or if the pipe level is meant to loop infinitely with the desert level, but regardless It was fun! Ducky Sign is still as fun as I remember them being, and Mr. Box is still very funny to me for some reason. This game has a TON of personality, I just wish there was more of it to see!",
      "The pew pew noises from the gun are spectacular",
      "Heh.. \"pew pew\"",
      "I had fun playing this again with the updates. Well done!"
    ],
    "comments_posted": 3,
    "created_at": "2025-02-13 00:42:46",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3322491",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/proudani",
      "member_since": "27 February 2021",
      "posts": "37",
      "topics": "1",
      "followers": "6",
      "following": null
    }
  },
  "3322198": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "featurekreep",
    "game_title": "Bio Tank",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 22,
    "comments_raw": [
      "Amazing game, makes me jealous :DHad a lot of fun and the style was really nice!I did have a bug where, each time I game over'd, the background would be broken. The first time it was completely black on each level, the second time it had that stringy foreground color, but the background was still purple>My cursor also disappeared on multiple occasions, mainly when choosing pills",
      "Great game.  Really professional and polished.  I loved the story, the combat, and the upgrades.  Unfortunately, I wasn't very good and couldn't save my dog, but I liked trying.",
      "I almost got ending B on my first try, but instead I got hit once. Loved the gameplay! It was all so lovingly crafted to be as fine tuned as it could be. The movement felt so natural, the combat was fluid and fun, and the upgrades added so much enjoyment. The visuals and audio are also on point. The story was great!",
      "Loved the mechanics, loved the story, I had to restart 3 times to get to ending B.",
      "Thank you forending BTT______TT",
      "Very cool game ... sad though ( not that I am one to talk about sad games this round ).",
      "The polish on this game for a short period of time is incredible. The upgrades had a surprising amount of variety. It seems like the green pills expire after you win with them which isn't really explained and just discourages you from picking them even if they are fun upgrades. The criteria was addressed amazingly, the animal was cute and fun and the projectiles and combat were really fun. I didn't encounter any bugs except for I named my dog gamergirlxxx and that caused the text to have a stroke when it says their name at the start cutscene/dialogue. That's about the smallest issue ever but I felt like I should mention it. There could have been maybe just a little more juice, especially upon killing an enemy. I found the story enjoyable but I really don't think I can do another sad dog story ð\u009f\u0098­. Fantastic job!",
      "Amazing game! This is a perfect game jam submission imo!",
      "I got a visual bug after the game reloaded because I'm bad at TDS. Otherwise, this game was perfect! I will definitely be coming back to 100% this when I have time.",
      "Holy crap. Amazing job haha.",
      "",
      "",
      "My favorite game by far, so far. It's crazy you managed to make this in just 2 weeks. I'm predicting top 3, if not first place- for this game.",
      "Really polished, Great Entry with a solid narrative, although heart breaking in my case seeing me dogs name on the grave but gave me a good laugh! Keen to see how the game balance could progress further, I found myself a little OP in the last few rounds with all the upgrades I chose (that doesn't really factor into the ranking) just thought might be some nice feedback. Hope to see you in round 3!",
      "Was great to play and end on stream! Please feel free to watch for comments there (around 02:17:56), great to see another game in your distinct style!",
      "Even though I got the sad ending (and three password letters) I'm really impressed with this game. The projectile upgrades are really good and the enemy designs are top-notch",
      "You just nailed it! No words to describe.",
      "This game is awesome",
      "The story was great and expressed very well. The top down shooter was fun and everything fit together very well. Very well done!",
      "Crazy polished game - it feels great to move and shoot! Great story and it feels very juicy. The balance feels great, and it gives players some nice challenges to achieve perfection in each level.",
      "This was great. Fluid gameplay with a touching story. I liked the little touch on the stage names. I wish I had seen it during the rating period. I thought Iâ\u0080\u0099d still have time today but itâ\u0080\u0099s already closed.\nThere seems to be some minor issue with the background. At some point it went black and stayed black. Didnâ\u0080\u0099t affect gameplay.\nAlso unrelated, did you draw the spirtes yourself? I love them. I actually have been working on a game where I have an enemy that looks almost the same as your 9 eye monster thing. I also have a black outline shader very similar to yours :)",
      "Â¡wow! el juego estÃ¡ super logrado y su nivel de pulido es muy bueno, ademÃ¡s, Â¡muy divertido!"
    ],
    "comments_posted": 1,
    "created_at": "2025-02-13 23:06:32",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3322198",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/featurekreep",
      "member_since": "04 December 2017",
      "posts": "316",
      "topics": "5",
      "followers": "1,479",
      "following": "17"
    }
  },
  "3293395": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "benim-swe",
    "game_title": "Blade of Reversal (Round 2)",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 13,
    "comments_raw": [
      "Cool opening scene.  I'm always impressed with people who can create 3d worlds.  Also, the voice work was fun.  I know this is just the beginning of a game, but I think you are off to a good start.  I hope you continue it.",
      "Interesting narrative, too bad you didn't have the time to get more done.",
      "Was not able to use the sword. I right clicked but nothing happened :( Am i missing anything?",
      "Very nice starting cutscene, simple but  interesting.",
      "I love how the story was introduced, really cool :D",
      "The cutscenes at the start were pure cinema. You did such a good job of showing the story just through some epic still shots. The sound audio was done well, which helped with telling the story. The little goblins voice was pretty funny. Great job!",
      "",
      "Was great to play on stream! Please feel free to watch for comments there (around 01:50:30)",
      "Love how well the cutscene conveys the story despite being simple stills with audio! Wonderful job",
      "The opening cutscene is really well done and I like the audio throughout. I managed to get the blade of reversal and the 3D environment you made is looking cool. Unfortunately I didn't see any projectiles so I might be missing something",
      "I love the goblin voice acting. I wish this game had more time put into it because you can clearly see the potential in it.",
      "I rated you as high as I could while still being honest to the criteria.  The story and cutscenes are incredible! Your ability to tell a story without words takes real talent. I can't wait to play the finished game!",
      "It's a shame that you didn't have much time because the game looks promising. Story cutscene look nice, the goblin dialogue were fun and i really like game with parrying as the main mechanics."
    ],
    "comments_posted": 39,
    "created_at": "2025-02-13 19:45:56",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3293395",
    "coolness": 39,
    "participant_info": {
      "profile_url": "https://itch.io/profile/benim-swe",
      "member_since": "23 August 2021",
      "posts": "372",
      "topics": "1",
      "followers": "5",
      "following": "1"
    }
  },
  "3324018": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "octaviusrex",
    "game_title": "Bug Blasters",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "Great setup.  I love the way you got us into the story here.  However, the shooting/moving mechanic was difficult for me,  I like that the gun blew you back, but it would be cool if we had some movement control.  Still, the story here is really interesting and I hope you continue to work on this game.  Well done.",
      "I struggled a lot with the bug shooting also being the only way to move, but I still LOVED this.  The computer and story felt very pony island in a good way while still feeling unique.  Great job!!",
      "The presentation of the story is wonderful and unique!Unfortunately I ran into a bug on the second file where my character flew off screen and couldnt come back.I also like the momentum of the shots, but I do think the force of the blasts as it stands are a little tricky to the point that a tutorial may be in order.",
      "Very fun gameplay and ineresting story! Remind me about Pony Island or something like that.",
      "I liked the story and you had all the elements needed to fit the round theme and challenge. Fun game.",
      "Very unique combat system!",
      "A perfect game! It was awesome to play!",
      "This is a super cool concept! I found a few coding bugs where the spiders, if you shot them while they're climbing a wall, they'll get stuck. Which I didn't mind actually because it made those levels easier. It's also possible to shoot yourself off screen if you're moving quick enough (which I did often).",
      "I almost missed out on the game because I didn't notice the dot in the username, but I got past it.",
      "I like how you go from 3D to 2D and the password changing each time is a nice touch. I managed to get to the level where I had 3 bullets but I wasn't able to beat it and I noticed I could shoot myself off the screen. The shield on your back to reflect the shooting bugs was pretty cool and I like how you have to use your gun to move around",
      "",
      "Very cool. Really impressed with how this game was put together. Everything is very cleaned and polished. It's another game in this jam where I'm left scratching my head wondering how people manage to achieve this much in such a short space of time. The gameplay was very challenging. The only criticism I really have is the post-it note at the start. It could have been my eyes but I could barely make out the \".\" in \"Steven.Stark\"! Doesn't effect my rating though. Great job!",
      "Cool start with the start up screen + the room + the chat, really like the atmosphere of this. Cool narrative."
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 20:22:00",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324018",
    "coolness": 11,
    "participant_info": {
      "profile_url": "https://itch.io/profile/octaviusrex",
      "member_since": "24 June 2024",
      "posts": "14",
      "topics": null,
      "followers": "3",
      "following": "1"
    }
  },
  "3323704": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "sea-tiger",
    "game_title": "Bug Fixing",
    "platforms": [
      "web"
    ],
    "rating_count": 20,
    "comments_received": 14,
    "comments_raw": [
      "Absolutely LOVED the opening - it made me laugh out loud.  So, first time I played, I fell off the platform backing up and I just fell forever.  So, restarted and then had a blast killing those bugs.  I want more of that.  I hope you get to continue this game.",
      "love me some bugs annihilation",
      "",
      "Fun story and you hit all the requirements for the round. Was a bit light but fun.",
      "Very relatable story! You did manage to address each part of the criteria although that was really all that was there. The projectiles were fun to shoot and the animals were cool. I think more waves of enemies would have been nice, along with walls to prevent the player from falling off of the map. I liked the story, it was an interesting meta take although I think the cut to gameplay was a little abrupt and felt a little bit disjointed. I'm glad you managed to get something together in the small amount of time you had although I do wish there was a little more. Nicely done!",
      "I love this. Most relatable story I've seen the whole jam.",
      "That was neat. :) Though I did back out in to the void my first time through :P",
      "This feels like gameception and I really enjoyed the narrative design. Projectiles felt very nice to use, along with the accompanying bug monsters and the animations for the player (keyboard and the projectile itself). Also the music was banging. Great job!",
      "I never thought I'd say this but I think the game needs more bugs.",
      "Was great to play on stream and have you there to chat!Please feel free to watch comments there (around 00:13:52 mark ) Thanks for submitting!",
      "I barely got my game done in time, and still had to deal with hours of Unity screwing me over. Love the opening cutscene, but It it a little too close to home.",
      "Nooo the project :( This game is a timeless tragedy, thank you for sharing it. I also hope you'll finish the original game and publish it, I would be interested in playing it even tho it can't compete in this round.",
      "cool concept, nice touch with the opening cut scene!",
      "Haha this opening cutscene is tooo true to life, but I love it."
    ],
    "comments_posted": 1,
    "created_at": "2025-02-13 14:51:49",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3323704",
    "coolness": 3,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sea-tiger",
      "member_since": "19 December 2020",
      "posts": "37",
      "topics": "3",
      "followers": "5",
      "following": null
    }
  },
  "3323044": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "h4zm4tt",
    "game_title": "Chrome and Quacksworth",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 15,
    "comments_raw": [
      "The projectile mechanics is awesome tbh, though I think aiming with the right click was unnecessary. Also, agree with comments below about the coyote time, I can see you added some spare space close to the platform to land on, but in terms of jumping from the platform it doesn't work from what I tried.",
      "Haha, i was laughing to myself once the duck relvealed himself :) Good Job!",
      "For the criteria its a great game, but in terms of gameplay i would add some stuff, the shooting mechanic feels nice and responsive but the movement could use some improvements. Adding some coyote time will always benefit you if making a platformer and your speed and jump should sort of match. while the movement itself is okay the jump is so high compared to move speed it seemed a bit off. Also SFX they make any game feel so much better without a lot of work so I really recommend adding it in. If you dont know how to get sfx you can look up OpenGameArt for free songs,sfx,art,... or use something likehttps://sfxr.me/and generate your own.All this is just feedback, your game was fun and fit the criteria so gj!",
      "\"Memory systems: offline, weapon systems: online\" is a very meaningful start. This game features the best twist I have seen yet, though I had doubts after slaughtering the first couple of sheep.",
      "Honestly, this is a great beginning to a game.  I loved the twist ending, I just wanted to keep playing.  Shooting the duck was fun.  I really hope you get to keep working on this.",
      "Very fun idea ))",
      "I loved the twist with the duck's intentions and using him as a weapon was fun. I was too focused on thinking which sheep could be the wolf that I never saw that ending coming, good job!",
      "ok I laughed at the story, didn't see that coming :D",
      "Amazing work with the duck projectile. So satisfying to use. I don't know who the wolf was so I just killed all the sheep. Now that I think about it, maybe the real monster was the duck and he lied about one of the sheeps being evil in order to get me to commit sheepicide.",
      "Short but strong little experience",
      "Interesting story and game. Hit all the marks and it was very fun. Well done!",
      "I very much enjoyed the duck cannon.",
      "The projectile mechanic felt really cool to use and the art and animations were done so well. I've seen a few comments saying that you didn't have enough time to work on this as much as you would have liked, which is a shame because it feels like there is alot of potential with this one. Still, you should be proud of yourself because the mechanics were really cool and the story was pretty humorous. Good job!",
      "",
      "I wish this was longer. What a great proof of concept!"
    ],
    "comments_posted": 25,
    "created_at": "2025-02-13 07:49:16",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3323044",
    "coolness": 25,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "330",
      "topics": null,
      "followers": "13",
      "following": "6"
    }
  },
  "3324993": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "laespiraloscura",
    "game_title": "Cosmoquack: Loop of the Lost",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 16,
    "comments_raw": [
      "Very nice artwork and a cool touch with the voiceovers. I loved the thumbnail as well.\nIt could use a couple tweaks with difficulty, specially around the firing duck. I agree with the comment below on coyote time. Also, there was this platforming section with thin platforms that had double-sided collision where I was expecting it to let me jump from below but I kept â\u0080\u009chitting my headâ\u0080\u009d and it was a little frustrating.",
      "The polishing is insane!",
      "Animation are awesome ! Had lots of fun.",
      "This is slick. Visuals, music, etc. all on point. I loved how the footstep animation synced with the beat. The shooting felt responsive, great system feedback. I love time loop stuff too.",
      "Psyched to see another C3 programmer in the mix!  Fantastic game.  I loved it.  Great character animations (deaths were really satisfying).  Love the surprising death loops (with upgrades).  The only thing I didn't like was the platform jumping - I'm terrible at it and kept bumping my head on other platforms.  Still, that didn't distract from an overall awesome game.  I can't wait to see what you do with it next!",
      "So much fun :)",
      "Amazing work. This was one of the best games this round hands-down. The writing was top-tier. The shooting and platforming mechanics were super polished and the animations were PROFESSIONAL GRADE. When I first met 'the target', I nearly quacked my pants. And when he showed up the second time, I actually did.",
      "This is a great game and one of my fav entries.  Not only a great amount of polish, you have also done well on the judging criterias too. The death based progression and ability unlock is cool af.",
      "This was really incredible!  The amount of visual polish was fantastic, and the story with the timeloop and duck were really great.  I can see this being top ten for sure!  Amazing job!!",
      "A fun game where you struggle to kill a very stubborn duck - had a blast playing it! You put a lot of effort into polishing the visuals and audio, I loved the voice acting as well.",
      "Great game. I loved the deaths becoming part of the story and allowing the progression. I dislike w being jump with a d but that's just a personal preference. Great game, I loved it!",
      "Good job! Unfortunately, i cant get past the big duck feet. haha",
      "Looked awesome, the projectiles system was really good. The vibe and overall feel of the game was top notch. The story was fun and engaging. The only criticism I have was the platforming section, which was a bit frustrating due to a point made in another comment. Other than that I really had a blast with this one. Great work!",
      "I love the duck, what a gorgeous and creepy creature with many gimmicks. The story is intriguing, I need to know what happens next! I'm also impressed with all the juice you managed to add, shooting & moving feels good. No complains here.",
      "This was cool! You have a real talent for animation!",
      "The art and music are superb. I like the absurd behavior and how bloodthirsty the duck are. It's really intriguing and makes you want to know why the duck is so weird. The animation is very smooth. My only complaint would be that it didn't have jump buffering and coyote time for the platforming parts. Since it's not a platforming-heavy game, it's not a big problem."
    ],
    "comments_posted": 8,
    "created_at": "2025-02-14 00:50:35",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324993",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/laespiraloscura",
      "member_since": "01 November 2020",
      "posts": "103",
      "topics": "1",
      "followers": "36",
      "following": "1"
    }
  },
  "3325000": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "potatuetata",
    "game_title": "DIG FAR",
    "platforms": [
      "web"
    ],
    "rating_count": 22,
    "comments_received": 17,
    "comments_raw": [
      "I loved the gameplay, same as round 1.",
      "You really have something special with this game.  It took me less than a minute to know I was giving it a perfect score, and I still played through the whole thing just cause I was having fun.  Amazing job!!",
      "This was my favorite game in round 1 and I still love it in round 2 (I collected all the upgrades and made it out of the cave).  But, I was hoping there would be a bit more gameplay in this round.  In any case, this game is still crazy fun (there is just something so addictive about getting those upgrades).  I hope you get to continue it and I get to play it again.",
      "Still one my favorite games :)",
      "I never got around to playing this game during round 1, but I sure am glad to be playing it now! It's a super chill and fun little experience. I was definitely hoping for a longer experience, but what we did get is still awesome! Super fun!",
      "This game was extremely satisfying to play, it feels great to break the rocks up with my laser and collect the materials and then upgrade. Great game loop. You have the basis for a really cool game here.",
      "Nice game but no projectile :sad-duck:",
      "The mechanics so sooooo satisfying, I remember this one from Round 1. The upgrades ramp up quickly enough to not get old and then you've got this piercing laser just crushing ores. Feels great.Shame you didn't get to add everyone you wanted, but whats there feels really good!",
      "I love the skill tree. The first thing I did was max everything out, then I was like \"Wait, the duck told me to go somewhere....\" It feels great to play. Bummer that you ran out of time but the story that's there was cool.",
      "super game projectly system was great,animal and story  chracter were ok but apart from that realy good game",
      "I'm really happy to see you continuing the game from last round! I'm sorry to hear that you weren't able to finish it, but what is here is incredible solid, polished and I couldn't find a single bug! I really hope to see you take this game even further in future rounds!",
      "Sounds like it was a pretty rough development cycle but it still came out nicely. Breaking the rocks was still incredibly satisfying and having do so to explore the map and find your way out was a nice addition. While the game felt a bit incomplete, it still left me feeling as if I had a full experience and I had fun, which is nice. I liked the little duck too (^)> great job!",
      "",
      "Ahh so happy to see this game come back! The intro cutscene was very cute.",
      "I remember playing the version of this game for last round and you've made some good improvements. Fun game!",
      "This was great! I wish there was more story. Sad too see only one part, but I understand the business that has come upon everyone this week.",
      ""
    ],
    "comments_posted": 8,
    "created_at": "2025-02-14 00:54:31",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3325000",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/potatuetata",
      "member_since": "02 December 2018",
      "posts": "216",
      "topics": "1",
      "followers": "20",
      "following": "4"
    }
  },
  "3316119": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "minjutin",
    "game_title": "Descartes' Animal Machine",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 21,
    "comments_raw": [
      "Oscar for best original story )",
      "Awesome game. Superb story. And LOTS of math. Every time a new mechanic was introduced, it was given ample time for the player to learn what they do. Some levels felt much easier than others, but overall the game stayed at a nice difficulty curve that never swayed to far in either direction. Excellent work!",
      "this game should be mandatory for schools i love it.",
      "Yep... math is still hard.",
      "I would definitely buy a \"full version\" of this. The world needs more cool math games <3",
      "Seriously, unique and original game.  I can't believe how much you were able to create and pack in here during a game jam.  The cut scenes were awesome.  The humor throughout is great.  And, I love math games (as evidenced by my game \"PEMDAS\" in the first round).  Really well done.  I hope you get to move on.",
      "That intro scene is the most amazing thing I have ever seen, combined with the music. Very clever and even poetic.",
      "Top marks from me. Loved it. I was a little daunted at first because of how many puzzles you said there were, but they were quick to get through so it didn't take too long. Funny story, good puzzles, and a great game.",
      "This was really cool and had a truly impressive amount of polish!  That's five stars across the board from me!!",
      "Amazing game and story! At first, I thought the math would be simple, but I'm glad it got more and more complicated as the game progressed. All the art and the funny story added some absurdity to this math game and made it very enjoyable. Great job!",
      "I do not think, therefore I do not am.",
      "The story is very engaging and definitely kept me all the way to the end. I'll admit that I had to skip a lot because the math got pretty complex, especially as I've never heard of things like abs. It was good watching the pigeon follow the path but the story is what is the main thing for me, great job with the art and dialogue!",
      "This game does so many things right, it has a funny story, an unique mechanic, could defintely be on coolmathgames, has bonus levels (that aren't mandatory) and has nice soundtrack to go with it. Good job!",
      "Ok this was hilarious. Excellent storytelling and I love how the pigeon projectiles are math functions :D Halfway through the game I learned to embrace some delicious sinus wave cheese spam so I didn't solve the puzzles as intended, and I'm sure the pigeons would be concussed if they could think. But obviously they can't.",
      "Having read some of Descartes previous to this game, I could not stop laughing. I want you to make a game with this type of narrative for every type of ancient mathematician. Actually, I want this kind of narrative for any historical figure ever. Well done, perfect game IMO",
      "I loved this reimagining of Descartes. I studied Philosophy at University and got a real kick out of the story! Extremely original and humorous. I'm not a big math guy but the mechanics were well implemented and can't really find any faults with this game at all. I got about halfway through the game, I was waiting to see if there would be some kind of pun to do with \"Cogito Ergo Sum\", maybe it happened later or I missed it. Great work!",
      "Initially, I was hesitant to play your game because of the math, but I'm glad I finally gave it a try. Your unique take on the task for this round was impressive. I especially appreciated the option to skip puzzles; my old brain wasn't functioning well this morning. The original story captivated me and kept me engaged until the end. Well done!",
      "Wow. You made math fun. Going into this I wasn't sure what to expect and was kind of disappointed at first, but quickly fell in love with the game. It's so simple yet there's a lot of depth, especially in the optional levels which are a really great addition. The writing and story is great and the art serves as a great vessel to move it forward. I really like the trig and absolute value questions, I think that's when I really started enjoying myself. I'm going to be honest I'm surprised but this is one of my favorites so far, well done!",
      "You sir are the worst kind of scoundrel, forcing us to learn math just to find out what happens when he gets to Sweden.  In all honesty though, I didn't play many games yet but this one feels like top 3 to me, it was a joy. Excellent writing, inventiveness, and though graphics are simple they are fitting the time period. Seriously, this story goes places, I'd recommend everyone to play through. The only complaint, maybe the 2nd level in the third optional branch is unsolvable, but I could be just stupid.",
      "Absolutely amazing! I was scrolling through the list and saw Descartes and maths, so had to play it first this round! Loved the way you used the story to blend with the mathematics to blend with the jokes!Full marks from me! Great work on the narrative, the art, the jokes, wow! Also the branching/harder questions were a great touch, parallel to the story",
      "Awesome work!"
    ],
    "comments_posted": 18,
    "created_at": "2025-02-13 16:47:35",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3316119",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/minjutin",
      "member_since": "17 December 2020",
      "posts": "159",
      "topics": null,
      "followers": "50",
      "following": "22"
    }
  },
  "3305104": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "magicalmcboss",
    "game_title": "Doomish",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 21,
    "comments_received": 14,
    "comments_raw": [
      "I wish the knife was more usable as a melee weapon, but it's range is genuinely so bad you are damn near forced to throw it constantly, and given how there are zero repercussions for spamming the throw button, it leads to the melee combat feeling underwhelming. Which is a shame, as I LOVE melee combat. It was fun game nonetheless. It's fairly rare to see a 3D Game, so great work!",
      "I love old school Doom and I really enjoyed this game.  Although, it actually reminded me more of Castle Wolfenstein (which I also love).  Anyway, this was a lot of fun and the rat made for a nice change of pace challenge.  Oddly, this might have been one of the few games I think was a little too easy, but I'm sure if you continue it, you can begin to ramp up the challenges.  Really well done!",
      "Cool game! I never used melee because throwing the knives felt way more useful :D and I also love the hyper intelligent rat companion avoiding death blenders just to help you out. Enemies could be a bit more threatening as they felt very passive right now.",
      "This was really great!!  The rat for opening doors was a really great way to follow the prompt that built the story as well.  One thing I will say is that I really never found a use for the melee attack since I had infinite knives and the melee hit didn't seem to do more damage.  For this jam I don't think that matters, though!  Great job!",
      "Absolutly love the visual but I think that there should be more enemies in the rooms",
      "I love the style of this. I can't think of a single thing I dislike. Well done!",
      "It was lot of fun to talk to my rat fren and get them to open doors. I would love to see you continue to develop this ;)",
      "I love retro fps games. And here you nailed the aesthetic, the ambience and the SFX. The monster designs are really cute, and I liked the rat platforming (ratforming?) sections.",
      "Wow amazing job!",
      "Was great to play on stream ! Thanks for submitting! Please feel free to watch for comments there (around 01:09:40)",
      "I loved the style of game, I made one myself that I called \"Doomish\" a few years back for a game dev challenge. Good story and controlling the rat was great. Fun game. Too bad some bugs got in the way of the fun.",
      "In memory of Jerry, haha!",
      "Love me a boomer shooter. I think you've got a recipe for something really cool here, it just needs a killer soundtrack and fleshing out a little more. You nailed the DOOM visuals and feel of the game. I thought the rat tunnels mechanic was really fun, clever way to fit the task into your game. I had fun. Well done man!",
      "I just gave this a try. I liked it overall. I like the precision required on the rat segments and throwing the knives."
    ],
    "comments_posted": 1,
    "created_at": "2025-02-14 00:28:25",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3305104",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/magicalmcboss",
      "member_since": "16 November 2021",
      "posts": "46",
      "topics": "2",
      "followers": "4",
      "following": "2"
    }
  },
  "3324324": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "smartmagpie",
    "game_title": "Draw! & Throw!",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 15,
    "comments_raw": [
      "Considering the time you took, this is a fairly great game! The trash is satisfying to throw, the picture is fun to paint, and the frog is nice. By all accounts, this is great!",
      "First off, the frog is adorable.  Second, I love throwing paper into the trash.  This was a fun and original take on the genre.  I wish there was a bit more to the story and maybe a second challenge on the throwing like a breeze or a frog tongue getting in the way.  But, even as is, this was a lot of fun.  Well done.",
      "Just delightful and fun :) I like it a lot.",
      "I got stuck and game freze propably because of this:",
      "This was a heartwarming little story. Thank you so much.",
      "Everything work pretty well together, well done!",
      "Really nice short and sweet game. I got a few dunks which felt good to build up confidence and the frog is a lot of fun. All the elements in the game work really well together. Here's my final frog portrait :)",
      "Cute relaxing game. Not sure if it's cheating, but I had to use my drawing tablet to complete the drawng. Fun game.",
      "Cute relaxing game that fits the criteria perfectly, good job!",
      "I found this relaxing to play. Cute too. Great job. You've got the projectile and animal connected elegantly ð\u009f\u0091\u008d",
      "This was a cute and simple game! You've reminded me that game jams don't need to be some crazy complicated thing. Well done!",
      "A funny and creative game! I enjoy your frog cinematic universe and the story is very different from your typical game jam stories, so you get a lot of bonus points for that.  I'm not 100% sure how to get more confiedence tho, I feel like even after speaking with the frog and throwing drawings to the trash, I still only managed to draw as much as previously :')",
      "Unusual combo but it works! At first I though the \"confidence\" was time based, so I had to try and draw both accurate and fast, sadly this wasn't the case. (I think it would've made the gameplay more interesting!)",
      "What a charming little game! It's a very creative way to combine the projectile and the animal. Great job!",
      "I really suck at drawing. And dunking my scrunched up failed portraits into the waste bin :( I had fun playing this game though. You followed the task well. Good work!"
    ],
    "comments_posted": 37,
    "created_at": "2025-02-13 21:34:13",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324324",
    "coolness": 40,
    "participant_info": {
      "profile_url": "https://itch.io/profile/smartmagpie",
      "member_since": "31 January 2018",
      "posts": "453",
      "topics": "1",
      "followers": "7",
      "following": "23"
    }
  },
  "3320413": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "semon111",
    "game_title": "Duck&Gun",
    "platforms": [
      "windows",
      "linux"
    ],
    "rating_count": 10,
    "comments_received": 7,
    "comments_raw": [
      "Interesting game! I feel like this could be a great horror game or meta game if you decide to develop it further. I like that you can shoot the win text, and I was kind of hoping there would be something more after shooting it.",
      "Great game with a great story. Felt like Elmer Fudd going duck hunting to hell and back. And then shooting the \"The End\" text. Loved it. So much fun, well done.",
      "I love this game. The simple little story is so funny, I only wish the game lasted longer!",
      "Even the ghost duck is not safe from my bullets of retribution. Although I do wonder what the poor duck did to deserve such treatment...Great interpretation of the task, it was simple but effective. Good job!",
      "Screw GDKO, this is game of the year!",
      "This was cute! Clever storytelling, simple and fun game, what's not to love?",
      "Okay but you really manage to tell a story without using any words and that makes me impressed. I'm not going to spoil anything but I actually laughed a multiple times, a wonderful duck hunt parody game.Especially the third duck was amazing, I added it to my personal \"things that bring joy\"-file so I can look at it whenever I feel sad."
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 04:16:22",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3320413",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/semon111",
      "member_since": "21 October 2022",
      "posts": "52",
      "topics": "1",
      "followers": "10",
      "following": "10"
    }
  },
  "3226829": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "elstrawfedora",
    "game_title": "Dung Battles",
    "platforms": [
      "web"
    ],
    "rating_count": 28,
    "comments_received": 25,
    "comments_raw": [
      "Really fun game! A bit hard to control but easier to control than katamari haha.",
      "Wow, the modeling work done for this game is incredible! I found the game to be a little too easy, but I still found the game enjoyable.",
      "The intro animation was excellent, I loved how the story was introduced :D",
      "Amazing work!",
      "Struggled in the aiming training. But fun game. I dont know how did you manage to add cutscenes and music and everything in so much details in just 2 weeks as a solo dev. This is so inspiring. I dream to reach your level one day!",
      "nice",
      "Great additions to the first round version that meet all the criteria for this round. This is a really fun game with a solid style and theme. Well done!",
      "Really nice, impressive that you almost made a full game. Only issue I had is that when you jump and move you speed up waaaay faster than on the ground. In level 1 had to go back 2 times because the bomb exploded because of the extra speed.",
      "really impressive entry, you managed to fit the game into the new criteria really well, great additions to an already solid submission, killing it! (insert another bug joke here)",
      "The amount of cutscenes and engaging dialogue in this is super  impressive for a jam game! The \"collecting\" part felt a bit long,  otherwise the pace was perfect and kept me engaged! Sometimes there must've been some weird physics issue cause the ball got super slow, but jumping made it normal speed again. (This happened if I hadn't moved for a while, for example after a cutscene)",
      "peak cinema, peak dung, peak story, peak game, its PEAKð\u009f¥ºð\u009f¥ºð\u009f¥ºð\u009f¥º, im gonna dock a few points tho, this game wasnt free from bugsð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ theres so many dung beetles and from my reserch those are bugs ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡ð\u009f\u0098¡",
      "the animation at the start of the game is sick, how'd you do that? great submission! looking forward to see what you do with this in the future",
      "This game is absolutely packed with character and charm. Had a great time, only played through story but I may come back to try the other modes later. The animals and the story and the art are just so cute. I had a horrible time during the aim training level as it felt pretty bad to aim but not egregiously so, however my cannons stopped firing and I had to restart the story. I found that even though I was having a horrible time I was also having a great time because of all the charm and cuteness. The story mode alone was incredibly impressive given the time constraints, and great job working in the story and the animals and mostly the projectiles. Well done, very impressive!",
      "I don't know if it's just the cel-shaded art style, but this game reminds me of Wind Waker. Lovely vibe. Cinematics are top notch and just an all round fun game. You did a great job telling the story.",
      "The game looks and sounds great, the story is simple but compelling, the cutscenes are cute and funny. I loved the Katamary when I played them and I love seeing it back here; my favorite part is still the arena battles. I had some trouble in the training when I was supposed to shoot down targets. I assume I need to throw myself at them with some degree of force (I am the projectile?) but I was only able to shoot down one. Other than that, everything else, great work.",
      "Amazing story and cutscene! I like how you implemented the projectile in your round 1 game. Can't wait to see what this game turns into. Great job!",
      "Amazing work this round. Very clear story-telling, cinematic opening was high quality and didn't overstay its welcome. Plenty of story tied into the gameplay. This is S-tier stuff.",
      "",
      "Man, the level of polish here is nuts. I'm just blown away by how fantastic the cutscenes have come out, the framing and character animations, it all just looks really polished and juicy, even for a non-jam game. The narrative flows well with your dialog system, it's cute and funny and integrates so seamlessly with the game play. Also just having all the assets in place (Music etc) with a cohesive art style (That cartoon outline depth shader thing look sick). Just a really impressive game.Mechanically the movement feels good, I actually feel like it's a bit more controllable than round 1 but maybe that's just in my head. The shooting is tough!Super awesome job.",
      "The story was so cute! I love the cutscenes. The shooting mechanics were really tough to control to be honest, but everything else about the game is perfect!",
      "",
      "I've never seen anyone succeed in expanding on elements of Katamari Damacy like this. Especially with regard to the fidelity and rationality of the story, it is enough to call this game the original Katamari Damacy.",
      "Im happy to see you continued on this game! Very cute opening cutscene and a good expansion on the gameplay of the game!",
      "That was a fun time. Good Job.",
      "Absolutely amazing opening - your storytelling and animation is fantastic!  Also, I love the way you teach us how to play, while still continuing the story.  You actually made a cute dung beetle that I cared about.  The 3d world was amazing. I just wish I was better at moving around it, but the more I played, the better I got.   Overall, seriously impressive world you've created with some of the best animation I've seen!"
    ],
    "comments_posted": 24,
    "created_at": "2025-02-12 16:01:06",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3226829",
    "coolness": 25,
    "participant_info": {
      "profile_url": "https://itch.io/profile/elstrawfedora",
      "member_since": "08 June 2022",
      "posts": "121",
      "topics": null,
      "followers": "14",
      "following": null
    }
  },
  "3218383": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "afuwwan",
    "game_title": "Endless Charge",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 13,
    "comments_raw": [
      "Get to second area without found a battery )",
      "I think you've started something interesting here with the non-linear world and emergent storytelling. The gameplay doesn't quite gel for me yet but I think with more time this could turn into something cool.",
      "Love the look of this game, especially the robot and its little cat side-kick.  I also like that this was a pretty forgiving platformer.  It was also cool the way you revealed more of the story throughout using the signs.  I think this is the start of something pretty great.  I hope you continue working on it.",
      "ð\u009f¦\u008a",
      "Pretty cool game! Is there an ending? I think I went to all the places you can get to but maybe I overlooked something. I reached dead ends on both the left side and right side of the map, and I assume the dead end at the right side is the end as you \"leave\" the abandoned area. I like that the level design is a bit convoluted, but at the same time you have the battery mechanic which forces you to fully explore an area as you can't go back later without any batteries. Not much of a problem right now (unless I somehow missed the ending) but if you plan to expand on this mechanic it's something to keep in mind.",
      "Very creative and charming",
      "The destructible terrain and the ability for the fox to sniff out buried items was really cool. The handwritten notes scattered around the world were a really nice touch. Just wish there was a bit more gameplay to go with the story, but it doesn't affect the rating.",
      "Loved the game, that is a good doggo!",
      "I liked this a lot!  Using the animal to help look for batteries was a really good use of the theme.  One thing I would recommend is making the animal's role a little more clear from the start, maybe by adding a tiny bit more instruction.  It took a second to understand that \"press e to search for batteries\" meant having the animal go look, and \"nearest battery is too high or too far\" had me thinking I had to climb for a while before realizing it just meant the animal couldn't find a path.  Once it clicked I really liked it though, and overall I think the mechanic worked out really well!  Great job!",
      "The pet mechanic was a very cool and inventive implementation of the theme! I also enjoyed the free-form exploration of the different areas in the level",
      "The bomb system is a good addition to your previous game, in my opinion there could be even more digging around.It got me a while to realize the cat is used to search batteries, but that definitely made finding batteries more focused. Nice job with the storytelling too, using letters instead of basic narrative was a good idea.",
      "The story was great and you got the projectile and animal mechanics in there with the bombs and cat. Fun game.",
      "Love the story! I wish the cat did something more than just walk around with me. I couldn't figure out what \"Q\" was supposed to do. Fun game otherwise!"
    ],
    "comments_posted": 7,
    "created_at": "2025-02-11 14:19:59",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3218383",
    "coolness": 26,
    "participant_info": {
      "profile_url": "https://itch.io/profile/afuwwan",
      "member_since": "20 November 2024",
      "posts": "115",
      "topics": "1",
      "followers": null,
      "following": "8"
    }
  },
  "3300667": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "halfsmore",
    "game_title": "Enfeathered (JAM VERSION)",
    "platforms": [
      "web"
    ],
    "rating_count": 25,
    "comments_received": 19,
    "comments_raw": [
      "it's really good, both playably and visually are 10, very good job!",
      "Easy 5 stars for you. This is amazing, great job as always! The only critique i would have is that the screen is a bit to pixelated if played in fullscreen, in my opinion. If I only have the small display, around half my screen size it looks great, but in fullscreen the pixels are a bit too big. Nothing dramatic though, so good job! :)",
      "Amazing work, I loved the different areas, a very fun game to play and unique look to it.",
      "I had the pleasure to test this game while it was still in development and I have to say I'm really impressed with how it turned out in the end! I like how you made the spikes less punishing in this version, it was a really good decision.",
      "Very ambitious, cute and well done!",
      "Veeeery cool game! Super cute art-style! Waiting for full release ;)",
      "I absolutely love your art style.  It is so cool.  Also, the opening images were amazing.  What a great way to begin your story.  UnfortunatelyI'm just terrible at these kind of games, so I wasn't able to get to far into it, but I'm really impressed with what I saw.  Lastly, I thought the music was fantastic too.",
      "The metroidvania elements with the minimap were super good!  I also really loved the art style and the story.  One thing I would recommend is finding ways to make things a little clearer to make sure the low res pixel style isn't getting in the way.  The two places I think were a little hard for me were enemy hits and the spikes.  At first I thought I had missed the enemies when I dashed, so I think just making the hits really extra obvious would help.  Also, it took dying a few times to realize that I was running into spikes.  I know spikes can be hard in a low pixel style cause you can't get the sharp points that scream \"this is a spike,\" but maybe something with the animation again like a blood spurt or having the spikes light up red when  you hit them so that it's really clear what you ran into that made one of your eggs break.  Overall this is a beautiful game and entry and I'd love to see more!",
      "Fun game, I do like metroidvanias. I think you got all the elements needed for the round. The art and style are great and the progression was good. Great work!",
      "Wow. This was a great entry. Simple but effective storytelling. The visual style of the game, with the downscaling and the little wobbles looks great. I may had preferred the opening cutscene to follow the same style. The game feels complete very complete. Minor complain is the very first spikes jump, that was a little frustrating until I realized I could hold down space to â\u0080\u009cjumpâ\u0080\u009d further.",
      "Bravo for making a metroidvania and a good one at that too, it's certainly an ambitious thing to do for a game jam. The opening cutscene with that comic book style is done really well and tells the story very clearly. I really like the artwork throughout the game but I think the outline comic artwork is better than the pixel art even though both are absolutely gorgeous by all accounts. I didn't get to explore all of what you created and it's mainly because I am not used to the controls (for me W to jump, space to dash is my norm) and I need to stop to make food so ran out of time. I got 4 health eggs, saw a 5th but couldn't get past the spikes and got the glide ability in the pink area. I enjoyed what I got to see and I appreciate the checkpoints and minimap and at no point did I feel lost. I think marking the nests on the minimap and any powerup that you see but didn't get on there would be a good thing to do if you expand the game. I think it would an improvement if the enemies died in one hit and the general difficulty was lowered at least to begin with. I liked the bees, but I found the bats difficult to defeat and think if they stayed still it would be an easier time and I think an even easier enemy like a snail that crawls around the walls could be cool. I think it was the spikes that I died most on though. There were times when I had a powerup and it said click any button and in my haste to dismiss the prompt I would click my mouse to close the window and end up dashing to my death. There was also a section where I dashed through to the next room and I immediately fell down into spikes as the momentum carried over or maybe it was just me I forget but that section was a tough one to get past but I managed it a number of times and was probably more difficult for me because of jumping, gliding and dashing all at once with controls I'm not familiar with more than anything else. All in all, I think it's a really great game with a lot of great platforming in it, which is exactly the type of game I love and the artwork is stunning and some really great upgrade abilities in there too. Hope my feedback helps in some way. One last suggestion:  I think the dash ability would be more rewarding if it were earned rather than available from the start and if that flower above the spikes wasn't there as I was looking at that instead of the spikes",
      "I find it hard to comment on this game. I'm generally not a big fan of platformers if the movement doesn't \"fit\" for me. So I didn't get very far in this game. I'm gonna dump my thoughts but they might mean nothing to you as I'm definitely not the target audience for this game :D but I'm doing it anyway because it looks like a lot of thought and effort was put into this game and you stated you want to develop it further.",
      "Its a really nice game and the art, shaders all fits so well. Only issue I had was that it was really hard and the combat didnt give enough feedback imo. It took me very long to realise that the enemies had invunrability frames after getting hit so I just kept dashing and it felt like my hits werent connecting. Also was hard to keep track of my own health since I didnt always see that I got hit. Other then that it fits the criteria perfectly and very impressive that you made it in such a small time",
      "Too good. Can't believe this was done in two weeks. I'm excited for the full release",
      "This has my favorite story so far. Great job on the storyboarding at the beginning, that set the stage perfectly. You built an interesting world. Full marks from me in that category :)",
      "Very well made with good room layout. With this being a story round I'm going into the mindset of finishing all games, but I might regret it if every game takes 35 minutes...The initial dash-jump felt a bit too difficult, was stuck on it for a good minute or two, and accidentally jump right after initial respawn, which made we go into the room above the spawn. Other than that the game felt bug free and polished. The lack of sfx is definitely an issue, but the adaptive music makes up for it, awesome job with that! (I didn't notice it changing dynamically at first, but when I did, I noticed that you even change it depending on the biome, AWESOME!)I heard about the healing issue, I never understood it and wouldn't even known that it was a thing if I hadn't looked at the comments, might be the last room I didn't get tho. This might partly explain why I felt the game was a bit too hard, but I would've had an even better time if it was just a tad easier.The non main character animals (enemies) don't feel that important in terms of them \"being animals\" since they don't behave much like them anyways. The little peeps on the way were cute though.Overall I really appreciated the game, tho I wish you'd spent more time polishing (sfx) instead of adding more rooms. I know that it's hard making a \"tiny\" metroidvania I believe a game jam game should never be much longer than 15 minutes as very few people will actually get to the finish and get that satisfaction.Damn that 99% is annoying me more and more while I write this review.Also I think this is the longest game jam game review I've ever written, I guess it's fitting though for such a content packed game.",
      "Such a beautiful game with a really good Metroidvania vibe! Though the game is a little too hard for me, I still enjoyed the gameplay a lot.",
      "This game is (aside from a couple bugs) absolutely perfect!I legit got teary eyed while playing. The visuals and music are just *chefs kiss*",
      "Nice game, but i think the eating seed implementation isn't working for pc people. the bird doesn't eat"
    ],
    "comments_posted": 34,
    "created_at": "2025-02-10 00:13:21",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3300667",
    "coolness": 34,
    "participant_info": {
      "profile_url": "https://itch.io/profile/halfsmore",
      "member_since": "01 August 2022",
      "posts": "271",
      "topics": null,
      "followers": "20",
      "following": "3"
    }
  },
  "3234273": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "kiritoj22",
    "game_title": "Escape From Earth",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 9,
    "comments_raw": [
      "I'm not going to lie, I killed a lot of birds (or a lot of birds killed me)  This game was intriguing and I wish I was a little bit better at it.  Still, I liked the flying a lot and thought this was a really solid game and with a bit more story it could be great.",
      "that ending, lol",
      "Took me a bit to figure out the gameplay loop but once I figured it out I actually thought it was pretty creative. I did think the bullets should be able to take out the birds, too, and you should be able to pick up the gems by just moving over them, but I understand if that would make the game too easy.",
      "I like the story at the beginning, very interesting!For the game though, I think it would help if the starting prep area had the UI interactable areas highlighted to more easily indicate what it is the player should be doing at first",
      "It's great to see you continuing with your round one project. I really like how it's progressing and having the birds and then the meteors in space to avoid now is really good. The upgrades to the projectiles are really cool and I made mine super sized. If you were to keep continuing with your project I think it would be really cool if you could teleport the birds when you shoot them and I think when hovering over the upgrade buttons if they were green it would improve it visually. Keep up the great work!",
      "Cool intro.",
      "Cool well thought-out story! Well done my friend!I loved how you collect points with projectiles.",
      "The story was clear and well presented and the teleport bullets were great. I didn't feel like the animals in the game were that crucial. The game is fun and engaging and it was fun reaching the other planet.",
      "This was a fun game! The camera was zoomed a little too close for my liking, making a lot of the dodging obstacles very hard (especially with the speed upgrade). Otherwise, great job!"
    ],
    "comments_posted": 9,
    "created_at": "2025-02-13 03:09:53",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3234273",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/kiritoj22",
      "member_since": "28 December 2024",
      "posts": "43",
      "topics": null,
      "followers": "3",
      "following": "1"
    }
  },
  "3324422": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "frib",
    "game_title": "Fetch",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 23,
    "comments_received": 22,
    "comments_raw": [
      "You really brought me to tears.",
      "its a perfect execution for the tasks great job. I wish overwatch hired you for the jiggle physics",
      "Dang.  I called it pretty much right away on where the story was going but you still almost had me crying when the dog dropped the ball at the end.  Really excellent way to tell a story and you really nailed it with the prompt.  Incredible job!",
      "Watching the puppy grow, I could tell where the story was heading but I couldn't predict how well it would be presented. Seeing the family's grief and the ball in the dog's mouth was very moving and the changes to him as he aged was good too, particularly when he slowed down. If you were to expand the game, I think it would be cool if the garden shows the passage of time too",
      "D:",
      "I wasn't ready to be this sad ð\u009f\u0098­",
      "Meanie head. You get 1 star for every tear I cried. Which is zero. Because I didn't even cry at all. 10/10.",
      "10 / 10 cinema. Well done my friend! :D",
      "Great story! I love the tiny details in the storytelling - the NPC looking at the ball, you getting higher, and the dog moving slower as it gets old.",
      "I will never forgive you for the tears you injected into my eyes ;_;",
      "A fantastic game. The story was good and well presented and the mechanics fit the round's theme very well. Well done!",
      "So sad. Well done. ð\u009f\u0098¥",
      "This is so emotional right from the beginning, the music kinda revealed where it was going but then I started to think about my own previous pets and just cried when throwing the ball one last time. What a soul purifying and destroying experience. You really nailed the storytelling part (and also the other parts), what a genius masterpiece. 5/5 game in every category but I'll never want to play it again.ALSO the way you tell the story via simple gameplay works really well, it reminds me of Edith Finch and some of the minigames there, especially the baby bath and swing ones. Don't know if you've played it but had to mention.",
      "There's not much gameplay but the story is quite touching and it manages to address every part of the criteria decently well. I found the story to be a bit predictable but it was still enjoyable and kept me playing. The customization options were surprisingly robust. Sometimes the dog would run in a circle around the ball instead of picking it up for me which doesn't seem intended but other than that I didn't run into any bugs. Overall, good job!",
      "Thank you! I wasn't quite sure how to handle growing up, because I want players to self-insert themselves into the story for maximum emotional damage. Doing it like this felt like a good way to do it without eating up too much development time, so I'm glad to see that it's appreciated :D",
      "Damn, out here trying to make a grown man cry. Perfect entry for the story round. Well done!",
      "I'm ugly-crying right now. What the hell is wrong with you?",
      "I'm ugly-crying right now. What the hell is wrong with you?",
      "A very moving game. Well done.",
      "Wow!",
      "Impressive, too emotional. You get all the stars from me. :O",
      "I immediately knew where this was going, still played till the end. Good job!"
    ],
    "comments_posted": 30,
    "created_at": "2025-02-13 22:18:26",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324422",
    "coolness": 32,
    "participant_info": {
      "profile_url": "https://itch.io/profile/frib",
      "member_since": "06 June 2016",
      "posts": "341",
      "topics": null,
      "followers": "14",
      "following": "1"
    }
  },
  "3324293": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "simoncb",
    "game_title": "Fetch Quest",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 26,
    "comments_raw": [
      "This game, by far, has the best story I've played yet. The art style adds such a pleasant feel, while the audio is just so calming. The only real complaint I have is that I didn't know you can throw the ball until I read the description. Fantastic work!",
      "",
      "Amazing work. This is undoubtedly one of my favorite games from this round. The storytelling, the art, the animation, everything comes together so nicely.",
      "You had no business making me this sad :( . This is the type of game I would pay to play. The music, the graphics, the gameplay, the polish - everything. This game is so well made. One of my top 3 in GDKO round 2",
      "This was a really nice game! It made me dreadfully sad but the bit at the end when you get to say goodbye was a nice touch. Wonderful work!",
      "Love the title art and the begin screen, very stylish.",
      "Sorry, I already suffered through one other entry that was a tragic dog story, I find such topic to be in bad taste for a jam game and with currently having a dog I don't want to think about such things. I cannot play this, though looking at screenshots I'm sure you did fine work. Same like with the other game, I will not rate, which is only fair as I did not play it, but thank you for playing and rating mine.",
      "This was such a touching story - we've had to go through grieving for our put a couple of times and it never gets easier. Everything in the game worked very well together!",
      "So sweet TT________TT",
      "I instantly saw this story coming from the first moment as it was nearly exactly the same as my first idea for a game. I think that makes it all the more impressive that I was the most moved by this compared to any other story so far. Being able to play with the dog for a bit and then choose to move on really brought touched me, probably partially due to the loss of my own dog a few years prior ð\u009f\u0092\u0095. I think the projectiles were a little underused as I only really used them in one level and a little bit in another one. The atmosphere was fantastic and I loved talking to the NPCs and the little quest, although it was a small addition it really made the world feel that much more alive. I only had one or two bugs, the first level's elevator didn't go down for me for awhile and I thought there was something I had to do but I just didn't trigger it somehow. Great job but I don't think I can handle anotheroop the dog's deadgame.",
      "Absolutely loved all of this game. No notes from me, really great game!",
      "This game had such a fantastic atmosphere and the narrative aspects were top tier.  Great entry for the story round.",
      "Another fetch game :D",
      "The Narrative component and platforming of this game were really polished, I really liked the vibe/aesthetic you created and the way the themes of loss were handled. The flash like graphics of the characters along with the music gave a really nostalgic feel to the game which sort of drove that even deeper for me, beautiful entry to the jam!",
      "This was great! You definitely took the storytelling prompt and cranked it up to 11. Wish there was more tennis ball mechanics. Definitely the core of the projectile imo.",
      "This was great! You definitely took the storytelling prompt and cranked it up to 11. Wish there was more tennis ball mechanics. Definitely the core of the projectile imo.",
      "",
      "The way the story unfolds through the different characters is really good and I like that it's also a personal story for your dog Mako. The bouncy ball as a projectile that also returns is a fun weapon against the creatures.  For feedback, I think the throwing animation could be improved. Seeing the dog at the end and playing fetch with it was a nice way to end your game",
      "10/10 would play fetch with the big doggo again",
      "Did not play the game yet but this thumbnail immediately pulls me in ð\u009f\u0091\u008d",
      "Got goosebumps!",
      "Such an amazing experience. You did a great job on this one, im really glad i played it <3",
      "Amazing game and I love the art. The pacing was a bit slow as in speed of everything, especially with the platforms I would often reach the second one but just not in time and had to wait. Just offsetting the platforms a bit so you can reach them easily in time wouldve helped. Other then that I love the story and the art is just amazing! gj!",
      "The graphics are very pretty. The platforming is simple but effective, with the caveat that in some of the moving platform sections it was all too slow just waiting. Also, I liked how the ball bounced and it was meaningful at the end (no spoilers) and I know I could use it on some enemies (but not others for some reason), but I wish the projectiles had some more use. Also, the prompt was for the animal to be part of the gameplay. You made it part of the story. Still, a great entry.",
      "Simply brilliant!  I think it's my favorite game so far.  Amazing story and storytelling.   The pacing throughout was great for me and it matched the story.   I adored the look of it.  The music was fantastic, as was the ending (sweet and sad).   Also, such a perfect title.  If this isn't in the top ten I will be very unhappy.",
      "Excellent game ! You did a great job telling that story."
    ],
    "comments_posted": 41,
    "created_at": "2025-02-13 21:16:19",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324293",
    "coolness": 52,
    "participant_info": {
      "profile_url": "https://itch.io/profile/simoncb",
      "member_since": "08 April 2015",
      "posts": "265",
      "topics": "1",
      "followers": "14",
      "following": "10"
    }
  },
  "3320154": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "googlypoo",
    "game_title": "Fortune's Toil",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 14,
    "comments_raw": [
      "I liked it a lot! Well done! :DTho I sometimes got stuck when throwing the dice, if I released to far up, I would click out from the game, when I click on the game again, the dices are stuck and I'm not able to do anything",
      "Very, very cool battles!  Nice touch with literally hitting enemies with the dice.",
      "This is one of my favorite games in the jam.  I love the dice and the multiple ways we can use them for combat.  Lots of cool strategy to work with here.  I liked this a lot and I really hope you get to continue it.",
      "Ok this is a gem. Cool story, neat dice combat mechanic (and I love that the dice physically hurt the enemies lol) overall pretty solid! I did notice that half the level doesn't seem to have any colliders, but it's not a problem since you can just choose to not walk through walls.",
      "Love the art and the writing. Love me some Greek mythology.",
      "This was one of my favourite story driven games in the jam. Loved the general vibe and the writing was very well done. I enjoyed the game mechanics as well, think you've made something you should be very proud of! Great job!",
      "Excellent concept ! The damage on throwing dice is a really cool idea. Very fun, congrats !",
      "Pretty good concept, throwing dice was never this fun!",
      "What a mean rabbit.",
      "Really cool game! The y-sorting and collision didn't seem to be working sadly and I had to restart after trying to roll my dice. I think that the dice as projectiles were really cool and the animal was worked in very well. I think the battle music could have had a slightly longer loop as I found it quite grating after a bit but that's small criticism. Everything worked really well together and I think you did a great job!",
      "I really liked the dice throwing as the projectile mechanic and the story was great and engaging.  I liked the die mechanics as well, they were really fun. Great game!",
      "Dude, well done. I have things that are \"wrong\" but everything about this is incredible. I can't wait to see what you do in round 3!",
      "I love the story and gameplay. Using rolling dice as projectiles is very creative. There are some slight issues in the world map - the y-sorting isn't working properly and some borders have no collision.",
      "Neat and just my type of game. Itâ\u0080\u0099s a nice expansion on your round 1 game. I get Dicey Dungeon vibes from playing it. Just needs a bit of sounds effects and battle effects to start making the combat feel really good. Great job."
    ],
    "comments_posted": 20,
    "created_at": "2025-02-13 06:51:39",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3320154",
    "coolness": 26,
    "participant_info": {
      "profile_url": "https://itch.io/profile/googlypoo",
      "member_since": "31 July 2016",
      "posts": "51",
      "topics": null,
      "followers": "6",
      "following": null
    }
  },
  "3324989": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "creative-liberties",
    "game_title": "Freedom Frogs",
    "platforms": [
    ],
    "rating_count": 7,
    "comments_received": 5,
    "comments_raw": [
      "I liked the concept a lot. Using the tongue as the hookshot and shooting flies as the projectile was great and fits the mechanics challenge. I felt like the story was a little light but the game was fun. Well done!",
      "It's a shame that you weren't able to finish this project, I really see the potential for a great game here in the style of UltraKill or Neon White.",
      "I want to see what happens next! This is such a cool concept, and I can't wait to see what happens next!",
      "I like the idea and the ninja frog mechanics - actually, I think this would've done really well during the first round, game mechanics & progression are both well implemented! So I'm happy you managed to publish this even tho you were busy. Okay but a funny story: I noticed that for some reason I acted as I was playing a fps game and tried to reload my gun by pressing R. That of course didn't reload anything but instead I ended up resetting the level multiple times :') I have played too much Marvel Rivals lately, I think.",
      "I can see where you were going for. Unfortunately the controls are very unresponsive. :("
    ],
    "comments_posted": 0,
    "created_at": "2025-02-14 00:48:33",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324989",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/creative-liberties",
      "member_since": "29 December 2016",
      "posts": "29",
      "topics": "5",
      "followers": "109",
      "following": "17"
    }
  },
  "3308389": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "mooltidude",
    "game_title": "Gekkonen",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 12,
    "comments_raw": [
      "This game reminds me of the flying levels in Cuphead. I think you took the prompt to heart with the story, too. Great job incorporating that.",
      "I'm impressed with how much story and how many characters you created with this.  The flying and shooting is fun, but I do wish it was a little slower and I could see a little further in front of me.  Still, this was a fun game that met all the requirements.",
      "I really like the amount of depth you put into the story!  The intro story and characters were really great!",
      "did you write a novel or make a game? j/k just felt like there was more time spent reading dialogue here then playing the game game play was alright seemed a bit to easy to me though. great aesthetics though  kinda felt like i watching amazing world of gumball.. i honestly started clicking through the story once i figured out how long it was...but im sure it was a good story started good anyways. just adhd really started kicking in about halfway through the 2 cutscene.",
      "I love the aesthetic of the dialogue and the transition to 3D during gameplay. I'm very impressed with the gecko model in particular.",
      "More people should talk about this game. I will make my kids and nephews and nieces  play this if i every have any. Great story, fun game, while the final boss fight was a bit tough for me, I loved this game, probably one of my fav entries.",
      "The story and characters were amazing! You have a real talent for writing engaging dialogue - the shmup sections between dialogue sequences was a great change of pace as well.",
      "Awesome job with the narrative. The character's designs were very good and the shooting sections were fast paced fun. Love the genre mash up. Good job!",
      "Insane attention to detail in the narrative and a quirky cast of characters,  a bit of a bullet hell in the last round which made for some fast pace action, will have to come back and see how it plays out if I choose the differing narrative options! Cool stuff!",
      "Well done making the game and the story!",
      "Interesting take on mixing visual novel with a side scrolling shooter. Fun game.",
      "This was a fun game! I see what you were trying to do with all the different characters, but it made some points of the story confusing. I had to write down everyone's name and role to figure it out. I also wish the plane scenes were zoomed out more. Being that close in made it really hard to dodge enemies. Otherwise, I love the concept, and hope there's a sequel on the horizon!"
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 09:51:57",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3308389",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mooltidude",
      "member_since": "06 November 2021",
      "posts": "16",
      "topics": null,
      "followers": "5",
      "following": "6"
    }
  },
  "3319404": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "goatblob",
    "game_title": "Glorpo's Parakeet",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 10,
    "comments_raw": [
      "Absolutely love the opening scene - great animations and voice acting - really awesome.  I even really liked the game play, but it was too hard.  The countdown timer killed me over and over again.  I really wish you had difficulty levels here (which I think would be easy to implement - just change the countdown settings).  Luckily, I was able to skip levels when I got stuck.  I do hope you get to continue this as I would like to play a much easier version again.",
      "Very cool :) I was very bad at this but I think was pretty awesome all the same :)",
      "great story, art was pretty good the controls as unique as they are wasnt the greatest.",
      "The story part of this game was sublime, the art and how everything worked together was perfect. I'll echo some of the other feedback and say that the controls weren't the easiest thing to get to grips with to say the least. I feel like if it was a little easier to control the drone this game could be right up there with the best in the jam!",
      "Amazing opening cutscene. Absolutely cursed gameplay. Glorbo has been avenged. You're next.",
      "An interesting game, it was fun. But why is turn left the button on the right, and turn right the button on the left? Loved the cutscene, but the levels were more about fighting the UI and controls than it was solving puzzles so it wasn't really my thing. Well done game though despite it not being a fit for me.",
      "The cutscenes and voice acting are amazing, the parrot impression is 10/10. But controls... I hate them, just simple WASD would be great, I could not pass the level 2 or 3 where are the first corners appeared, UX is like 0/10",
      "I'm so impressed, by your story and gameplay! How did you manage to make soo many levels! :D",
      "This is a cool concept! I love the mystery and the birb. I think what the issue with difficulty comes down to is that you expect very precise movements with a very imprecise controller. This feels like a cursed issue where you want some imprecise controls to make for interesting gameplay, but then the difficulty of designing interesting levels with that restriction is huge.",
      "Very great cutscene and amazing voice acting! You have so many interesting shots in a short cutscene. The game is still quite difficult, but I'm glad that I can see all the levels even though I had to skip some levels. It's quite impressive to have made so many levels. I really like how you trigger the ending by shooting the projectile."
    ],
    "comments_posted": 4,
    "created_at": "2025-02-11 20:00:31",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3319404",
    "coolness": 4,
    "participant_info": {
      "profile_url": "https://itch.io/profile/goatblob",
      "member_since": "15 January 2017",
      "posts": "77",
      "topics": null,
      "followers": "3",
      "following": "2"
    }
  },
  "3308228": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "loten",
    "game_title": "Hexes and Honey",
    "platforms": [
      "web"
    ],
    "rating_count": 29,
    "comments_received": 22,
    "comments_raw": [
      "Just here to drop off a well-deserved full five-star review!  My only complaint is that healing cards took off so much poison that my full poison strategy occasionally meant watching my opponent heal much faster than I could do damage.  Excellent game!",
      "This game was my jam (and honey)!  I loved it!  Seriously, probably my favorite game in the jam so far.  Loved the style (art, sounds, music, story, etc).  It was all so polished.  And the battling was really fun.  I only won 3 of the games, but I still loved it.  I expect this to be in the winner's circle and I want more of it!",
      "Absolutely great game that fits the challenges of the round. Loved the card game mechanics and picking the cards to use in the deck. Good improvements from the last round. Very fun, well done!",
      "I played a few times with different strategies, and each time I discovered new things. I think your game is awesome. The artwork is absolutely stunning and I especially love how the bees come at the end, and the little tail wag from the dog is just adorable. The polished feel and the ability to play against other players setups is totally amazing. This is definitely one of my favourites of the jam",
      "What a masterpiece! I can definitely see myself playing more of this, good job!",
      "Healing meta OP, pls nerf :D managed to snag the first place score on the arcade leaderboards with 117 gold",
      "I died a lot :)",
      "Do bees count as bugs?",
      "People say that the sequel isn't as good. They lied. This was great! Everything I loved about the first game, plus extra mechanics. I also love the idea of taking people's previous builds and facing off against those. I bet some lucky player is excited for an easy victory against my builds lol.",
      "Great work improving your game! It's very polished and fun to play!Tho I was pretty bad at it this time :P",
      "Was great to play on stream and have you there!",
      "I honestly don't what more to say other than... goddamn that's good",
      "The gameplay in this one is incredible. I didn't get to this in the first round. I'm going back to play it again after writing this ð\u009f\u0098\u0084 I'll try to get into the top 10.",
      "Already gave a lot of my thoughts so I'll make this brief. Having the hover over the cards was a really cool improvement, especially since it allows you to take a look at others' builds. I feel like healing was a little overpowered or at least just not fun to play or play against personally, I like poison a lot and healing directly countered that which is probably part of the reason I dislike it. I will almost certainly come back and try to top the leaderboards, great job!",
      "An incredible improvement from Round 1! I really enjoyed both the card and upgrade variety. All the visuals are fantastic, the music on point, and the gameplay is enjoyable to watch! I'm not sure how much strategy is involved in card selection, but overall you did great! I hope to see a full version of this game someday.",
      "I am enamored by the visuals of this game!",
      "This game makes me want to try all the synergies. I tried damage build and poison build but both did not get me to the top 10...",
      "Loved the game and story! The UI looks great and the art style is appealing. I feel like there's a slight balance issue. I can't cause significant damage to the enemy even though I'm using a lot of damage cards. So the best thing I can do is pick all shield and healing cards and wait for the bees to kill the enemy.",
      "Thank you for the awesome game, Loten. I loved it. It took me a lot of mental strength to prevent myself from playing it while I was supposed to be working on my own game!",
      "The art is great and the cutscenes are really cute. I am still a little confused with what is going on and most of the time I am just staring without knowing what to do. What is the bottom orange bar? Is that for the bees that come? Why? What are the 3 different numbers in the health bar. What are the 5 boxes under the names at the top? Is honey the gold? What does it mean when a card buffs for â\u0080\u009cone turnâ\u0080\u009d? What is â\u0080\u009cone-turnâ\u0080\u009d? There are lots of cards may be, some basics about the cards could be added in the game page. Also, I cannot tab-out of the auto-battle as it pauses as soon as the game loses focus. Maybe add an option to speed things up? Also, is it really multiplayer? When I see someoneâ\u0080\u0099s name, is that a deck someone used? Is that someone online right now? Can I chat with them?",
      "Good Job! I only had some enemies, that apparently had the strategy of only choosing healing cards so the bees take out the enemy. Still a great game!",
      "Why are there so many sad dog games in this round?"
    ],
    "comments_posted": 21,
    "created_at": "2025-02-12 01:44:58",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3308228",
    "coolness": 42,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "232",
      "topics": null,
      "followers": "24",
      "following": "7"
    }
  },
  "3243315": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "foozlecc",
    "game_title": "Hold My Wand GDKO Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 13,
    "comments_raw": [
      "I loved this game soo much! I don't usually play these types of games, but I loved the gameplay.",
      "I agree with comments below that progression feels a little slow. I wonder if the projectiles are locked behind some upgrade I did not get, but I didnâ\u0080\u0099t really see them. How do I increase the quest level? Also, sometimes enemies spawn far away and it takes a while to even run into anyone, maybe add a minimap or some pointer towards where they are?",
      "I just spent waaaayyyy too much time laying this... in a good way :)",
      "Very promising game ! I'm dying too fast, though )))",
      "Great story and images to go with it.  Also, whoever did the voice narration did a awesome job - it sounded fantastic!  As for the actual gameplay, I am so impressed with what you are creating here.  It feels like most of us are creating tiny little games for the jam, but you are at the beginning of something truly epic.  I'm really impressed with what you've packed in already and can't wait to see what you do with it next.",
      "I have to say I REALLY loved the story.  When I saw 4-5 minutes for the intro I was gonna skip immediately but it really dragged me in!  The game is also very good, though I'll agree with some of the other comments that the size of the skill tree is pretty intimidating.  Rating a game jam game it's always hard to feel like there's more game than I have time to experience.  What I did experience is really solid, though!  Good job!",
      "seemed a bit much for a game jam...just feel like if you maybe if you made it shorter with faster progression. that tree im assuming skills tree at the beginning was super intimidating  and the story was to long to watch all the way through which you do warn at the start that it was long. it just feels like you missed the most of the objectives just by over doing not necessarily a bad thing but i cant even judge this game because simply who has the time when there is 60 other games to play..",
      "I wanted to play more, but the progression feels sloooow. Anyway, pretty good gameplay and upgrades!",
      "The updates from last round are all good, but there's still too much for me to be able to make it far in this. I spent about 45 minutes and upgraded a lot but I have to move on.",
      "I really love the premise and the story and would totally want to see this being continued so hers a few issues I had;",
      "The visuals for the intro cutscene are excellent!",
      "Who did the voice acting? Is it AI or did you hire a professional?",
      "Once again, a great game! I wish that you could upgrade things a little faster though. With such a large skill tree, I'd have to play for hours to get any significant upgrades. The story, which was great btw, was a little too long to be right at the beginning imo. I think if you put one scene every time the player returns to the tower, it would both encourage longer play sessions, and make the story more interesting since you're playing through parts of the story."
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 22:38:02",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3243315",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/foozlecc",
      "member_since": "13 January 2020",
      "posts": "232",
      "topics": "4",
      "followers": "1,873",
      "following": "52"
    }
  },
  "3295937": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "pierotechnical",
    "game_title": "II Stone II Seeker",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 26,
    "comments_received": 24,
    "comments_raw": [
      "Well done :) I really enjoyed this.",
      "This is a gorgeous looking game; such an incredible upgrade from the first round.\nSmall comment, when I was in front of the lever and the drawbridge, the â\u0080\u009ccageâ\u0080\u009d was not evident to me. There is some box at the other end of the room and I tried shooting at that, hadnâ\u0080\u0099t seen the â\u0080\u009cother cageâ\u0080\u009d in the air.",
      "This looks great & the story had my interest. It felt like you were just getting started and I'd love to see more. You've hit the projectile and animal criteria right on. The bow feels wonderful to shoot.",
      "Damn!  That was incredible!  Seriously, I dream of making something that good looking one day.  I couldn't believe how well it played in the web browser too.  Obviously, it still has some work to do: sounds, music, enemy ai.  But, what you have so far is terrific.  This better move on, because I want to play more of it.",
      "Just great! Looking forward for a full game if keep working on this <3",
      "First of all the environment and visuals are AMAZING. The visual style is so clean and pretty and the lighting was done very well too. I think that the requirements were addressed very well, the animal was fun and cute and the projectiles were also useful. I found the story interesting but it led me more to want more of the story rather than feeling like a complete narrative. This is an issue I have with several of the games continued from round 1 just because they weren't built initially with a story in mind. I liked the skill tree from round 1 and was a little bit sad it wasn't present, but I still enjoyed the combat more even if it was just the cooler enemies and fun ragdolls. I may have imagined you saying that there were going to be drop assassinations but I think that would be incredibly cool. I still dropped down on enemies to attack them anyway and that was pretty fun. I wish that the bow was a bit more useful for combat as it felt significantly worse than the dagger even if it just had no knockback. With the daggers knockback you weren't really punished for getting close to enemies anyway so there was no reason to stay far away. Overall, amazing job, hope you continue work. (:",
      "I wish this game had audio :D it's very enjoyable, love the artstyle and while the gameplay is a bit basic at the moment, it has so much potential. But I'm a sucker for first person games like this, so don't listen to my complaints :D  Storytelling was nicely done even without audio. Good stuff!",
      "Very well done! I loved everything about this game. I think you nailed the task and all the required extras, well done!",
      "I still remember your first version of the game and while it was more like an alpha build, this felt like an actual demo. I'm impressed how you managed to build this good-looking and -feeling 3D-game in the given time window. The story was also interesting and dark, the crow is awesome and I kinda want to know more about what had happened.",
      "Was great to play on stream! Thanks for submitting, and sorry for the timezone! Please feel free to watch for comments there (around 02:00:06)",
      "I love the outlines on the 3d models, this game has a very distinct style that i love, great job this feels like am entirely diffrent game than r1",
      "The story and visuals are amazing. I completed the game 2 times to make sure I didn't miss anything. I didn't find a way through the locked doors so I might have done though. I thought the key would have been past the rafters but it wasn't but I liked exploring the levels. It's cool how you can jump on the chandelier, crawl through gaps and use a bow and arrow to shoot skeletons with and that last guy looks incredible!",
      "This is a fine entry that takes on all three of round 2 conditions without holding back on any. It was enjoyable sneaking around and trying to gather pieces of the story. Btw that's some high quality outline shader as far as I can tell (I'm not very knowledgable on shaders) is it or code it is based on available online?",
      "amazing graphics and atmosphere, by far my favorite part. looking forward to future updates if there are any planned. great submission!",
      "I am surprised it is running in my browser :D great job on performance optimizations!",
      "Stone Seeker 2 crow is my new best friend.",
      "Perfect game for me! Especially loved the visuals and the secrets :P",
      "My guys out here making a game with AAA graphics for this game jam. Fighting mechanics really solid (sword and bow), the platforming felt nice as well. I had to really pay attention to the subtitles with the lack of sound but I can understand and see where most of your time went whilst making this submission. Honestly feels like if you fleshed it out you could have something truly special on your hands here. Keep going! I want to see where you take this in the later rounds.",
      "",
      "Great game with amazing visuals and an interesting story! I like that the game is a flashback and the ending links back to the start. The battles felt a little dull since you can't take damage at the moment, and the game is a little heavy to run in the browser.",
      "I love crows so damn much. It's always nice to see a 3D Project in a Game Jam. I had a small issue with the bow, it sometime would hit the skeleton and not deal damage. It would've been nice to see the coins and potions end up doing something, but I assume there are plans for Round 3. It's overall a great start the I really look forward too!",
      "Its a solid game. I had some issues with the enemy AI for some reason when I shot them with my bow from a distance they got stuck and wouldnt attack me anymore. same with the boss I could just go behind him and one tap. I like that you free the animal but personally I wouldve liked if the crow was a bit more involved trougout the story.Solid gameplay tho and fun overall good job!",
      "Very fun game! I enjoyed shooting with a bow, though sometimes enemies heads deflect arrows ))))",
      "The environment are really cool, especially the boss room. Good job on bow mechanics !"
    ],
    "comments_posted": 64,
    "created_at": "2025-02-13 09:43:36",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3295937",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/pierotechnical",
      "member_since": "28 August 2017",
      "posts": "477",
      "topics": "2",
      "followers": "48",
      "following": "47"
    }
  },
  "3324988": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "killacook93",
    "game_title": "Iron Dawn",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 23,
    "comments_raw": [
      "Visuals are really cool. This remind me of the good old time of rail shooters. Did not fully understood the dialog at the beginning and a bit too much of story at the beginning. But overall very fun idea, curious to see more !",
      "I love rats but not these one! Fun game!",
      "I absolutely love rail shooters.  Once we got into the game, this was really fun.  As others have mentioned, the scroll is too long, but that's an easy fix.  Definitely keep it - it has a cool retro vibe (just tighten it).  Also, I dig the narration, but I did have a little trouble understanding all the words, maybe have a \"subtitle\" option.  But the main part of the game, the shooting was so much fun and took me back to some of my favorite old games.  One last thing, my images don't look like your included screenshots.  They all felt a little washed out and grey.  I am on an Apple laptop and tried it on Safari and Chrome.   I am attaching an image so you can see what I mean.",
      "Very cool rail shooter",
      "This game looks really nice. I think this could become great with a couple tweaks and Iâ\u0080\u0099d like to see more. A couple comments:",
      "A lot of people have mentioned wanting to move faster through the story but I actually didn't think the scroll was necessary. With the cutscene at the start and a few more clues maybe spread throughout I think it'd be more interesting to piece together the story yourself. I've never played a game of this genre before but I thought it was pretty cool. There wasn't much variety but I think the length was just right and it didn't drag on. I also appreciated the visuals although I think the UI could use some more love. I think the criteria were addressed solidly and that they came together pretty nicely. Overall, well done!",
      "I really enjoyed this. The 'on rails shooter' genre doesn't get enough love. Good Job!",
      "Love the silly one-liners :D",
      "A cool synthwave-supported intro leads us into a game that might have been a doomed side experiment of some legendary director such as Paul Verhoeven that got canned early in development and so it feels like a leaked relic for collector's delight. The shooting is actually fun, and I wouldn't mind if you artificially prolonged it, though giving the ability to replay is nice as well. I get this project was more ambitious than what it might seem so you were pressed for time, still an impressive amount is achieved. While the narrative is presented only in intro, the game has enough traces of it contained within itself (the voiceover and the setting with rats) that it shouldn't be much of a problem.",
      "Loved the story and the sounds.",
      "I think I'm giving this game top marks because everything worked together real smooth and it was bug free for my playthrough. I wish there was more because I really liked the gameplay. Great game!",
      "This fits the prompt to a tee. Reminds me of the House of the Dead :) Awesome entry.",
      "I love this, its not a typical game youd see people make during a gamejam. I would suggest some quality of life changes like being able to scroll faster trough the intro story (its a good story but I rather read and not wait) and the rat dying animation comes a bit too late so at the start i shot 3 bullets whilst only 2 were needed. Other then that it fits the task and its really original keep it up!",
      "As others have said thisreallyreminds me of one of those arcade games with the gun controllers that always got broken. Good thing you can't break this one! I appreciate you giving the ability to quickly replay the level after completing it. It was fun to replay and get 100% accuracy. Can't forget the voice clips that play after every section too! Really added some extra life to the game. Overall extremely impressive game!(Also, rat buddies!!)",
      "I finished the game and loved the inspirations behind it. Your game is a ton of fun. and I really hope you continue development because it's fantastic! Here are a few suggestions to make it even better: The bullet text was a bit cut off and perhaps an image of the six bullets would look nicer.  Being able to adjust the story text scroll speed with the left and right mouse buttons would be great.  Headshots could one-hit kill rats, and maybe add some interactive background elements just for fun when not busy killing rats.  Great job on this one!",
      "",
      "Great story with very cool visuals! This type of shooting game gives me a lot of nostalgia. The voiceover in the cutscene is a little bit too muffled and hard to understand.",
      "Really cool! I love the dithering effect, and the PSX style shader on the rats. The voice acting was a nice touch.",
      "The intro scene took a bit too long, the black screen took forever.",
      "The vibes are immaculate in here. Great job! For an on-the-rails-shooter, it was a little easy, but I can only imagine the length of time it takes to set up each scene.  I can't wait for the sequel.",
      "Good job on your first 3d game :) I had fun playing this, wish there was more content, but i fell you. I also didnt have the time to finish everything.",
      "Rare genre you have there! The world needs more rail shooters, I think.",
      "A cool idea! I loved the story at the beginning, but my voice lines once I got to the facility were glitched and kept cutting themselves off. Overall the gameplay and atmosphere were so cool though! Made me feel like I was in an arcade."
    ],
    "comments_posted": 44,
    "created_at": "2025-02-14 00:46:23",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324988",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/killacook93",
      "member_since": "05 July 2023",
      "posts": "99",
      "topics": null,
      "followers": "7",
      "following": "6"
    }
  },
  "3324982": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "teezaboo",
    "game_title": "JUMP CAT",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 12,
    "comments_raw": [
      "Very cute cat sprite and animation. Animation before the jump is adorable!",
      "Adorable story at the beginning with great images.  I like this cat and I want to save this bird, but jumping is really hard and I'm terrible at it.  I kept missing the platforms, falling  down, and having to start all over again.  I wish there was an easy mode.  I would love to see someone better than me play this game, as I would love to see the ending.",
      "I love the art style. The AI narration was a bit jarring for me but other than that I really loved the story slides in the intro and the ending. You did a really great job setting up the relationship between the cat and his bird friend.",
      "I really liked your art and style on this one!  The jump mechanic was a lot of fun but also a little hard to control.  I'd recommend maybe showing more of the trajectory or having the trajectory oscillate instead of just increasing so that you can still make a jump even if you mess up a little at first.  I also think it can be a little risky with the criteria to have a \"projectile like jump\" and use an animal as the main character, but that's more of GDKO technicality advice for next round.  This was a great game overall though!",
      "First of all, the cat is really cute. The jumping took a bit to get used to and even once I did the aiming felt a bit slow. The story was cute and I can't help but notice that our good/evil bird designs look incredibly similar. Great minds think alike I guess. I found the difficulty to be a bit hard, and combined with the fact that there are no changes to the map or indicator of how high you are I had to stop playing. I may come back to finish this to get the full experience but I'd like to rate as many games as possible so I don't have the time for that at the moment. Bouncing off of walls was kind of annoying but I grew to like it, however I feel like it may have been a bit much and the incredibly high amount of sliding you do after bouncing off a wall versus landing squarely otherwise felt a bit unintuitive. The intro at the start was very cute and a good way of communicating the story although the voicelines felt a bit dissonant with the tone of the game. Overall, I enjoyed playing it, well done!",
      "The jumping was interesting and took me some time to get used to. Fun game.",
      "Very jump king energy. I liked it! Well done",
      "Love the opening intro! Though I think it would be better without the voice to go with it. Its a bit dissonant with the tone of the cutscene and the other sounds/visuals.",
      "Awesome cinematic intro, got me invested! Well done!",
      "The cat's sprite is so ungodly cute. The movement felt a bit rough around the edges, but regardless the art is so good I don't even care.",
      "Very fun but tricky game. Good Job.",
      "â\u009a ï¸\u008fPlease refresh the page once if an error message appears on the first playâ\u009a ï¸\u008f"
    ],
    "comments_posted": 0,
    "created_at": "2025-02-14 00:53:37",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324982",
    "coolness": 1,
    "participant_info": {
      "profile_url": "https://itch.io/profile/teezaboo",
      "member_since": "21 July 2023",
      "posts": "259",
      "topics": "16",
      "followers": "14",
      "following": "1"
    }
  },
  "3230447": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "drillmonttv",
    "game_title": "Lava Leap",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 15,
    "comments_raw": [
      "This was a good entry!  Solid little game, and you did a good job adding in the elements for the round. One tweak I'd recommend would be to slow down the fire rate for the stun gun a bit, since if you got hit once it was really easy to get stuck for a long time.  One other thing I'd recommend just for rating purposes is to have the projectiles and animal show up earlier in the game.  In a jam like this there's always a chance that someone isn't good enough at your game to reach the boss fight, so someone could get partway through and think \"I didn't see any animals\" and dock you points.  Great game overall though!",
      "The game itself was really good, the platforming mechanics were awesome and it felt awesome to play. Got into a real flow state jumping up the map and you nailed the main game loop. I didn't come across any bugs during my playthrough. You had a story and you added in a cool animal boss fight at the end. No real criticism other than some of the sounds were a little loud for headphone users, you could maybe look at tweaking them and making sure the main game music is at the same level of loudness as the boss fight, it made me jump! Overall you did a great job. Well done!",
      "This was one of my fav entries from round 1. But I am not sure if it very well aligned with the criterias as much as I would have wanted it to be especially with the projectile, although it is somewhat aligned. And yes this game is free from bugs (at least I did not come across any). Escaping the lava was fun !",
      "Good additions to the game from the last round. I appreciate the space to jump as well as the w. Fun game with a story. The projectiles and animal were all there, good work!",
      "Love to see this project working its way through the ranks! I appreciated the ability to read through the story elements at my own pace. The platforming has come a long way since last round as well! Can't wait to see what's next for you.",
      "That was a fun. I think you've a got in interesting idea overall.",
      "The platforming feels good, but I'm getting a lot of lag hitches when playing it in my browser that makes me miss some jumps.",
      "Ah, I remember playing this in the first round. What a fantastic improvement! I absolutely adore the extended game loop of managing your moveable platform, whilst trying to outrun the rising lava. The enemies didn't add all that much, but the boss fight at the end was fairly fun! I understand why you made a big text wall, considering I did almost the same thing, but it's still makes the story feel rushed. You did fantastic!",
      "This was fun. The platforming felt good although I never really felt like the lava was a threat. The story felt a bit shoved into the game as it was just a lot of text at the start which I decided to skip halfway through. I'm assuming the boss was the animal but there was nothing really 'animal' about it. I also didn't really like the boss because it didn't really align with the games mechanics, like the platforming, and it took me two minutes to realize I had to touch it to deal damage as touching enemies is actively discourage in the game. Overall, it was an enjoyable experience, well done.",
      "Fun game but I couldnt play more because it crashes my browser HARD in less than a minute. A bit more from a fresh boot, but it eventually crashes. unfortunately. Anyone else with this problem?",
      "pretty cool platforming, i think you should focus more on visuals but thats a nitpick, also it doesnt effect the round criteria",
      "The platforming were already good during they first round but I feel like the threat of lava really added something to it. At first I thought lava was rising too slowly and didn't really care about it, but at the end I failed a little and was panicking that it would get me. I also like your character art.",
      "The platforming feels great. I made it all the way to the end ð\u009f\u0098\u0081",
      "First, I love to see other C3 Programmers in the Jam!",
      "This was a fun platformer! I wish it didn't lag so much so that I could finish the story. Once I got to level 4, I couldn't continue because of the lag."
    ],
    "comments_posted": 8,
    "created_at": "2025-02-13 16:01:40",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3230447",
    "coolness": 12,
    "participant_info": {
      "profile_url": "https://itch.io/profile/drillmonttv",
      "member_since": "09 February 2024",
      "posts": "66",
      "topics": "3",
      "followers": "8",
      "following": "18"
    }
  },
  "3324956": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "sirmaax",
    "game_title": "Law of Distribution Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 10,
    "comments_raw": [
      "I loved trying to save my dog here, but is it possible to actually save the dog.  I tried a few times, but always died in the end.  Also, I'm not sure what the icons in the corner do.  I clicked on them, but nothing happened.  If you get a chance, add a tutorial to this game - it would help us get more out of it.  I hope you continue to work on it.  Well done.",
      "I'd agree with some of the other comments here that a little could go a long way for this one!  Even if you don't have time to put a tutorial in the game itself, some notes in the description of \"this is what to expect and how to play\" can really go a long way. I really like your game, it also just takes a bit to figure out what's going on and how to play.",
      "decently fun game to play.  not for sure the point of the dog other than to say you put an animal in your game. the was no narrative that i came across in the five mins of play. couldn't find instructions on how to play therefore i couldn't figure out what the symbols on the bottom screen was for...maybe a bit of a story to explain why stars are chasing after me and the ghost dog. honestly thought that maybe the dog would heal me if stand next it but it didnt",
      "An interesting game for sure! Highlight was blasting stars with my ghost doggo while techno blared in the background!",
      "I didn't fully understand how to play, but the inclusion of a manual was a creative and fun addition! I feel like I would understand the building mechanics a lot better if I had more time to experiment with them.",
      "I tried but I had no idea what's going on. Definitely needs some kind of tutorial.",
      "I was a little overwhelmed to begin with, but once I got the hang of things better I started to really enjoy this one. The art style was really cute, and having my poor ghost pooch follow me around was enough to show me the narrative. The game over screen in particular was very well done, epic effect. Good job (:",
      "I remember this game from the first round, and I thought I got the hang of it then, but this time around I feel very lost even after reading everything and trying a lot of different things. I reloaded it a few times, but I was not making any progress. Might come back after I'm done playing and rating the rest. Good work, there's a lot in here, might just need some better tutorials and building descriptions.",
      "I'll be honest, I don't think I'm the intended audience for this game. I can't understand what's going on, even after reading the pdf. I think a more hands on tutorial is needed for this game. As it is, I'm going to try to rate fairly, but I honestly can't tell what the game is about.",
      ""
    ],
    "comments_posted": 1,
    "created_at": "2025-02-14 00:39:20",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324956",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sirmaax",
      "member_since": "17 March 2021",
      "posts": "214",
      "topics": null,
      "followers": "5",
      "following": "2"
    }
  },
  "3324719": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "lozt22catz",
    "game_title": "Life of The Party: R2",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 22,
    "comments_received": 16,
    "comments_raw": [
      "Cool concept, very unique. I think the addition, that the enemy attack is an actual minigame, which influences the game is great. The visuals are something you need to work on, because the pixel density is not the same on the whole screen, this looks a bit weird. Some pixels are bigger than others, and then there are circles which arent pixelated at all. Make it consistent everywhere and it'll look better with not much effort. Still a great entry, good job!",
      "A very unique game, I liked the story you added to the game. Very interesting!",
      "Very cool and very unique game !",
      "Its a cool game with a lot of features so good job on that. I found it a bit hard with the dodging (little tip here make the hitboxes a bit forgiving, I went up and my back touched a spike that already passed barely so I got hit. Adjusting the hitboxes might seem unfair but will feel more fair. Some sprites were missing the wizard (i think) was just a bunch of flags?I do like all the ideas youve made it makes me think of undertale so it could become a real cool game and I would definitly play more of this!",
      "i personally had a hard time dodging the projectiles do to not being able to tell if they were at the top or the bottom and couldn't make it pass the first mission. probably on me though i do enjoy a good d&d game but only coop with my buddies. not for sure if there was an animal in the game at all maybe i didn't far enough sure it had a solid story being that type of game it is. really has potential though..",
      "I love D&D and I think my experience with that game really helped here (as there were a lot of concepts to learn).  I also love turn based games, so I did enjoy this.  And, while it might have been inspired by D&D,  I also thought it was very original with things like dodging the projectiles.  You managed to pack a lot in here for a game jam.  My one suggestion would be a slightly easier and more intuitive beginning and tutorial.  But, even without, I enjoyed this a lot.  Really well done and impressive.",
      "Interesting premise! A bit too slow for me to enjoy but I can definitely see the appeal. I like that there are choices for party composition and loot but I didn't really notice anything special happening with them. They just do their thing but it's hard to see what that thing is, or why it's good/bad. Also, I didn't expect that failing the minigame would wipe the whole party immediately, I wrongly assumed it only influenced spell effectiveness and I didn't care for a 2hp heal but it killed me :')",
      "I love games that add new unique feature to turn-base so I was completly hokked on the gameplay. The familiar is aslo really clever for the animal.",
      "I am pretty bad at this game! hahaha but was very fun",
      "",
      "This is a lot of fun. I like the combat system and everything was done so well. An improvement on the round one game. I think you hit all the marks for the round, well done!",
      "You got lucky since your 1. round game already had very interesting and well-build projectile mechanics :D Nice to see you still decided to develop the game more and didn't just publish the same build twice.",
      "At first I thought \"oh cool, this is dnd inspired.\" Then I realized \"oh wow. This is dnd and undertale inspired\". Love the concept!  I think the power scaling could be reduced a bit. I think 50 health for 1 enemy is probably good, but when 3 enemies have 50 health and my whole team combined has 30, it feels like I'm at a disadvantage. Even with a disadvantage, that's fine, but I felt like I wanted more ways to solve that problem than \"reroll stats\"",
      "I played this previously too. I still like the idea. I would have liked to have the story told differently. Currently it is a bit of a lore dumb. Maybe some bits between fights.I find the dodging phase a bit to easy. Especially when you repeat the same actions multiple times. I would like to see more randomness.",
      "Great work. I love the new additions for this round! Any plans to continue further?",
      "Did you forget to enable 'play in browser'? (Asking since your last round entry had browser support)"
    ],
    "comments_posted": 30,
    "created_at": "2025-02-13 23:28:45",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324719",
    "coolness": 35,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lozt22catz",
      "member_since": "15 August 2021",
      "posts": "115",
      "topics": "1",
      "followers": "8",
      "following": "3"
    }
  },
  "3319975": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "josepvalls",
    "game_title": "Make way for Turboducklings",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 19,
    "comments_raw": [
      "Looooved the story )",
      "I enjoyed this so much. Full marks :)",
      "Love the opening scene - that book animation was awesome and so was the story.  Honestly, this game was so much fun.  I loved it.  I did enjoy the egg shooting more than the rocket propulsion, but both still made for some clever and challenging puzzles.  Really awesome game.  Definitely, one of my favorites.",
      "Excellent story <3 gameplay is pretty fun too. Sad to see that you ran out of time, there's definitely room for more :D",
      "ð\u009f¦\u0086",
      "This is a really sweet story. I love the art style and the writing in the cutscenes. You really played with our feelings there. I wasn't sure whether to laugh or cry by the end of each cutscene.",
      "It was good to see how much you had worked on this from round 1 to round 2, it's coming along nicely. The first level I felt was pretty much perfect, just the right level of difficulty.  The second level felt a bit more unfair, mainly because of how far back the spawn point takes you, it takes a little while to get back into the action and it feels a bit discouraging because once you know how to navigate those first obstacles it becomes more of a chore than fun. The story elements were done very well and overall an impressive and enjoyable game. Great job!",
      "Tried this with my 6 yo grandkid. Level 1 was perfect. Level 2 we got stuck on trying to get to the first duckling...",
      "A cure creative game that was fun. Surprisingly not the only \"birds as projectiles\" game in the round. Good work!",
      "What a cute game! I was a little confused why the ducklings couldn't launch through things when I could. It took me a long time to realize the intended solution to return to the nest on level 2.",
      "Now the controls are excellent! Good job!",
      "I played this in the first round and it's great to see how much more you've managed to add into the game since then. You stuck to the tasks criteria and created something fun. Great job!",
      "Very well done. The story was heartfelt and enjoyable and the book was a nice touch. I wish the text showed up a bit faster or there was an option to skip the animation, I almost skipped the story because I get easily annoyed by slow text (but I'm very glad I stuck with it.) The mechanics were really fun and I had a great time playing. You mention not having time to finish the final level at the end but I wish you hadn't, I felt like I had just had a full experience and that just made me consider what was missing rather than enjoying what was there. Overall, very well done, great evolution from round 1.",
      "WOAH this is so much more polished than r1 loved it good job!",
      "The storytelling in the book was excellent. I enjoyed the challenge of getting all the ducklings to the nest and I made it to the turbo rocket level. While I found it a bit frustrating to be sent all the way back to the nest after touching certain objects, the movement itself felt great",
      "What a heartwarming and funny story! I really like the pool table-like projectiles mechanic. The rocket mechanics are also pretty fun.",
      "Ohhh my goodness!This has to be my favorite evolution of game concept from Round 1 to 2!!!This story had me sooooo emotional, and thats not even mentioning the great mechanics this time round. Terrific job",
      "Had a great time throwing my ducks around! very nice touch with the book to tell the story. great job",
      "A cute and silly game. You covered all of the criteria well. Minor nitpick is that I wish the text moved a little faster. I would not mind seeing more of this game in future rounds, felt like it was just getting started and Iâ\u0080\u0099m wondering what kind of puzzles/levels you had in mind. Great job."
    ],
    "comments_posted": 17,
    "created_at": "2025-02-13 09:22:50",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3319975",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/josepvalls",
      "member_since": "24 December 2023",
      "posts": "584",
      "topics": "10",
      "followers": "30",
      "following": "9"
    }
  },
  "3324767": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "sovereignbagel",
    "game_title": "Maverick and YOU",
    "platforms": [
      "windows"
    ],
    "rating_count": 8,
    "comments_received": 7,
    "comments_raw": [
      "Good atmosphere and an interesting narrative.  Got a bit bored looking for the flowers, it took a really long time. Other than that, the monster popping up from time to time was great and the game was bug free for me. Well done!",
      "It was pretty hard to find those flowers in the dark, maybe scattering them more would help the pacing, unless it was intentional...By the way, never found any monsters, I was prepared for a jump scare haha",
      "I love horror games and was impressed with how well you created an atmosphere. The story was intriguing and good job on the voice acting. The flowers were very difficult to find but that only added to my sense of dread for when the monster eventually got me. The environment was spooky and I think overall you did a very good job. As someone mentioned in the comments below the only real criticism I have was trying to find those damned flowers, I think if you find a way to make them easier to find, you will keep the player more engaged for longer. I think it probably was a design choice on your part to force the player to search them out whilst being worried about the monster, I just think it needs tweaking somehow. Well done!",
      "This is a cool concept! I think the issue with the lighting make the game almost unplayable. It would really benefit the game a lot if the flowers you're looking for (which are tiny and blend into the environment too much) had a dim light around them to make it easier to see. Same thing with the enemy. It blends in so much that I couldn't see it to shoot until it was too late.",
      "The first time I played this, I accidentally press shoot instantly after the game begun and ended up shooting the dog :') For a while I was all like, \"OH NO I'M THE MURDERER\", but after I restarted I realized it was just me spamming the left mouse button a little too aggressively.",
      "I sadly did not finish it. I forced myself to get the first 3 flowers (the last one I accidentally got while moving from the monster), but when I found out there was more aimless searching to be done I gave up.I liked the intro and the voice acting adds character, but I didn't feel that the fact Maverick was an animal influenced the story, Maverick could've just as well been your grandpa and the story (from what I've seen) would've still worked.",
      "Nice work making a 3D game!"
    ],
    "comments_posted": 5,
    "created_at": "2025-02-14 00:07:41",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324767",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sovereignbagel",
      "member_since": "15 April 2017",
      "posts": "53",
      "topics": "3",
      "followers": "27",
      "following": "4"
    }
  },
  "3324872": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "rodrigocard",
    "game_title": "Monster Block - GDKO Round 2",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 18,
    "comments_raw": [
      "I really liked it!",
      "A couple minor bugs aside, this was REALLY something special.  Story, music, gameplay, etc... all really flowed well together!  Great job!!",
      "Today I learned that cows are jerks and will steal your spaceship the first chance they get.",
      "I think the intro cutscene was great at setting the stage. You have a great sense for what you need to show for effective storytelling & strong pixel art. That cow butt caught me by surprise ð\u009f\u0098\u0086",
      "Nice cow! :D",
      "Absolutely love the opening cut scene.  Great storytelling without words.  The image of the cow jamming itself into the UFO was hysterical.   As for the actual game, I love puzzle games like this, even if I'm terrible at them (not your fault).  I hope you get to continue working on it.",
      "Really fun and addicting, given some more time and polish, this could easily be one of my favorite puzzle games. Well done!",
      "Well done! This game was super addictive despite the lose conditions being a bit bugged. It was okay because the game was super addictive and I wanted to keep playing anyway. But yea, great work with the super original gameplay and the funny story. I had a lot of fun.",
      "This was my first time trying this game, and I really enjoyed your unique take on the block puzzle game. Even as a prototype the mechanics and presentation are so polished! I had some difficulty adjusting to the controls but that became easier the more I played. Would love to see where this goes!",
      "The cutscene was excellent, really well done there! The block eating/spitting mechanic was a lot of fun, and it was cool how many blocks you could eat. I instantly knew how to play the game and the visuals were great. I appreciate the ambition of the 4-directional eating ability, and it's technically impressive. However, it made the game feel more complex, and I encountered some out-of-bounds problems with overlapping blocks.  I wonder if a 2-directional system would be better in some ways perhaps",
      "The intro is really cute and the platforming was very fun. The visuals and pixelart are incredibly charming and fun. I think that the feedback for blocks being destroyed could have been a little bit faster and also generally spent a lot of time kind of confused. I wish there was a better way to get out of being buried. The mechanics and ideas are really interesting. Not exactly sure what the projectiles are, maybe spitting out the blocks but they didn't really behave that way. I think the story was cute and the animal was a great addition. There were definitely a multitude of bugs, not enough to make it unplayable but I experienced a lot of stuff clipping out of the map and vibrating blocks. The game was still playable and fun, though, and I love how original the mechanics are. I think having W and up arrow be options for jumping would have been nice too, as directional inputs were already being provided and I would rather use that than another key to remember in addition. Overall, the game was very polished and cute, well done!",
      "I'm glad that you get a wild card in the first round!",
      "I really like the visual aspect of this game! The cutscene at the start, the animations of the gameplay, and just every bit of art looks great! The music was really loud on launch, but It was easily fixable in the settings. The game loop is super fun! I'd love to see different difficulty options, along side a ramping difficulty curve as the game goes on. Great work!",
      "Love the concept! I found a few bugs, most notably you can shoot a block through another block to clip the edge of the level. I would also love A better way to un-dig myself from being buried. Maybe if I could eat and swallow a block instead of having to shoot it? idk, but super fun vibes!",
      "W cutscenelove the gameplaygreat work man!",
      "The intro is great and some aspects from the round 1 submission are more polished now. I wish you will be able to add dying at some point so this can really become an intense survival minigame.",
      "Cute start intro, very nice art!",
      "Very cool cutscene. Great art. I liked the round 1 submission and I was looking forward to seeing how it would evolve. I did run into a couple bugs, one is that I was spitting blocks but those were going stacking or somemthing and didnâ\u0080\u0099t do anything. I also got trapped between blocks and couldnâ\u0080\u0099t eat nor get out. I think the speed is a little too fast, maybe introduce the game at a lower speed first."
    ],
    "comments_posted": 34,
    "created_at": "2025-02-13 23:39:13",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324872",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rodrigocard",
      "member_since": "09 May 2018",
      "posts": "414",
      "topics": "10",
      "followers": "34",
      "following": "306"
    }
  },
  "3292578": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "brainfartstudio",
    "game_title": "Murder of Crows",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 20,
    "comments_raw": [
      "Very nice graphics and colors. Liked the simple sounds and gameplay.",
      "Cute scarecrow! Very neat game )",
      "I love crows so much. The game could definitely use more enemy variation and later in the game I'd just get hit by an enemy before I could see there was an enemy on screen, but it was a minor issue. The ability to increase crit chance and crit damage is something you don't see that often in Jams, but incredibly welcome. Although, no amount of gameplay can extinguish my joy upon seeing crows.",
      "Dude you really nailed this one!  From the title to the intro art and story, to the gameplay being fun enough that I kept playing well past the point of knowing how I'd rate it, that's a full five stars from me!",
      "Very neat :)",
      "I loved this game! First, you have my favorite game title (I love that a bunch of crows are called a murder).  Second, I really dug the opening cut scene.  Third, and most importantly, it was just really fun to play. I love the mechanics of it (shooting out my crows) and the upgrades were awesome (I really looked forward to those).  If I'm being nit-picky, I think there could have been a little more story, but I still loved it as is.  And, for a brief moment (I assume), I made it to 10th on the leader board - I was very proud.  This is a winner and I really hope you get to continue it and I can play it again!",
      "The game mechanics were there for the challenge of the round. I would have enjoyed a more finished game, but that's not what we're judging here. It was addicting and fun, well done!",
      "Using the mouse, the arrow keys/WASD and space at the same time is kinda awkward. maybe better to auto shoot or auto aim so you either do not have to use the space bar or the mouse.",
      "This was great! I would have loved an alternative to the spacebar, since the main strategy is just hold space and dodge. Otherwise, the theme, the upgrades. Everything was great!",
      "Pretty enjoyable game! The story feels a bit weak but it helps setting the mood. Gameplay was fun, except for the holding down spacebar part :')",
      "Pretty fun! I wish I could play more but holding spacebar all the time makes my wrist hurt :(",
      "This is my favorite submission of yours so far! It had a really fun gameplay loop, and I loved all the upgrades, especially crow storm and the homing upgrade.",
      "Feels likes Vampire Survivors! I liked this one. Kept my brain engaged the whole time. You could expand this in a lot of fun ways. You've got the animal and projectile down perfectly.",
      "I had a lot of fun with this game! I think having shoot bound to the mouse would have been better. I initially assumed there were only stat buff upgrades from the first few I was offered but was pleasantly surprised when I discovered the variety available.  Combining the projectiles with the animals was a sneaky devious move that in my opinion definitely made the whole game more cohesive. I wish the enemies had a bit more contrast with the ground as generally for me when playing video games (and this is ameproblem) I tunnel vision into very specific things. This meant that while chasing one enemy I just wouldn't process the other one or multiple heading towards me, and I think if their color had been a bit brighter and if the grass didn't render on top of them that might have resolved the issue. This was a ton of fun, and I'll probably come back to this later to attempt to get a better score. Well done!",
      "I found it frustrating that the space bar was the shoot button, and it made me bind it to my mouse instead ð\u009f\u0098\u0085. I really enjoyed the upgrade system with its many great options. It feels like you have the bare bones of something great here, and I can tell the game wants to be something more, but it seems like you just didn't have enough time. For what it is, I really enjoyed playing it, and I would love to see this continued in a future round.",
      "Simple, yet fun and addictive!The intro cutscene is also really great!",
      "It felt like a GBC game from back in the day. I'm not overly great at games like this but can see how you could get addicted to the game loop very quickly. Sound was awesome. Didn't encounter any bugs and the story was clear from the outset. I liked how you killed two crows (sorry) with one stone with regards to this rounds task, combining both the projectile and animal into one. Cool game. Well done!",
      "Great cutscene! I've already played your game three times already and keep improving my score, will definitely come back for more.  The upgrade system is a fantastic addition, especially the homing crow and the options you give made me experiment with a few different strategies. Two suggestions, mouse button for shooting would feel more intuitive to me and I can tell you had a plan for a character for the green squares but for me personally the green blends too much with the background",
      "",
      "this is the top! I have nothing to complain about. I was enjoying playing this game, it is hyper addictive!"
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 21:04:31",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3292578",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "371",
      "topics": "3",
      "followers": "40",
      "following": "29"
    }
  },
  "3324692": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "brentjeskip",
    "game_title": "NOT MY NUT!!",
    "platforms": [
      "web"
    ],
    "rating_count": 27,
    "comments_received": 21,
    "comments_raw": [
      "Very cool game, it was fun but very difficult!",
      "VERY fun and very challenging!",
      "This was a REALLY good entry.  Your level design did an excellent job of teaching the mechanics over time, too.  Great job!",
      "That was fun.",
      "Challenging but fun game! The projectile mechanics worked very well and I think you introduced the new ways to use it in a good way. The only thing I didn't understand at first was the instant reload powerup, I had no idea what it was supposed to do for a while, I assumed it would spin me or something but I couldn't get that to work before I realized it was a reload.",
      "I loved that opening with the nut getting stolen.  It made me instantly sympathize with the elephant (who I loved) and wanted to get it back.  Cool projectile mechanic.  I was just really terrible at this game.  It was definitely one of the hardest to play for me.  I don't know why, but there is something about that jump and shoot down mechanic that was just tricky for me.  I'm glad you included the full run video, so I could see what a talented player could do.  Overall, well polished and challenging platformer (that met all the requirements) and I wish you the best with it.",
      "A REALLY polished and well thought out platformer. My only real complaint is the Boss Fight, but that might be more of a me problem, as I can't put into words why I didn't care for it. I also wish you could kill more of the enemies. The birds being the only killable enemy made some levels feel less interesting than the could've been. Regardless,  the art is so fun to look at, and the audio is really nice! The only feedback I can give is to have a better icon for the game itself lol.",
      "Really liked this game. I fell off the map on one level and I have to move on because I don't want to play through them again at the moment. That doesn't really affect my rating, just a bummer for me. You got a good story, good projectiles, and animals. The puzzles are fun and challenging. Great work! I'll try to get back to finish game.",
      "Really cool intro and in general the vibe is fun and light!",
      "my reflex is bad glad you included the video. Reminded me of a game called Dave I used to play. Loved it. You even had a boss fight. Great work!",
      "I won!",
      "Damn this is definitely one of my favorites from the jam so far. Great storytelling, great projectile mechanic, fun platforming, animals, great work!",
      "Rage inducing yet still fun. I think the difficulty was a bit high, and I also felt like the levels felt a bit all over the place in terms of difficulty without a clear curve. There were a few points when you could leave the map and the controls were a bit finnicky. I liked the shader and the simple art style. Overall, well done!",
      "",
      "I CRIEDwhen they stole my,MY NUT, REALLY COOL PLATFORMER LOVED THE SIMPLE ONE ROOM CONCEPT!im still angry they stole my nut... got to the boss but couldnt beat it so idk if theres a super plotwist in the ending cutscene or not sorry",
      "Love it so far, the tusk aim is brilliant example of shaping the game by your character concept, and it was ecstatic to finally figure out how to solve that level with 2x2 turrets lined up in the middle (actually that was the most challenging level yet even though it appears early on, and I only got the clue by accident). However in the first level with legionnaire squirrels I went through the wall and there was no reset, kind of a bummer as it takes a while to get to that point, I'll prob retry later when I have more time. Real good work.",
      "Stellar gameplay! The mechanics are so simple yet so meticulous, and all the levels are extremely clever!",
      "This game is awesome and I've just spent the last 30 minutes trying to beat it but I had to give up before I throw my keyboard at the screen. Loved the NES style graphics and animations and as a whole this makes for a really fun experience. The level design was great. My one and only criticism of this game is the damn control scheme (I'm not a PC gamer, I normally play with controller so this is probably part of the problem). Other than that, which is probably a skill issue, this game was 5*. Oh and that chiptune in the background is absolutely funky as hell and I'm all for it. Awesome job dude!",
      "Great game, I love the art style and the multi-purpose design of the projectile mechanic!",
      "Love it. I'm addicted. I'm coming for you danny...",
      "cool! it's addictive! :O"
    ],
    "comments_posted": 20,
    "created_at": "2025-02-13 22:11:09",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324692",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brentjeskip",
      "member_since": "11 October 2021",
      "posts": "191",
      "topics": null,
      "followers": "2",
      "following": null
    }
  },
  "3242767": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "dadaft",
    "game_title": "PiggiesElements",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 7,
    "comments_raw": [
      "Very fun puzzle platformer. Great progress after first round!",
      "I was intrigued by this game.  Unfortunately, I ran into a few bugs that locked it up and kept me from moving on.  I think you have the start of something promising here and I hope you keep working on it, bringing it to life, and squashing those pesky bugs.",
      "the camera is wonky, the textboxes are too small, but it fits most of the judging criteria. Interesting!",
      "This was a tough game for me to play. Note: do not press the space key before the game starts or else it will crash.",
      "Good job making the story and the gameplay! :D",
      "I like the starting cutscene, a joyful asteroid disco. And this is still a charming game, I was honestly glad when I heard you got to continue to round 2!",
      "I gotta be honest, this game was tough to play. The camera jumping around, the reset ruining any progress you made because of 1 mistake... It's really tough. That said, the story was fun and interesting! The puzzles were well designed, even if unforgiving. I think you have a lot of potential here!"
    ],
    "comments_posted": 10,
    "created_at": "2025-02-13 19:38:31",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3242767",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dadaft",
      "member_since": "02 July 2023",
      "posts": "35",
      "topics": null,
      "followers": "3",
      "following": null
    }
  },
  "3324805": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "spoonsweet",
    "game_title": "Prime Yarn",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 15,
    "comments_raw": [
      "Love the opening animation and especially the animation when you get the Cat Gun 3000 - so cool!",
      "I could not move anymore after the cutscene where I gave clothing to the (old) man. After restarting the game that did not happen anymore, so maybe some control buffering issue going on.",
      "Really neat idea and the art was top notch! Good job!",
      "No idea what I did or why I did it, but I reached the credits :D",
      "Always love your games. I think you got all the points of the round, got an engaging story, projectiles, and some kitty bullets. Great art as always. Great game.",
      "Superstrange - I stuck on second stage, character stop moving :(",
      "I say this to every one of your games but the art is gorgeous. The mechanics to be honest made... no sense to me? I won though. I don't know what I was supposed to do with the shapes and numbers but I shot the yarn and made the guy happy. Side note but the art for the yarn looks so fun and soft. The cats serving as projectiles was an interesting but cute choice, and the story was incredibly simple but did serve to bring a purpose to playing the game. Overall, cute game and nicely done!",
      "Warm kitty soft kitty",
      "I love the projectile mechanics a lot, very interesting way to implement different kind of ammos. I would like to see this developed  further, like more puzzles (or even a math game!) (I like math games you see). Also, the story is really sweet and your artstyle is cuteee ~~",
      "The one word  I think describes this game best is \"CUTEEE!\" Well done! Brought a smile to my face after so many sad story games.",
      "WOAH! The art, the animation, everything here is so polished! The game came out swinging and made a REALLY strong first impression with the graphics.",
      "Great game with a fun story! The art style in this game is amazing. Using a cat as a projectile is very creative. I feel the number system for different colors of yarn balls isn't very intuitive. I think you could just have different colored cats or guns to let players switch between.",
      "loved getting that old man his blue yarn hahaha, art was a stand out here for sure! good stuff",
      "I like that you answered the judging questions on your description page. I managed to complete the game and keep the guy warm without getting hit once :) Using the cats as projectiles on the yarn balls was good fun and I like how they get smaller. It reminds me of a game called pang.  Changing the numbers for each colour is a great idea and if you were to expand on the game I think having multiple colours at once could make for a good challenge",
      "Such a nice looking game, I really love these visuals!I love the little animation when you pick up the gun :D reminded me of enter the gungeon.Well done!"
    ],
    "comments_posted": 14,
    "created_at": "2025-02-13 23:26:59",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324805",
    "coolness": 15,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spoonsweet",
      "member_since": "09 April 2020",
      "posts": "1,019",
      "topics": "5",
      "followers": "157",
      "following": "71"
    }
  },
  "3294326": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "p4songer",
    "game_title": "Project Fluffy Friends",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 27,
    "comments_received": 20,
    "comments_raw": [
      "Interesting game, almost anti-tower defense! Great tutorial/starting screen, teaching while playing. And a cute turtle!",
      "A wild improvement from Round 1! The first game was already a super cool concept with a great execution, but now you've really made an awesome game. The music adds a nice touch, although the SFX gets a little annoying in the later levels.  The turret variations are all really fun and force you to approach each obstacle slightly different. Fantastic work!",
      "I enjoyed this a lot.",
      "This game was kind of tough, but I had fun with it. Once the animals started staggering over the course of the track I knew I was in trouble. My elephant would always go down :< Well thought out projectile mechanics & crucial animals, check.",
      "Was not expecting a Reverse-tower-defense game, very cool! With more polishing it could be a great experience!",
      "Nice twist on tower defense style. I liked the story and cute design. Instant kill of animals is a bit harsh especially with the slow movement. Really curious to see this concept evolved !",
      "This was like an inverted tower defense game, I really like the concept and the shield system! The artstyle was also very appealing.",
      "Really cool storytelling and I love the reverse-tower-defense style gameplay. I hope you continue to work on it because there's definitely something there! I just wish the animals had lives because it's pretty punishing as it is.",
      "Pretty fun and unique gameplay mechanic! I did constantly spam dash to speed up my bros and to speed up the slower ones if they fall behind. Once the animals are stacked it's easier to manage them, but even then one small mistake can end a run instantly. It did start to get repetitive rather quickly, there was some variety in enemy turret patterns but other than that it felt very samey.",
      "Really interesting idea that I'm surprised I haven't seen done before. I thought it was really cool although maybe a bit slow/repetitive for my taste. I think that the difficulty was kind of weird as for any given level it would just be hardest at the points were you are closest to a turret, it might be better to have it slowly increase. The art was cute and the difficulty levels were a nice addition. The projectiles and animals worked together very well but I do wish the story had been integrated a bit further. Overall, nicely done!",
      "Fun art! Fun story! Reminded me of the old flash games i used to play after coming back from school",
      "I'd call this game a success, it has original mechanics born out of round 2 limitations, many levels, cute graphics. It got more fun once I loosened up and discovered that I could walk anywhere on the map not just along the path. Well done.",
      "Great game! Good story with all the required mechanics done in a very fun and creative way. Well done!",
      "Was great to play on stream! Please feel free to watch comments there (00:00:00 mark I start with yours) Thanks for submitting!",
      "I managed to save four animals on hard mode and made it to the elephant! I'm not sure if the leaderboard updated the new score but this game is excellent and I love everything about it",
      "Fun game again, hope to see you in round 3 :)",
      "It always amazes me how other people are able to churn out almost a complete game in a couple of weeks! The art style was gorgeous, great sound. Loved the little backstory at the start with the accompanying visuals. Master Splinter would be proud.",
      "This is so cool! You made such good progress since last time I played this! I'm so impressed! :D",
      "I want to echo MessMess comment. I played on easy and still couldnâ\u0080\u0099t get Donatello over to the finish line. Maybe include a â\u0080\u009cvery easyâ\u0080\u009d for next round!",
      "I loved this game!"
    ],
    "comments_posted": 59,
    "created_at": "2025-02-07 03:04:18",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3294326",
    "coolness": 59,
    "participant_info": {
      "profile_url": "https://itch.io/profile/p4songer",
      "member_since": "12 September 2022",
      "posts": "211",
      "topics": null,
      "followers": "5",
      "following": "2"
    }
  },
  "3242455": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "jonqs",
    "game_title": "Rouler Bouler",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 14,
    "comments_raw": [
      "Really like the story, keeps you real intrigued!The sound aspect could do with some work though, a lot of the unexpected contact sound effects and constant static was kinda disorienting.",
      "Super satisfying physics gameplay. The sound effects really bring it all together for me.",
      "I enjoyed it but no matter what I couldn't escape..",
      "I love golf games and this was really fun.  I'm not sure why, but on my Apple laptop (both in Safari and Chrome) the game would only fill up 1/4 of the screen (even if I zoomed in).  It was still playable though and a fun challenge.  I love when the golf ball started to have it's own identity and thoughts.  Really clever and original.  I hope you get to continue this.",
      "This was a really cool game. Making the game become meta and break down was an interesting choice that left me unsure if some of the bugs I experienced were intentional? I couldn't fullscreen which I assume was unintentional, although it *SPOILERS* caused me to try and refresh the game to see if it would fix the issue after I couldn't figure out how to escape. I wanted to try and read some text I couldn't see when it was small but then I realized what it meant by the true start of the game and proceeded directly off. I don't know if the audio was supposed to break down into buzzing a few minutes into my playthrough but that was unpleasant. I really liked the simple visuals and the shader for the clues or whatever looked incredibly cool. I was actually having a lot of fun even with just the mini golf. I didn't see any animals but I'm assuming I just missed them. Maybe a video of a whole actual playthrough would be nice to tell which bugs may or may not be intentional and how the game is actually meant to end. I still had a great time and think that it did a great job with some criteria just not others. Nicely done!",
      "Really liked the minigolf mixed with the existential dread of the golf ball. Really fun game.",
      "This is, so far, my second favorite game in the entirety of Round 2! I love golfing games, and creepy imagery, so this game couldn't be more perfect! The controls were a little hard to use at first, but after I got the hand of it, I did another 5ish runs. My best run was 8 total shots! It's hard to say anything other than, THIS IS AN AWSOME GAME.",
      "I always enjoy a good mini golf game :) Well done.",
      "Very good, I cant escape though :(",
      "Nice game with a great creepy vibe! I keep getting surprised. I still can't find the way out - I found the hidden path and thought that was it, but I still get reset after falling off the mini golf track. Maybe add more hints for how to progress the story.",
      "Interesting! A kind of analog horror twist on golf is a super cool idea and the narrative components with the dialog and the cool effects and hidden messages is a great vibe. I freed the blue guy, but I wasn't sure exactly how to get to the next stage of the story, do I just need to hit a low enough score?Really cool idea, I love golf games, I love the verticality of the level, and I love creepy story stuff. its like half minigolf and half marble run half horror game. I think there is something super special in that concept.Great job!",
      "I only managed 13. Loved the creepy plot twist and the rewind shot ability was cool. A couple audio bugs but other than a fun game. Nice work!",
      "I got 12 ð\u009f\u0098\u0081 I love golf games, this was great. I liked how precisely you can hit the ball. I think golf fits 'projectile' perfectly and you had the animal narrator with the surprise twist.",
      "I was worried that there wouldn't be a story, until I got to the end. I got legitimate chills. Great job! I hope you figure out that issue with the window. I'd love to play a fullscreen version!"
    ],
    "comments_posted": 10,
    "created_at": "2025-02-13 22:35:59",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3242455",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jonqs",
      "member_since": "29 March 2016",
      "posts": "252",
      "topics": "1",
      "followers": "11",
      "following": "4"
    }
  },
  "3324549": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "mocha4coding",
    "game_title": "STUPID VALENTINES DAY",
    "platforms": [
      "web"
    ],
    "rating_count": 24,
    "comments_received": 16,
    "comments_raw": [
      "A cute game! I liked it!",
      "This was really good!  I liked the story and mechanics.  One nitpicky thing is that  throwing the bone onto the switch meant the dog hit the bone and stopped before the switch.  Having the dog be in the same spot as the bone after eating the bone would make the puzzle a little more intuitive.  Overall great job though!",
      "Impressive for 10 hours! The aiming felt a bit odd at first but I got used to it. Funny mechanic with the competing girl that is scared of the dog. Well done!",
      "found it difficult to throw the bone on the weight activated thing without the dog catching it . I mean I guess i could've gotten separation from the dog first but that required running the dog into a wall while I'm still moving just extremely frustrating mechanics. but did fit the criteria i guess you did have an animal...you did have a projectile although your animal refused to let land where i needed it to and it did have a story.",
      "I love the hand-drawn look and the interaction between our character and Meep is great.  Meep is indeed a good boy.  I'm afraid I wasn't very good at the game, but I found it all very charming none-the-less.  Well done and actually very impressive for 10 hours.",
      "Pretty fun concept! One of the few games I've seen where the intro text is a bit too fast :D",
      "Great game for only 10h. Meep would often not listen to me lol but that's to be expected within the time. I did a playthrough with max attraction to see what would happen and found the text funny",
      "Great work! I liked the story and I absolutely loved the art style. The platforming was sound, although the dog system and the attraction system could have used more time in the oven. Overall, I give it a B for 'Balentimes Day.' If the projectile throwing system and dog were improved that would move it up to a solid 'A' for 'Adorable.'",
      "Very impressive for only 10 hours work. You stuck to the criteria and I can't really argue with the results. Great job!",
      "For being made in 10 hours this was pretty good. The dog felt a bit unwieldy, my main issues being having to go back and get it along with throwing a bone with them by me and it instantly disappearing. I also wished that meep, and in turn the animals and projectiles, had been used a bit more considering you only really needed it for that one button and can jump over the girls. I also think that having the camera ahead of the player was a good idea but it was a little too far ahead which made any situation in which you need to see or move back feel awkward. The story was cute and funny although I do maybe wish it made a little more sense than the girlfriend spreading treasure chests throughout the city. It was charming but it's also hard to connect with goofy stories and they should stay somewhat rooted in reality. I think this game did a good job addressing all of the different criteria, and well I don't think any of the elements it's being judged on were done phenomenally I think that they worked well together and made a complete product, so good job!",
      "This was a fun, cute game. Made in 10 hours is pretty good. Loved the puzzles and I can really see this expanded on into something great. You got a good story, a fun projectile (much like in my game), an animal that helps you solve the puzzles, and a fun game. Good work!",
      "Fun game especially for only doing it in 10 hours. It was actually pretty funny and wouldve been amazing with some extra puzzles. Als if you jump on platforms your dog can get stuck and stay below you, this awesome feature could create some cool puzzles.",
      "Was great to play on stream! Thanks for submitting! Please feel free to watch for comments there (around 01:26:41)",
      "Cute story! It's impressive what you made in only 10 hours. The game is a little buggy unfortunately - sometimes throwing the bone had no response. You need to press jump and follow so Meep will jump with you, but sometimes Meep won't jump no matter what. Sometimes Meep jumps but falls weirdly slowly.",
      "I initially was going to rate this game 0 stars, but then I read your very convincing pitch. 5 stars on everything now!",
      "Fun game! I love the mechanic of Pitandra being too enamored by doggo to seduct lol. genius"
    ],
    "comments_posted": 18,
    "created_at": "2025-02-13 21:28:15",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324549",
    "coolness": 20,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mocha4coding",
      "member_since": "16 May 2020",
      "posts": "219",
      "topics": "3",
      "followers": "3",
      "following": "13"
    }
  },
  "3324884": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "patrikhomola",
    "game_title": "ShapeSweeperRound2",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 9,
    "comments_raw": [
      "Nice story addition to a very nice game.",
      "I remember really loving this from the first round.  But, I was a little confused this time.  I couldn't get past the first screen.  I put squares all over the map and tried to highlight where I thought the mines were, but I guess I wasn't doing it right.  I think with a slightly better tutorial, this would be awesome.",
      "Gotta say I like this more in the context of a story than just a puzzle game. Well done.",
      "the is in ok state",
      "This was one of my favorites from round 1, but I'm not sure it was as well executed this time around. I wasn't able to make it past the third minefield as it was a vertical strip and I only had those horizontal items left over by that point. And then the game froze on me. Which is a bummer because the idea has a ton of potential and you've already put in most of the ground work.",
      "I think I understand the game? It's hard to tell because there's not much player feedback other than to door disappearing. A solid tutorial would bring this to the finish line in my opinion. I love the idea, but for me, the execution just wasn't quite there. From reading the other comments, it sounds like there's a lot of unfinished parts, which is a bummer for the jam, but I'm super interested in what happens with this in the future!",
      "This was my favorite game during the first game so I'm glad you decided to explore the concept a little more. This is basically a puzzle mode with minesweeper and I'm surprised how well the story mode goes together with it.",
      "I'm already bad at minesweeper, but this game is so confusing to me. I swear I tried every way I could to understand how to deal with the first tunnel, but I only get through on what seemed as random chance. I'll definitely come back to this when there's some clarification on what I need to do!",
      "I really liked the idea behind the original submission. I was looking forward to playing a refined version but as the game is currently it is very confusing. I â\u0080\u009csolvedâ\u0080\u009d the first puzzle by trial and error but then didnâ\u0080\u0099t know what to do in the narrow passage. I know where the mine is but it wonâ\u0080\u0099t go away unless I clikc on it and die. I bet there is a strategy that I am missing. Could you add some clarification in the game page?"
    ],
    "comments_posted": 2,
    "created_at": "2025-02-14 00:03:20",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324884",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/patrikhomola",
      "member_since": "25 January 2021",
      "posts": "46",
      "topics": null,
      "followers": "5",
      "following": "3"
    }
  },
  "3320727": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "joszs",
    "game_title": "Shift Shape Adventure",
    "platforms": [
      "web"
    ],
    "rating_count": 30,
    "comments_received": 18,
    "comments_raw": [
      "This was a great add on from round 1, liked it a lot!",
      "Really awesome! I love how you managed to bring snake into this game, a bit more unsure about the projectiles (I don't think they 100% fit) but you managed it very well! Collecting the pages was a fun objective, although it meant I got to learn the mechanics in a bit of an weird order, so I had to figure things out myself instead.Even so, I still felt motivated to play through the whole thing, and it never felt too hard or too easy.",
      "This is awesome, I love the Tunic style handbook!!",
      "The improvement between the first and second round is pretty incredible. I did get stuck though. Where do I use the projectiles? Great work!",
      "This game is so insanely polished and professionally.  I feel like I can learn so much from you and your level design.",
      "Man, your game is just perfect.",
      "Very unique gameplay mechanic! I had 5 pieces and found 7 or 8 pages before I got too frustrated with the pacing and controls, it takes a lot of effort to get anywhere and I didn't feel like exploring further because of that. But mechanically speaking, this game is excellent :D well done!",
      "hi nice work you realy made the game betterunforchanatly i dint saw any animals andprojectiles in thegamebut like the game",
      "I still really like these puzzler game mechanics. No notes from me on this round, very well done!",
      "Really cool game. It's awesome the way that the flat block shoots and that the blocks can control the snake was unexpected but brilliant. It took me a while to get the snake in the right shape to climb it but I got there in the end and the secret entrance was really good too!",
      "My brain is not big enough for this game. I still loved it. I'll make my brain bigger, then try and finish it.",
      "puzzle design is brilliant and there's no better feeling than mastering the controls in this and then moving around seamlessly especially when there's callbacks to patterns. really like how you navigated the task and transformed a winning title into something even better!",
      "Metroidvania gang!! This game was great, follows up Shift Shape magnificently.  The projectiles and animals were incorporated so well, some of the continued games from round 1 felt like they had the themes shoved in but I think they make the game much better here. The snakes were cool as they force the player to sort of make their own puzzles and the projectiles added an interesting level of positioning. Some things I did felt really unintended but I think that just made it much more fun to do. My only complaint was that moving around felt kind of slow which led me to not want to backtrack much, the shortcut in snake tower is great but other than that going from one end of the map to another just takes a while. With some more mechanics and variety I could absolutely see a full metroidvania in this, amazing job.",
      "Nice work!  Very relaxing experience",
      "Gosh! Another spectacular entry to the Shift Shape saga! The concepts for the animal and projectiles are soooo well conceived and the atmosphere perfectly matches the intended vibe. 10/10",
      "Woah! Great work! I love the unique storytelling and the gameplay mechanics. With some work, this game could become a classic puzzle platformer.",
      "Really fun and engaging game :) Good job.",
      "Amazing game like I said in Discord! I played it again as intended. I still can't find the 13th page though. My only complaint is that the projectile shooting is a little clunky to use, which works great for the puzzle-like feel of the game, but it felt slightly repetitive in the projectile tower when there were a lot of blocks to shoot."
    ],
    "comments_posted": 18,
    "created_at": "2025-02-13 10:33:25",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3320727",
    "coolness": 22,
    "participant_info": {
      "profile_url": "https://itch.io/profile/joszs",
      "member_since": "19 January 2016",
      "posts": "177",
      "topics": null,
      "followers": "134",
      "following": "54"
    }
  },
  "3323892": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "spookyman999",
    "game_title": "TIMERIFT_ACT_1",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 17,
    "comments_raw": [
      "I had a great time playing it, it's a lot of fun!",
      "Great job!! I feel like the camera rotation effects really helped give a sense of speed.  This was chaotic in the best ways.",
      "Game is fun, game is cool, but tooo fast for me xD",
      "Wow, the sense of speed here was incredible.  I would have these awesome moments when I felt like I was flying, but then I would crash and burn hard (I'm just not that good).  I would love to see someone with more skill than me play this game.  Great soundtrack for it (one of the best I've heard) and strong characters.  Well done.",
      "Without question, the best platformer I've played so far! Loved the characters, they were just fun to listen to. My main issue was that there are a TON of areas where you just have to restart because you didn't do down a ramp fast enough. There were also a good amount of times I died because the speed you need to clear some areas removes all the reaction time I have. Beyond that, this is an amazing game. Fantastic work!",
      "Incredible fast paced action and you should be proud of yourself for making such a cool game. The art style and everything really came together nicely. I think my only real criticism is it can feel at times almost a little to chaotic, I think you just need to really hammer down on what the main mechanics are and stick with them. I thought it was brilliant though, I was thoroughly impressed with how much you've managed to achieve in the time since you started developing this idea. Great job and keep it up!",
      "Very fast and chaotic, reminds me the old Sonic games where you have no idea where you're going and you hit a bunch of walls and slow down and you have to die a lot to figure out when you have to tap the jump button or take another action. Not my favorite kind of game but it was fun. Good work!",
      "I enjoyed my playthrough! Very chaotic and some parts just flew by without me even knowing what was going on or whether I missed something, but I managed to make it to the temporary end credits without any softlocks :D I disliked the last level the most, because it felt more like trial and error while the earlier two levels were more fun to go through imo. I liked the animal mechanics a lot. The camera is a bit rough at times, and sometimes I'd rather have it zoomed out a little more so I'd have a chance to see where I'm going at warp speed, but I understand it's part of the charm of the game this is inspired by, and to just enjoy the ride :D",
      "Excellent work! I had a few moments where I got softlocked and had to restart but for the most part it was really fun and well paced. I did get a bit nauseous at times because of the camera tilting left and right and I wish there was some option to turn it on / off or adjust how much. Otherwise, it's a really solid entry, great art, great story, great mechanics, great job!",
      "This was cool! There are a few areas where you can get softlocked, and sometimes the camera is zoomed out perfectly, other times it's not zoomed out enough to see everything needed. All in all, those are small issues that have simple fixes. Great job!",
      "Hi, Incredible game but I just couldnt complete it with the controls :/ I did watch your speedrun video (wish you could make one where the story is readable tho since I missed that) and its amazing how much stuff youve added. In general I would always allow arrow keys since im on azerty it was very hard to use W to pick up. also just allowing E for pickup wouldve made it easier on my hands. Other then that its a very cool game and I know for a fact those sliding mechanics arent easy to make so good job!",
      "Damn this was a fantastic game! I loved this game! Felt like sonic :D",
      "my internet is back on! Had to check this one first!",
      "Great game with amazing art! I love how smooth the movement feels. The gameplay feels very fast-paced and fun. I like the story as well. I think I accidentally got soft-locked - there was no way to kill the living bird and respawning didn't change anything, so I had to restart the whole game. Other than that, amazing game. Good job!",
      "This game was a ton of fun when it was at it's best. The controls felt really good and I love the ducks and using them to rocket jump. I think the end of the story was very abrupt but I might have missed something in the last level as I rocket jumped accidently straight into the end from decently far away. The animals, mostly the duck, were fun to use but didn't really seem 'animal.' The only animal who's ability lines up with what I would guess is the bird that allows you to glide. But for some reason hitting a dead bird teleports you to it and the lizard shoots bullets and the ducks explode, these could be anything besides animals and they'd make more sense. I also only used the lizard during the lizard tutorial where it forces you to, mostly because it has no mobility use besides shooting birds and that use isn't worth the fact that I don't know how to drop it and can't pick up other animals D:",
      "Very fun! Love the mechanics, the flow of movement and the cutscenes! The use of the animals is all really fleshed out and works crisply",
      "The movement feels great, you did amazing work in this round and this game fits very well with the task and more importantly you managed to continue on the same universe and made \"part two\" with a different character. Really awesome work! I have some nit-picks which don't affect my judgement (the game is at least top 10% in my opinion)"
    ],
    "comments_posted": 8,
    "created_at": "2025-02-13 16:16:43",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3323892",
    "coolness": 7,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spookyman999",
      "member_since": "12 November 2022",
      "posts": "410",
      "topics": "4",
      "followers": "26",
      "following": "11"
    }
  },
  "3324736": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "funkyruben",
    "game_title": "TalonCore",
    "platforms": [
      "web"
    ],
    "rating_count": 18,
    "comments_received": 15,
    "comments_raw": [
      "Cute game! The storytelling is by far my favorite part! Is very clean and reads well.I think the aiming could do with some work though. It feels a bit awkward to have to use both WASD and arrows in this way personally, and might have preferred if it was either tied to mouse position or just in the player's facing direction.I also noticed that its easier to get through the game without fighting any enemies, so may be something to consider for the future.Still loved it tho!",
      "19 seconds! Fun game!",
      "This game is good at telling a story without words. The art is good too.",
      "Great opening sequence - excellent way to setup the story without any dialogue.  I like twin stick shooters, but having to use the keyboard to aim and shoot was really hard - I wish I could have used my mouse.  I'm afraid I died a bunch and didn't get very far in this game, but I think just adding some other control options would help a lot.  I hope you keep working on it.",
      "That was fun. I actually managed a pacifist run after going through throwing birds at everything :)",
      "a bit of a bug found by mistake then duplicated. get stuck between the robot and the first green barrel the robot stops attacking you so you dont die but prevents you from moving from that position. not criticizing just reporting it to you. all around great game though loved the whole thing the story the birds the birds are projectiles didn't finish though side scrolling games like that just arent really my cup of tea but still great game.",
      "Really nice way of presenting the narrative in the beginning! Awesome art too. I also liked the way the enemy projectiles kind of wobbled forward, much more interesting than a simple straight trajectory.I felt like the control scheme could be further simplified by not needing to press space, simple press left to shoot left, up to shoot up e.t.c. I got used to it quickly but can't find a reason to have picking direction and firing on different buttons.",
      "This really hit the theme perfectly to me.  The story, animal, and projectiles all really flowed together and the game had an incredible amount of polish.  Great job!!",
      "Really fun story and great animation. I love how much love went into the art, it's cool how the dialogue is written in ideogram so you don't have to worry about localization haha. Great classic beat-em-up gameplay and the bird projectiles were a smart way of interpreting the theme.",
      "The animal projectiles was a great use of the main mechanic! It was tricky to fight the robots that shoot back though, so I ended up just running past everything. Loved the story as well, very simple and easy to follow!",
      "Very cute game, nice story!",
      "Lovely art and charming game. It's creative to combine the animal and the projectile. The story is simple but clear. I think gameplay-wise there's no reason to fight robots right now. The reward time reduction dropped by robots can easily be saved if you just run to the end.",
      "Having the birds that are part of the story being the projectiles in the game is a great idea that worked very well. Fun game!",
      "This was great! Very cute. My only complaint is that you can just avoid the enemies all together. I think a future update with \"boss rooms\" or \"clear the enemy rooms\" would be a wonderful addition. As it is, this is a great proof of concept!",
      "I thought you did a really good job of showing and not telling the story. Organic bad, Robot good. The visuals were so crisp! Nice little backing track as well. After getting my ass handed to me by our robot friends I decided to sprint my way through the level, and saved the princess in record time. Great job, this looked amazing."
    ],
    "comments_posted": 2,
    "created_at": "2025-02-14 00:51:32",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324736",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/funkyruben",
      "member_since": "09 December 2020",
      "posts": "109",
      "topics": null,
      "followers": "24",
      "following": "33"
    }
  },
  "3324985": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "krafter",
    "game_title": "The Invisible Ringmaster",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "the art is really great! *o*",
      "I had fun moving around this strange world. I like the unique style and curious to see more of this !",
      "I love the art style with the 2D sprites in the 3D environment and how you presented the dialogue - it gives off comic book vibe.",
      "Very cool and unique look to this game.  The story felt like an odd fever dream.  Interesting and unusual game with extra points for originality.",
      "As others have mentioned, there's something just really satisfying about an absurd story that may or may not be a dream.  Great job!",
      "Such an odd game. I love it. The dialogs were great and the story was interesting. Only thing I had a minor problem with was that it was difficult to tell if the character was on the right line as the animals to hit them. Great game!",
      "I have... questions...",
      "That was kind of trippy :) Good job!",
      "There's some cool art here! I think somewhere in the middle there's a game too lol. I'm honestly not sure if I won?  I was told I'm dreaming, and then the camera panned up into the empty sky. I love the idea, but a little bit more structure, just to explain the chaos would be nice.",
      "That was a pretty cool experience. The story was cleverly done I loved jumping into the cannon and shooting myself across the circus. The characters art work was really cool as well. They look straight out of an illustrated book for children or old school British comics like beano or the dandy, loved it. Nice job!",
      "\"I AM BUT AN AIMLESS PROJECTILE\" what a narrative masterpiece. You surely have talent as a writer. Also liked the 3D rotating circus tent and well, all the characters.",
      "Love the concept, game was solid but I wished you had implemented the canons a bit more since they were a cooler projectile mechanic then the normal shooting. Like the 3d circle view with the canons",
      "A CIRCUS GAME YAY!!!"
    ],
    "comments_posted": 10,
    "created_at": "2025-02-14 00:48:18",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324985",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/krafter",
      "member_since": "10 September 2015",
      "posts": "207",
      "topics": "6",
      "followers": "23",
      "following": "21"
    }
  },
  "3324747": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "tenifayiga",
    "game_title": "The Lunar Crucible",
    "platforms": [
      "web"
    ],
    "rating_count": 13,
    "comments_received": 10,
    "comments_raw": [
      "It was pretty fun! Some sounds and this game will be awesome!",
      "This game has some fun projectiles! I had the most success with the rifle. The sniper seemed pretty hard to use.",
      "Really fun game.  I don't think I was very good at it, but I didn't care I just loved shooting that shotgun.  The game desperately needs some sound effects though for all those blasts and destructions.  I liked this a lot and I really hope you get to continue it.  Also, cool title.",
      "I had a lot of fun and ended up playing way too long lol. Shotgun with explosive bullet + homing bullet lead to an incredible combo in wich i can stay afk and kill every things. super satisfying.",
      "I did not understand what was the animal and what role it had. Was it a moon's wish? I died before getting any.",
      "I love the animations and the wave survivor loop was a really good call. I enjoyed experimenting with different weapons and upgrades. The animal themed upgrades were also a clever move, though it did stretch the requirements a little bit haha.",
      "Well, that was good time :)",
      "Great game with,  I like these types of game wave games, they get addicting.",
      "This is a cool concept! I was a bit confused by the story at the beginning, but I think I got it after a few rounds.",
      ""
    ],
    "comments_posted": 9,
    "created_at": "2025-02-13 23:26:47",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324747",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/tenifayiga",
      "member_since": "03 December 2018",
      "posts": "118",
      "topics": "1",
      "followers": "7",
      "following": "1"
    }
  },
  "3285072": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "evengy",
    "game_title": "The Ritual",
    "platforms": [
      "web"
    ],
    "rating_count": 21,
    "comments_received": 13,
    "comments_raw": [
      "Very cool poliched game.",
      "Let's just say I'm glad I didn't skip the tutorial! Even if the VA is AI, I must say that the writing is great! Well done! Gameplay wise I felt scammed every time I drew a card and paid, cause I thought it had loaded up a free one (some type of indication if it's free or not should be used, or even better that you draw them automatically like someone said below)",
      "This is definitely one of the coolest looking and sounding games (that voice over narration was awesome).  I also loved all the story you packed in here.  I really appreciate all the amazing work that went into that tutorial, but if I'm being honest, I found myself still a little lost at the end of it.  I did my best to figure it out and play the game, but I was in over my head.  I honestly think if I had someone to teach me this game, I would love it.  It's easily one of the most professional of all the games and I have no doubt it will move on.   I'll look forward to playing it again.",
      "Good improvements to the first round. The projectile cards added some new strategy to the game. Very well done!",
      "Very good. I loved the artwork. 10/10",
      "I love the vibe that this game gives! Tutorial was very nicely done, I still had questions but it gave me enough information to get started and experiment with the game.",
      "Really cool game! The visuals are unique and striking. I playtested this before the jam ended and didn't mind the tutorial too much but upon replaying it I wish that there was some way to skip even just individual voicelines. I think you did a phenomenal job incorporating projectiles and animals into your game. I think for the story you did a good job with what you had but I'm not a huge fan of just more of an implied backstory, I wish it was a bit more concrete. Overall I really enjoyed the experience, great job expanding it from round 1!",
      "This is not the usual genre of game I am used to playing, but I think it's testament to your solid design skills that I was able to pick it up rather quickly. You did a good job of incorporating projectiles into a genre that doesn't usually facilitate such mechanics. I played through the tutorial first and thought the voice acting did a fantastic job of revealing the narrative, the rest of which is evident in the art and overall feel of the game. I didn't encounter any bugs and I don't really have any criticism other than the tutorial maybe going a little bit too long. Fantastic job!",
      "Let me start of with that I love this game, only things I would change/add are some quality of life updates. The tutorial not being optional is good since (your game doesnt speak for itself and I love that you did this since it was my feedback in round 1) only issue I got with this is that it is long. The voice is cool but I wanned to quickly read and play. Just being able to skip trough it (since its mandatory already people should read it) would make it a lot more fun + people could quicker replay your game. The animal is well put in the story but the damage it does wasnt always so clear to me. Other then that like I said I love this game the story and how everything works perfectly together. Great job!",
      "Incredible work Evengy! I played it during the submission period but it's clear that you've done a ton of work on it since then. Allow me to congratulate you in advance for passing to round 3!",
      "Totally deserve first place in my opnion. Only negative I had was with the tutorial being lenghtly for mechanics prety simpe like the cost of card but the voice acting made it not to bad. Great work man",
      "A tried and true case of a sequel that outclasses the original.",
      "Very cool atmosphere and amazing visuals. I like that you were able to incorporate projectiles into a card game. The tutorial is very cool and tells a great story. But I can't skip the tutorial even though I've watched it before, and it's quite lengthy. The deck has some slight balance issues - the chance to draw hero cards is a little bit low."
    ],
    "comments_posted": 7,
    "created_at": "2025-02-01 00:35:42",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3285072",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/evengy",
      "member_since": "15 April 2021",
      "posts": "125",
      "topics": "1",
      "followers": "38",
      "following": "7"
    }
  },
  "3313631": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "tinggame",
    "game_title": "Tin Rabbit",
    "platforms": [
      "web"
    ],
    "rating_count": 29,
    "comments_received": 25,
    "comments_raw": [
      "Wow awesome game ! Original and the gamefeel is really cool. Congrats !",
      "I LOVED this game!  Seriously, it was so good.  Great graphics, mechanics, sounds, music, characters, and story integration.  Honestly, it all felt so professional.  You even nailed the difficulty for a game jam - where it wasn't too challenging and I could move through the levels and enjoy the story.  Definitely one of my favorites so far!",
      "That was pretty entertaining overall! I shot the wrong rabbit a few times early on before I noticed the subtle changes each rabbit can have. It made searching for the right rabbit a bit more engaging, but I sometimes had to explore each area a few times before finally coming across the right rabbit. Them being able to hide behind trees doesn't help, lol.",
      "1. GREAT STORY TF",
      "Really good game with a great story. No notes on completing the theme and requirements of the round. I loved the everything about this game except having to shoot cute little rabbits.",
      "Great game! felt a lil monotone after a while but the art and visuals, the story, demon bunny and the entire feel is amazing",
      "Gah! Amazing game as always. Wonderful story, great art, compelling atmosphere.Plus I loved the Throw a Punch reference at the end hehe",
      "This game is so good, the story, animals and projectiles all fit together perfectly!sad about the rabbits though :(Only bug i encountered was that i got the alternative ending even without collecting the items, this was on a second playthrough so i assume a variable isnt being reset",
      "Was great to play on stream and have you there!",
      "I really like the setting and art of the game, it's a top down shooter where if you're systematic you will never have to run from anything. I did kind of forget to check the loot from the killed rabbits, but once the ending hit it did make perfect sense, while still being a plot twist, good job!The game itself felt quite tedious though, and I would've closed it at level three if this wasn't a story round (many other people will miss the ending though). It worked well and felt interesting the first three levels but after that it didn't really bring anything new(could also be cause I didn't check the dropped of stuff, so I missed a bit of story there). Especially the increased search area made it feel very slow. That being said, the slow nature of the game also fits into the narrative, with this being your \"day to day job\".The game would've been perfect if there was 3 levels instead of five, so well done!",
      "Let me start with the positive - the art and atmosphere are gorgeous. The story was fairly engaging and kept me playing. That being said, the game didn't really come together for me. This is probably a personal thing, but I felt kind of bored throughout the whole game. First of all, the gameplay was pretty repetitive and menial. I think that expanding the map wasn't a great choice as it just increased the tedium of finding the right rabbits, maybe having more variations or rabbits that look more similar to one another, to make it more risky to play. I think having a menial task like this as the main game loop could serve as a great vessel for horror but my other issue was that the game wasn't scary, and I think there's a lot of reasons why. Firstly there's no actual indication that you are in danger. The music is still calm and the vibes are still immaculate. There was at least one moment where there was a monster chasing me and I didn't notice. Having some adaptive music, maybe a tint on the screen or a vignette would have gone a long way. The other thing is that the monsters are complete nonthreats. I don't think I got hit once over both my playthroughs (during the jam and right now). They are way slower than the player, and not only that but shooting knocks them back and stuns them. Something I did in my first round game was have the monster increase slowly in speed, creating moments on tension where they're close but then you pull ahead but then they start getting closer. This forces you to get out of danger as quickly as possible too. Finally, there's never a moment where you are actually forced into danger. If you are just careful while playing, even if you don't know to avoid them, you might not encounter a single threat.",
      "I loved this. The story was nice too.",
      "I love this. Good story, simple mechanics but perfectly for the task. 5/5 gj!",
      "Definitely top 10. Great work!!!",
      "Got to be up there with the best games of this jam. Great job with the atmosphere and overall story. Shooting mechanics felt crisp and you the way interpreted this rounds task was very clever (animal crucial to gameplay). Fantastic job!",
      "That was intense ;) Good job.",
      "Really good game. The artwork is amazing, I especially like the swaying trees and the rabbits when they get bigger. I found the engagement ring too and the twist at the end is brilliant. Coming back to the new title screen is a nice touch. One idea that I think could improve your game would be to automatically go to the next day rather than clicking it",
      "",
      "I cannot think of a single thing I don't like about this game. Without any spoilers, the ending gave me chills of realization. Very well done, I hope you win!",
      "Amazing entry.",
      "Incredible! I loved it. Really touching. The artwork is awesome, great job, great game.",
      "A perfect game! Tho I didn't find the monsters :P",
      "Very simple but very effective in what it does. Like it a lot.",
      "As the alternative ending correctly guessed, I was not happy about shooting the poor rabbits, monsters or not, and shooting a wrong one was the worst in particular. But I could see the humor of it as well. The controls and graphics & general feel of the game was perfect, playing to the end was not a chore, well done.",
      "Wicked twist and fun gameplay! This is a solid game all around"
    ],
    "comments_posted": 30,
    "created_at": "2025-02-09 15:14:41",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3313631",
    "coolness": 39,
    "participant_info": {
      "profile_url": "https://itch.io/profile/tinggame",
      "member_since": "03 March 2021",
      "posts": "256",
      "topics": null,
      "followers": "24",
      "following": "3"
    }
  },
  "3323645": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "waifugames",
    "game_title": "UNTOLD",
    "platforms": [
      "web"
    ],
    "rating_count": 23,
    "comments_received": 14,
    "comments_raw": [
      "Both the art and puzzles are great.",
      "Very funny and very original! I really like the pixelart of this game",
      "I really dig the retro look of this game.  The main character and the cat are both adorable.  I like solving the puzzles too.  I just wish the cat was a little bit smarter (it kept getting hung up on walls).  I hope you get to continue this and polish it up a bit, I thing it could be fantastic.",
      "As others have said, this game seems way to hard. Not that making a difficult game is bad, but when most of my deaths were caused by the cat just killing itself constantly, it begins to build frustration. The puzzles were fun! It's just that every section the lacked a wall just sucked to play. Even with my complaints, I would love to see a more polished version of this game! It has a great concept, lovely art, and wonderful audio. The only thing holding this game back for me is the seemingly unfair difficulty.",
      "Very cute and smart, I just wish it was a bit more forgiving to prevent many unfair deaths.",
      "This was a fun concept and it was well done. But it was not my type of game. The last bit of bridges at the end were incredibly frustrating with the controls and having to try to tap a direction and risk dying from it or not tap it and risk dying from trying to move ahead.",
      "Cute and fun game! Very smart and well done!",
      "Very cute. I had fun.",
      "the game is perfect",
      "Really nice job, incredibly polished game. The art and music were really cute and fun, the animal and projectile inclusions were done well. I wish that moving off of the map was a little more forgiving or that the cat was a little more careful. I also think some way to make the cat sit down so that you can ignore it while doing something yourself for a bit would have been nice. I still had a great time though, nice job!",
      "This game was really fun! Great art style, and story. I like how the cat was both an animal tied to gameplay AND a projectile. Very clever take on the rating criteria.",
      "+1 to what kiritoJ22 said. Also +1 to severeignbagel. I think there's a few small level design issues, but in general, this is an incredible submission. Excited to see what you do in round 3!",
      "what a submission! Had a great time playing this one. great job",
      "I really like the mechanics and the puzzles are clever, only thing I would change is the respawn holding R time because with the number of time I died it would have save so much time to just press R instead of holding but it might be just a skill issues on my part lol"
    ],
    "comments_posted": 6,
    "created_at": "2025-02-13 15:35:10",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3323645",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/waifugames",
      "member_since": "13 January 2025",
      "posts": "11",
      "topics": null,
      "followers": "5",
      "following": null
    }
  },
  "3324132": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "daistic",
    "game_title": "Unfinished Project With Duck",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 15,
    "comments_received": 10,
    "comments_raw": [
      "Sad to see you couldn't make more. The game is still great! I do hope to see more in the future.",
      "The title kind of sums it all up here.  You have some interesting ideas and a fun sense of humor.  I hope you get a chance to add more to this game.",
      "duck",
      "I love the idea of having to disable components in order to free up memory for other components. The setup for the story was cool, too. I just wish there was some more game here.",
      "ahiru wa kawaii desu!",
      "itai",
      "The giant duck was hilarious and the narrative aspect of this entry was fantastic. Great job!",
      "Oof, what a story. Sorry about college. Otherwise, still an interesting and fun mechanic. The game is still fun.",
      "Cute! The part about college catching up to you made the plot very relatable.",
      "That was silly and fun :)"
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 18:30:14",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324132",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/daistic",
      "member_since": "26 September 2024",
      "posts": "0",
      "topics": null,
      "followers": null,
      "following": null
    }
  },
  "3242636": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "bluesky5114",
    "game_title": "What Genre Is This Game",
    "platforms": [
    ],
    "rating_count": 10,
    "comments_received": 9,
    "comments_raw": [
      "Really love the concept, and the changes between different game genres feel very smooth. I wish the game was a bit longer - right now, the story feels more like a tutorial.",
      "I remember this game from round one. I still like the concept of switching genres. Well done.",
      "A very interesting concept. The controls felt a bit clunky, I don't know why all of the Genres couldn't use WASD, but it was a minor issue. I also really like the implementation of the concept itself. I think given more time, this could be a great game!",
      "Really cool how it switches! I really wish it was longer, as you never really got to use the mechanics properly. It was a bit unclear that I was supposed to press space at the box to trigger the dialogue, but other than that I had no issues. It feels like the animal (the ladybug) just as well could've been a human character (it has no animal like traits), and therefor I feel like it doesn't fit the restrictions 100%.",
      "Woah... this is such an awesome idea for a game. I'd love to see you run with it and see how far you can take it!",
      "I didn't play this the first round but this is such a cool concept for a game. Absolutely loved it. Great job!",
      "As you all mentioned, itâ\u0080\u0099s true. Aside from the bug fixes and the model changes in d-bug, there havenâ\u0080\u0099t been any other significant changes. I had intended to focus solely on developing this game during the GDKO, but upon seeing that the tasks in Round 2 already existed in my game, I realized that I had committed too much too early, given my small capabilities during Round 1. So this time, I decided to put off the ideas I had in mind. However, in hindsight, I realize it would have been better to at least update the UI or focus on other quality improvements. Iâ\u0080\u0099m grateful for the interest in my game, and I apologize for any disappointments.",
      "I agree with the previous comment, this game was honestly one of my favorites during the first round and I was really happy that you got to the next round, but I also wished for more content for the second round. Not necessarily more genres, but at least more levels and such.",
      "This was cool! I'm a little confused because I think this was the exact same game you uploaded to round 1? Not complaining, I guess I'm just bummed out that there wasn't a few more new genres."
    ],
    "comments_posted": 4,
    "created_at": "2025-02-13 16:39:42",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3242636",
    "coolness": 5,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bluesky5114",
      "member_since": "28 December 2024",
      "posts": "20",
      "topics": null,
      "followers": null,
      "following": null
    }
  },
  "3324845": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "nitramiuz",
    "game_title": "Wolf Onslaught",
    "platforms": [
      "windows",
      "linux",
      "web"
    ],
    "rating_count": 21,
    "comments_received": 16,
    "comments_raw": [
      "Nice gameplay! ) I always lost my rocks and stayed with 1-2. Poor sheep.",
      "I managed to get myself stuck in the trees ð\u009f\u0099\u0088",
      "Ah, we have the same throw and retrieve mechanic. The story was pretty good, the projectiles were great, and included the animals so you checked all the boxes and the game was fun. Well done!",
      "Cute, simple, well thought out.  The only complaint I have is how short it is! I would love to see this developed further.",
      "",
      "Really cool submission. Gameplay was simple but engaging and very hectic. I loved the dialogue at the beginning and the end.  It really helped me form an emotional attachment to the animals. A short and sweet gem.",
      "Very nice. I have to admit I didn't very far, but I really enjoyed the aesthetics and game play",
      "Oof, I lost half the herd on the final attack. Fun game :D short but sweet, well done!",
      "Love that you still managed to finish, I did like the fence mechanic you showed in the discord tho. Good job tho!",
      "hi love the story animals fit the game very well",
      "Well done! I liked it a lot! :D",
      "I feel bad for my porky friends, I was terrible at keeping them alive. Very fun and addictive game loop. It was a smart way to implement the projectiles, making the player pick up the rocks to throw. Great job, well done!",
      "Was great to play on stream and having you there! Please feel free to watch comments there (00:22:04) Thanks for submitting!",
      "You were stressing me out the discord server but this really came together. The length and difficulty were very well tuned (unlike SOME game I know ð\u009f\u0090¦), it didn't feel easy and took a few tries but never felt unfairly hard. The polish was pretty impressive considering the time it was put together in. The story felt a little bit disconnected with the gameplay but the projectiles and animals were worked together very cohesively. I saw you said this was your first jam where you used digital art instead of pixel art and I think it looks great! I did the same with my game but only for UI and a cutscene. Great job (especially for just over a day of work)!",
      "Looks amazing visually and love the sound design too! I like many design choices (you can herd animals using your character, you can accidentally kill the animals, you have to pick up stones after throwing them, etc.).",
      "First, I love the look of the game.  I watched your making of video and I'm so impressed with your graphic talent (I have none of it)."
    ],
    "comments_posted": 15,
    "created_at": "2025-02-13 23:56:00",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324845",
    "coolness": 17,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nitramiuz",
      "member_since": "17 July 2018",
      "posts": "879",
      "topics": "1",
      "followers": "203",
      "following": "8"
    }
  },
  "3323074": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "mardook-stone",
    "game_title": "World Of Mon",
    "platforms": [
      "web"
    ],
    "rating_count": 11,
    "comments_received": 10,
    "comments_raw": [
      "Very unique idea !",
      "Extra points for doing something so original, I've never even heard of someone doing it before.  I had headphones on and the experience was very interesting - actually a little scary not being able to see anything.  I'm just not sure how fun it was.  Overall, as an experiment (or even for a game jam) this was cool and very unique.  Way to push the boundaries.",
      "i'm not fully def or even legally def but i have a hard time hearing.. which is why there is never any sound in my games so this game was rough for me. even with my trusty headphones i could find i couldn't really determine where the sound was coming from.. i think there was a duck quacking that i was never gonna find and I'm not sure if there were any projectiles. not to say its a bad game. Love you made a game for the blind",
      "Interesting take",
      "That opening voice clip rapping was fire. I really like the concept of the game, although it is rather difficult. Nobody else has tried to do something this experimental in the jam so just for that alone it is very impressive. Good job!",
      "A fun game, though tough for me.",
      "Nice work! I actually found myself playing with my eyes closed so I could try to paint a mental picture of where everything was.",
      "This was kinda hard for me since even though I fully respect the innovativeness behind making a game where you can't see, listening at stuff has always been hard for me (especially in English since it's not my native language) so I wasn't entirely sure what was happening and got quickly quite impatient. I appreciate the lively performance of the voice actor and sound design tho!",
      "I think this is a cool concept. My one request is that if you're going to have a game like this, you need to at least prepare the player for what they're getting into. For example, a screen with audio settings would have been great. I also think that, for a game based off of sound design, normalize the audio levels. Hitting the dresser for the first time made me jump out of my skin because I had my audio turned up all the way to hear the intro. Then again with the tomatoes, the sound effect is twice as loud as the voice line.",
      "Hahah this was so creative, well done my friend :D"
    ],
    "comments_posted": 0,
    "created_at": "2025-02-13 08:12:40",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3323074",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/mardook-stone",
      "member_since": "20 February 2023",
      "posts": "50",
      "topics": "6",
      "followers": "5",
      "following": null
    }
  },
  "3293688": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "sijilum",
    "game_title": "awesome_game.program",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 13,
    "comments_raw": [
      "Great game - one of my favorites.  I love the setup, that your computer has been hacked.  You did it really well.  the gameplay was challenging but fair and I was really proud when I won.  Excellent job hitting all the requirements Lastly, I loved it when the cat complained about how good I was at the game.  Excellent work!",
      "Very cute. I appreciated being able to set the wallpaper.",
      "absolute cinema ð\u009f¤\u009að\u009f\u0098\u0090ð\u009f¤\u009a",
      "Great work Sigil. Once again proving why you are a top seed.",
      "This was one of the best entry's in the jam for me. Up there with the top games in this jam and one of my personal favourites to play. Nailed the criteria as well. Great job!",
      "The cat virus was great a concept and the game was fun. I think you nailed the round and all the requirements.  Great work!",
      "This game was super cute and super fun. Loved the little cat and I think that was a great way to include the animal. The desktop and all of the stuff was a really nice addition and managing windows can be a pain, nice job. I found the game itself to be fun and liked the new mechanics being added although I did find it to be a bit repetitive after a bit. It didn't drag on too long but I think that it could have ended a bit earlier (maybe instead of 100-250-500 it could be 100-200-300). The story was incredibly simple but added charm to the gameplay that wouldn't have been present without it, so nice job there. Overall, great job and incredibly polished game!",
      "New favorite Game Jam game just dropped. This is genuinely in the top 5 of ALL Game Jam games I've ever played. The story was super fun! I wish more viruses were just cats lol. All the gameplay was really captivating, managing to ensure I never looked away from my screen for a second! I would love to see an expanded version of this game, similar to \"There Is No Game.\" I would buy it in an instant!",
      "That was awesome. One of the best I've played so far, perfect entry.",
      "One of my favorites for the round. Simple, but fun and the story really ties in well. Great looking UI as well, I made sure to the computer fully. Great job.",
      "I really like the narrative with the cat .",
      "Great game and cute story!",
      "This game has such a great vibe. I'm torn because the story and gameplay are great, but the theme just feels off to me. I think there are other ways to tell this story that don't require the computer interface. At the same time, the meta kitty cat memeing on me is great! Maybe instead of a cat computer program, it could be a goblin dungeon I'm trying to escape? I dunno. All that is just nitpicking anyway, you've made a great game. Thanks for making me smile!"
    ],
    "comments_posted": 1,
    "created_at": "2025-02-13 01:11:53",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3293688",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "142",
      "topics": null,
      "followers": "53",
      "following": "10"
    }
  },
  "3324687": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "gamefavorites",
    "game_title": "ceph",
    "platforms": [
      "web"
    ],
    "rating_count": 19,
    "comments_received": 15,
    "comments_raw": [
      "Super fun game!",
      "Killer opening scene, maybe my favorite.  Love the look of it all and especially the sound effects.   I'm not very good at these kind of games, but I still enjoyed this one.  The surfing was cool and the death sound was perfect (I heard it a lot). :)",
      "This was fantastic!  Just the sort of absurd story and unique gameplay I love to see from game jams and that you do so great at!!  Incredible game!",
      "The story was absurd and I love it :D",
      "Amazing storytelling. I loved the opening cutscene SO MUCH. I feel so bad for poor old granny.",
      "It was a very strange story ) Interesting surfing idea!  I find the area just after the first book the most difficult in the game; maybe it's just for me. And despite of full description of how to beat the boss, it took me >20 tries )",
      "I love that surfing mechanics :)",
      "Fun game! I wish that the jump was a bit floatier up and then faster down instead of the other way around. The boss was a bit tricky but only really in what you had to do to hit him, not really to avoid him, which in my opinion made the fight less fun than had it been avoiding his attacks to get an attack off. The cutscene at the start was super cute and the end I think did a good job of bringing it together even if the middle part felt a little bit weird with the story. I think that the projectiles were neat, I liked the multi use of the slime stuff to shoot and to surf and I think that the animals were a good inclusion too. The whole game really felt like a solid and complete experience. It was maybe a bit too difficult for me but that's probably a me issue. I had a great time, well done!",
      "Very fun game. As far as the story task with projectile and animal requirements I think you nailed it. I loved that you had controller support! Well done!",
      "I love this! I found the final boss a little tricky since you had to jump so close to the wall to hit him, but after a few tries I got it. I'm also not sure if I missed this in the tutorial, but I didn't know you could slime bats until I did it on accident. Otherwise, 10/10 game!",
      "Visuals and sound were really cool. Cutscene at the start was well made, setting out the story for the game.  Star of the show was the level design, it felt very well put together. Awesome job, I really enjoyed it.",
      "Damn this was an awesome experience. I'm happy I got to play this! Well done! :D",
      "Was great to play on stream! Please feel free to watch for comments there (around 01:36:15)",
      "Fun and silly game you made here. I always enjoy playing through yours. Well done.",
      "Amazing game - I love the art style and the cutscene!"
    ],
    "comments_posted": 23,
    "created_at": "2025-02-14 00:04:54",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3324687",
    "coolness": 23,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "945",
      "topics": "13",
      "followers": "35",
      "following": "15"
    }
  },
  "3311403": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "aaronthegoofy",
    "game_title": "m'egg'ch!",
    "platforms": [
      "web"
    ],
    "rating_count": 26,
    "comments_received": 21,
    "comments_raw": [
      "The platforming feels great! I felt I could move precisely and if I ever got hit, I deserved it. I love the minimal color pallet, too, reminds me of old GameBoy games ð\u009f\u0098\u008e",
      "always nice to see a game with the  coyote jump :)",
      "Cool platformer.  It was very satisfying to beat the big boss chicken.  Love the pixel art style and monochromatic design. Also, the retro music was perfect.  Also, not too hard, which I really appreciate.  Really well done!",
      "A really simple and fun platformer! The story was filled to the brim with character, and the art was really nice. The combat didn't really seem necessary, and I had an issue with the gun not reloading if you turned around before the animation was done. Not a huge issue, but it causes me some confusion. The end scene reminded of Cuphead, so that was fun! Great work.",
      "Well done! A fun and well done game!",
      "Fun game, satisfied all criteria, and great work on the particle effects. You are just 13, you have great future ahead :)",
      "This was a good submission! I can tell that you worked hard on the enemy pathfinding and stuff. All around, pretty good for such a short game!",
      "Pretty silly but ultimately fun story :D the chickens weren't much of a threat, except for that congaline that showed up when you jumped down a cliff in one of the later levels :') and I liked that there was a boss at the end.",
      "The art was cute and the story was simple but enough to make the game feel complete. I think that the animals made the simple platformer a lot more engaging but I didn't feel myself shooting really at all, considering the enemies were predictable and not actively aggressive whilst also being tanky enough that they are annoying to kill. I think the game could have used a bit more variety, maybe with the platformer controller from r1 to add some more movement options for example, but there were not enough levels that it really felt like it dragged on. Cheesed the boss by standing in the corner and shooting but it was still a nice addition and way to end the game. I had some issues shooting while changing direction, which is actually another reason why I didn't fight enemies as you can't run away and then quickly turn around to shoot. I did think that the animations were very cute though and I think that the game did come together as a complete product, nice job!",
      "Good Job.",
      "Nice aesthetic and color palette. I appreciate the details in the animation, especially the smoke coming out of the gun when its on cooldown.",
      "I love the game boy colour palette. Great character design and the death animations for the chickens were cool. The story was pretty funny also and I enjoyed playing this game. Well done!",
      "Was great to play on stream and have you there popping in!",
      "Fun game with graphics and a palette I love. Good story, well done.",
      "Music is good, the story is funny and meggech was cool! It fits the criteria nicely good job",
      "Your character design and name is fantastic and I love the art style. I liked the boss fight too and it was great watching it bouncing around trying to squash me. As others have said, I also wasn't able to read the text fast enough",
      "nice music! I liked how everything was straight to the point. No frills.The text is a little difficult to read, though.",
      "Very charming color and style! So OG gameboy-esqueI love the story too haha! Simple and sweet",
      "",
      "good game looks cool unforchunatly no story,",
      "Fun game!"
    ],
    "comments_posted": 0,
    "created_at": "2025-02-08 17:11:35",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3311403",
    "coolness": 13,
    "participant_info": {
      "profile_url": "https://itch.io/profile/aaronthegoofy",
      "member_since": "11 November 2024",
      "posts": "107",
      "topics": "1",
      "followers": "11",
      "following": "1"
    }
  },
  "3233799": {
    "overal_rating": [
    ],
    "overal_raw_rating": [
    ],
    "participant": "totdy",
    "game_title": "🛸Alien Chill Guy Journey",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "This was an interesting platformer with a fun backstory.  Unfortunately, I was terrible at this game.  Everything moved so fast and I died on the spikes so many times.  I wish there were difficulty levels.  I'm sure others were brilliant at it though and I just need to practice more.  Good job.",
      "I really enjoyed this game in the fisrt round. Nice to see how it's grown since then. Good job :)",
      "movement was very fluent loved the use of the projectiles. kinda for some reason took me back to good old crash bandicoot. the original one thank god it wasn't as hard though. wish there was a bit more of a story i saw that you used more context then directly telling what is happening which is always a neat way to tell a story and as the development process well... develops...the story will unravel  but this has some real potential",
      "The platforming controls themselves have a had a major improvement from Round 1! That being said, I deeply miss the old system of collecting animals an items. They allowed for so much creativity and cool problem solving options! The new system of shooting things to make them bigger is just, in my humble opinion, a much less interesting concept. Regardless, still a good platformer!",
      "Platforming was super responsive and the level design was super clean. I liked how you had to shoot the animals and mushrooms to embiggen them. The backtracking portion was made really clear with the camera panning and clever foreshadowing. The last platforming bit was super challenging and precise but I got it eventually.",
      "I see you removed the ability to pick up animals, to now just make them bigger.",
      "I find it a bit hard to hit stuff as bullets feel a bit small, but liked it anyway :) good job",
      "loved it!i dont really have a  lot to say but you made this game very wellgreat work!!",
      "Everything came together quite nicely! I found the hitboxes for the spikes to be wayyy to large compared to their sprites, which was a bit annoying when riding a snail across but horrible when traversing up the part with the angled spikes. The animals and projectiles work really well together but I don't really know what the story was. The art and music was simple but consistent and an enjoyable enough vessel for the gameplay. Overall, nice job!",
      "Pretty sweet. I like how you switched things up from the round 1 entry because I remember really enjoying that one too! Keep going!",
      "Very cool game!",
      "The platforming and shooting were fun and a bit challenging. I think you got everything in there as far as the challenge of the round and it's a fun game.",
      "This is cool! Very chill guy energy."
    ],
    "comments_posted": 2,
    "created_at": "2025-02-08 01:22:29",
    "game_url": "https://itch.io/jam/gdko-2025-round-2/rate/3233799",
    "coolness": 6,
    "participant_info": {
      "profile_url": "https://itch.io/profile/totdy",
      "member_since": "22 June 2019",
      "posts": "22",
      "topics": null,
      "followers": "7",
      "following": "39"
    }
  }
}