{
  "2017211": {
    "overal_rating": [
      "Score*",
      "4.267",
      "4.067",
      "3.867",
      "3.667",
      "3.893",
      "3.600"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.267",
      "4.067",
      "3.867",
      "3.667",
      "3.893",
      "3.600"
    ],
    "participant": "crayonmelon",
    "game_title": "CENTIPEDE JR.",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 12,
    "comments_raw": [
      "Great aesthetics and sound! Gameplay is smooth and satisfying and the screams of the people brought a smile to my face. Loved the intro sequence as well! Great work!",
      "In my opinion, you are hands down the most creative person in this competition.  You always come up with the most unique ideas for each challenge.  This one was no exception.  Totally took the original game and stood it on its head.",
      "Really enjoyed this, great aesthetic, the ad at the start was so clever! Wish I didn't have to restart each time but coding is a hard mood :)",
      "This ad was everything, I am so happy that someone used it ! Loved the aestetic as always, and a really fun take on centipede ! Top notch !",
      "Wow. Just wow. Everything about this was perfect.",
      "just shlooping around destroying things! Reminds me of a giant worm flash game I used to play where you dive under and above ground destroying things. Great job on the manic feel of destruction!",
      "Dang what a good game. all the polish is on point and I like the role reversal of playing as the centipede. the centipede was also really fun to control.",
      "> Hey, what's up with that sick thumbnail and intro?",
      "it was reallyfunmurdering and killing everyone in the town.loved the use of the old centipede ad music too lol,however i wish that there was like a small indicator on where the things you need to destroy are, because i spent like 5 minutes looking for a helicopter lol",
      "how!?? so creative! loved it! fantastic job",
      "The missions were a great way to give the destruction a purpose other than having fun killing everything.",
      "This was awesome!  Loved the style, missions, and use of the old timey ad video!  Excellent entry and take on centipede!"
    ],
    "comments_posted": 8,
    "created_at": "2023-04-14 18:41:42",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017211",
    "coolness": 10,
    "participant_info": {
      "profile_url": "https://itch.io/profile/crayonmelon",
      "member_since": "22 May 2019",
      "posts": "190",
      "topics": "1",
      "followers": "61",
      "following": "13"
    }
  },
  "2017104": {
    "overal_rating": [
      "Score*",
      "3.467",
      "3.200",
      "3.133",
      "3.200",
      "3.067",
      "2.733"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.467",
      "3.200",
      "3.133",
      "3.200",
      "3.067",
      "2.733"
    ],
    "participant": "solisu",
    "game_title": "Centipede",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 13,
    "comments_raw": [
      "I'm a scaredy cat, got a good fright out of this on stream! Great work.",
      "Great art and atmosphere all around. The view bobbing was a bit much for me, but I enjoyed my time playing nonetheless. Nice work!",
      "great entry!  VERY CREEPY VIBES!",
      "So creepy, but also so cool!  I love how unsettling a lot of the elements are together.  Like that version of \"Let Me Call You Sweetheart\" playing.  (Who is that, btw?  I don't recognize that version.)",
      "Love the first person take on Centipede. I wish the game was a bit clearer on what you should be doing. At first, I was just walking around for a while and nothing was happen. Also, a UI for points, ammo, maybe a map or some such would be nice. Great job.",
      "too scary to keep playing lol, great artstyle and aesthetic!",
      "Pretty good game! I loved the models and the pixelated style plus the slight horror vibes.",
      "This actually happened to me yesterday.",
      "I'm really glad you did this FPS horror take, I really wanted to see someone do it since I'm not a big 3D person myself. I think a crosshair would have been great, and I'm not a big fan of the walking wobbling, but other than that I love this take on the game.",
      "Great first person adaptation. The look and feel of the game was great.",
      "The game looks awesome throughout its entirety and I like the twist. I think having a crosshairs on the gun and some way of knowing the score whilst playing would be beneficial. It's a good game and I managed to make it on to the leaderboard",
      "Really cool take on centipede!  First person shooter didn't even cross my mind.",
      "as soon as i opened i was just like, no fucking way. such a great idea to make it a first-person shooterand it was actually kinda scary, well everything except the centipede itself, the centipede was really hard to kill, I couldn't tell if i was missing or it just had high health,  but it would have been nice to have more response. other than that it was great! the other enemies were great and scared me a couple times too! i ended with a score of 180 though idk if thats bad but it probably is lol"
    ],
    "comments_posted": 0,
    "created_at": "2023-04-14 17:53:19",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017104",
    "coolness": 0,
    "participant_info": {
      "profile_url": "https://itch.io/profile/solisu",
      "member_since": "14 March 2019",
      "posts": "31",
      "topics": null,
      "followers": "18",
      "following": "24"
    }
  },
  "1989457": {
    "overal_rating": [
      "Score*",
      "3.941",
      "4.176",
      "4.000",
      "4.012",
      "4.000",
      "3.941"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.941",
      "4.176",
      "4.000",
      "4.012",
      "4.000",
      "3.941"
    ],
    "participant": "brainfartstudio",
    "game_title": "Centipede 3000",
    "platforms": [
      "web"
    ],
    "rating_count": 17,
    "comments_received": 14,
    "comments_raw": [
      "Really faithful recreation with a very nice graphical overhaul! I thought it was missing sound effects, but after reading through the other comments, they were just turned down at the start of the game somehow. No complaints from me! Great work!",
      "3D lego pixels! Nice recreation, Having to wait for my shot to respawn after i shot it to the other end of the screen was frustrating and caused many deaths, but i guess that's centipede lol",
      "I loved loved loved the chunky pixel art, very unique ! (Like Game Dav I didn't have sound effects at first but I saw your comment and checked in the option, the sounds were turned off at first) Well done !",
      "Solid remake! Wished there was a bit more personality but the recreation side of things is rock on! Great job!",
      "A solid remake of Centipede. One of the most polished games in the jam. With achievements?!",
      "Really great game! super well polished and I loved the screen shake and particles although there were no sound effects. The leaderboard was also a nice touch. and the chunky pixel art was very cool!",
      "I am truly impressed with your coding skills. The game feels and plays just like the classic, and the level of polish put into it is amazing. I see that a lot of effort went into this game with all of the little details.",
      "Wow. this is by far one of my favorite games in this jam and one of the only ones to keep me playing again and again trying to beat my highscore. bravo",
      "Damn, you got me real good with that highscore and achievements page, why didn't I think of that?! Love the 00s you slapped behind everything as well, really got me feeling rewarded for playing hahaha",
      "great remake! and loved the artstyle!",
      "Really great reconstruction of the classic.",
      "I did just want to keep playing and I really like the leaderboard and achievements. The game looks and plays great",
      "Really liked the pixelated look of your art!  I think this turned out great!  Felt like something that would be an actual official centipede remake at an arcade.",
      "Love the game!! The achievements page is.... crazy awesome.  Would love to learn how to do that one day!"
    ],
    "comments_posted": 16,
    "created_at": "2023-04-14 04:16:23",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/1989457",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/brainfartstudio",
      "member_since": "20 August 2021",
      "posts": "306",
      "topics": "2",
      "followers": "35",
      "following": "26"
    }
  },
  "2015498": {
    "overal_rating": [
      "Score*",
      "2.867",
      "2.933",
      "3.067",
      "3.000",
      "2.920",
      "2.733"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.867",
      "2.933",
      "3.067",
      "3.000",
      "2.920",
      "2.733"
    ],
    "participant": "game-dav",
    "game_title": "Centipedes In Space - GDKO 2023 - Round 4",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 11,
    "comments_raw": [
      "Pretty! I loved the mix between centipede and missile command, so unique!",
      "This game was just so pretty :) I could get lost in the background.",
      "I really empathize with your struggle with the centipede mouvement, it is so hard to get it right ! Nice twist with the canon, it was really fun !",
      "What a fun twist on the original game! I really enjoyed the music, kind of reminded me of Risk of Rain. Nice work!",
      "I love that you keep using this aesthetic in ongoing rounds.  It's really unique.  Almost feels like all your games are set in the same universe.  Which is pretty cool.",
      "I think I'd like if you only lose lives if they hit the canon, rather than just the floor, but other than that shooting and aiming felt really intuitive and so quick and easy to pick up",
      "The cannon is ace and saving the highscores is a really good way to get players coming back",
      "This is great! the overall responsiveness when you shoot is perfect.",
      "really fun! dont really have any complaints :) i managed to get 8100 on my first run",
      "Fun shooter with well done mechanics.",
      "You had a few weird things with your centipede movement, but overall the mechanics worked together really well, and I REALLY loved the aesthetic and music.  Really cool take."
    ],
    "comments_posted": 19,
    "created_at": "2023-04-14 18:58:27",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2015498",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/game-dav",
      "member_since": "23 January 2021",
      "posts": "934",
      "topics": "19",
      "followers": "25",
      "following": "14"
    }
  },
  "2007097": {
    "overal_rating": [
      "Score*",
      "3.657",
      "3.795",
      "3.312",
      "3.726",
      "3.575",
      "3.381"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.786",
      "3.929",
      "3.429",
      "3.857",
      "3.700",
      "3.500"
    ],
    "participant": "jebouin",
    "game_title": "Chitin Invasion",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 14,
    "comments_received": 11,
    "comments_raw": [
      "Super addicting! I loved the feel of progression in this. Getting the increased damage and mowing down trees and rocks (and people) just feels good. Great animations, a whole seed based island generator, just incredible work!",
      "OHMAIGOSH??? You think I'm going to win???? I really appreciate that! What an honor! This game was excellent, I know you didn't have enough time to finish due to illness, though this was still all amazing, I loved both modes, they both feel really different, I think with more bugs and a day night cycle you could turn this into almost like a 2D crafting survival game! Can't stress enough how talented you are, and how I'm going to have a big opponent in the final. Congrats.",
      "First, I really hope you're feeling better.  That aside, I still think you have a really cool idea here.  So many small things that looked and felt really good.  (I'm especially curious about getting it moving up walls...)",
      "cool crafting mechanics. Fun build up of power as you become a deadly centipede. Great technical abilities shown! Nice job!",
      "This was a really cool game! how you managed to fit a whole seed based island generator into two weeks while also being sick is just insane. like others have said this game is super well polished with lots of cool animations like for the centipede. even with the bugs this is still an amazing game!",
      "Wow. Glad to see i was right about my prediction of who was going to win. despite the bugs this game is something i would pay money to play a finished version of.",
      "Aww it was rly sad to see the game was unfinished, but I have to say you know your bugs and limitations well, and you must have prioritized your tasks so well to push out such a great game on a tight timeline, I really respect you for that. Side note I would really love to play a finished version of this game, it is already heaps of fun as is!",
      "when you said it was unfinished i thought it was gonna be bad, not A FUCKIN MASTERPIECE, it is really fun leveling up as the centipede and gaining abilities and killing villagers, it was all really satisfying to play, like even despite being sick, you made a better game than like half of us! but after a while, my game did crash once i reached like lvl 8-9 and sorta... crashed my entire browser lol, but other than amazing entry as usual!",
      "Despite being sick, I am impressed with how much you have accomplished here. There is a lot going on and I can only imagine what it would have been like if you had completed it. I love the fact that you can play as both the villagers and centipede.",
      "Had a lot of fun playing as the centipede and leveling up, it was very addicting.",
      "Even incomplete and with bugs this was pretty cool.  I thought it was an awesome concept and it was still really fun to play!"
    ],
    "comments_posted": 2,
    "created_at": "2023-04-14 17:51:58",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2007097",
    "coolness": 8,
    "participant_info": {
      "profile_url": "https://itch.io/profile/jebouin",
      "member_since": "20 December 2013",
      "posts": "116",
      "topics": null,
      "followers": "141",
      "following": "22"
    }
  },
  "2004328": {
    "overal_rating": [
      "Score*",
      "4.278",
      "3.933",
      "4.058",
      "4.002",
      "3.933",
      "4.140"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.429",
      "4.071",
      "4.200",
      "4.143",
      "4.071",
      "4.286"
    ],
    "participant": "sijilum",
    "game_title": "Creepy Crawly",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 11,
    "comments_raw": [
      "This game perfectly captures the feel of centipede while still being its own unique thing. Nice work!",
      "Having the different levels was a really interesting take on classic Centipede.  And I liked it!  Loten mentioned the Mario 3 map vibes and I can totally see that.  Might have to try that myself at some point.",
      "",
      "Ok. Yea... Okay,.. I don't know what to say. Attention to the small details. High quality, well implemented mechanics. This was amazing. I dread getting paired against this game because I KNOW I ain't gonna survive that haha, great job!",
      "Holy Jesus this game. I don't even know how to begin to describe how awesome this game is.  The controls are tight and really nice and the shooting is super satisfying. I love the progression of being in a dungeons and working your way though increasingly challenging rooms. Its all so expertly juicy with just the right amount of screen shake and particles.  5/5 absolutely incredible",
      "Great aesthetic, music and progression! I really enjoyed the speed of the last level! The upgrades are balanced and spaced out appropriately. I enjoyed your intro animation as well. Great work!",
      "Great polish, extremely rewarding with the world map progression. I feel that the grid being so short kinda takes away the strategy behind the centipede movement and the mushrooms, but it is still very fun in its own right. Love the skulls! ð\u009f\u0092\u0080ð\u009f\u0092\u0080ð\u009f\u0092\u0080",
      "Really great version of Centipede with a world map. The upgrades were well balanced and made it a lot of fun and very satisfying.",
      "I made it out of the dungeon. The powerups in the overworld map were a good addition and I liked the increased speeds of the centipedes",
      "This was awesome.  The visuals, music, and style really went together well.  The CRT filter really gave it that extra something, too.",
      "loved the feel of the game, the art was great, and the music was a great fit! the controls felt responsive and juicy and i liked all of the pick ups. all in all great submissionp.s glad that you changed the exit button, prevented me from accidentally quitting this time lol"
    ],
    "comments_posted": 5,
    "created_at": "2023-04-10 20:53:11",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2004328",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/sijilum",
      "member_since": "13 May 2020",
      "posts": "119",
      "topics": null,
      "followers": "37",
      "following": "10"
    }
  },
  "1991238": {
    "overal_rating": [
      "Score*",
      "4.300",
      "4.313",
      "4.500",
      "4.063",
      "4.250",
      "4.375"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.300",
      "4.313",
      "4.500",
      "4.063",
      "4.250",
      "4.375"
    ],
    "participant": "loten",
    "game_title": "Creepy Crawly Crush",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 11,
    "comments_raw": [
      "Super creative take on Centipede! The sound effects are great and the art is wonderful. I especially like the player sprite. Great work!",
      "Man this was amazing! The combo system was really good and that energy from building up points was awesome, not a huge fan of stuff like the cobwebs, maybe a system where you mash to escape instead? Really good game, coming back for more :)",
      "such a great idea pushing the boundaries of getting combos and continuing to move to build up points! Really makes you say \"If I could have just landed a few more of those combos I could get an insane score!\" Keeping you coming back",
      "Really good game! I loved the art and all the effects for the mushrooms like the big explosion on the red ones and the little outlines when you jump on the blue ones. my inly issue was the jump which was very weak and took me a while to get used to. besides that its very good and I loved the leader board (even if I cant get on it lol)",
      "This is just a delight to play. I love the idea so much putting platforming into Centipede. Its also really chill, this game cured my anxiety thankyou.",
      "Crazy fun to play, really really cool and unique take on the game. I think the hitboxes could have been clearer or more forgiving, but other than that this is so perfect for this round.",
      "this was really fun! i played it like 20 times and managed to get second on the leader board, for now >:) i wanted to get first but jebouin somehow got like a billion so thats impossible. But really great game! dont have any complaints!also big purple mushromð\u009f\u0091\u008d",
      "Very fun and addictive game! It took me a few tries to get used to some enemy patterns (and I'm still not sure how to kill the hornet without taking a hit) but still managed to get almost 100k points",
      "Fun idea turning it jumping platformer! Had a blast playing this game.",
      "Your game has really beautiful art and its a real joy to jump and bounce around in. This is my favourite game this round",
      "Always a fan of your stuff.  Really impressed with how you made something that had an entirely different play style while still including the core centipede mechanic.  It was weird to be like \"yeah this is still totally centipede\" even as I was bouncing around.  Great job!"
    ],
    "comments_posted": 12,
    "created_at": "2023-04-13 12:49:22",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/1991238",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/loten",
      "member_since": "12 February 2019",
      "posts": "169",
      "topics": null,
      "followers": "16",
      "following": "6"
    }
  },
  "2017223": {
    "overal_rating": [
      "Score*",
      "4.467",
      "4.173",
      "4.200",
      "4.200",
      "4.133",
      "3.867"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.467",
      "4.173",
      "4.200",
      "4.200",
      "4.133",
      "3.867"
    ],
    "participant": "spacespy",
    "game_title": "CyberPede",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 12,
    "comments_raw": [
      "Wonderful game! What an insane amount of content and polish! The game plays really well and the music and sound are top notch. The effects are eye candy, and the progression felt balanced and rewarding. Great work!",
      "Fantastic game. Having the centipedes coming down like the poisoned ones from the classic was a great choice as that is a really fun part from the original. Everything looks great and I like all of the different levels and special effects",
      "suuuuuuper polished! Very clean mechanics, great feeling movement and destruction. Really good stuff!",
      "With the level of polish and as many mechanics as you have in here, I'm starting to think all that \"I didn't have time, I didn't do anything today...\" stuff in chat was all just a mind game.  Hmmm...",
      "Jesus this was an amazing entry. The polish was off the charts and it was super rewarding and engaging. The upgrade system was super cool and I liked all the enemy variety's. the only issue was that by the time I got to the boss I had so many upgrades I killed him really fast and it felt a little underwhelming. but still absolutely incredible 5 out of frickin 5",
      "Very polished entry, I had fun beating it! My only complaint is that when there was a lot going on the coins looked a bit like bullets hitting the player, maybe you could make them smaller or make them move to the counter instead of the player",
      "Really well polished, I think I'm going to have to steal those level transitions for my future games! One small change I would make is to have bumpers not drop any gems, and instead reward the player for completing the levels fast, as I think that would make the game a lot more exciting. That being said, the polish itself was more than enough to keep me engaged to the very end.",
      "Fun and juicy game. I was able to complete it on my first play through. The shop in the game felt very rewarding and added to the overall experience.",
      "you are definitely getting top 3 this round, this game is great! its juicy and responsive! i love the art music gameplay and everything! i did get that bug where your health bar disappears and then somehow had died 3 times and still had one life left? and even with that i still only made it 2-4 lol. all in all great entry!",
      "Great shooter with awesome upgrades. Had a lot of fun and the last boss was great.",
      "",
      "This was very well done.  Felt like a fully finished and polished game!"
    ],
    "comments_posted": 18,
    "created_at": "2023-04-14 18:52:03",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017223",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/spacespy",
      "member_since": "06 June 2020",
      "posts": "479",
      "topics": "7",
      "followers": "129",
      "following": "141"
    }
  },
  "2013321": {
    "overal_rating": [
      "Score*",
      "3.381",
      "3.519",
      "3.726",
      "3.657",
      "3.547",
      "3.450"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.500",
      "3.643",
      "3.857",
      "3.786",
      "3.671",
      "3.571"
    ],
    "participant": "dev-pirates",
    "game_title": "Descentipede",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 10,
    "comments_raw": [
      "Great game! impressed that this was made in 2 weeks, there were some  bugs with the movement and i got stuck a couple times but overall the game worked fine.",
      "Woah! This was amazing, took me a while to get used to the mechanics but by the later puzzles I had that ahah! And felt like a genius, with better tutorialisation this could be a hit!",
      "Nice puzzles! It took a little getting used to with splitting and getting my head around mechanics but was a great idea for a puzzle game. (Great that you included splitting too though as an ode to the original game )",
      "man what a great game! I loved the variety of levels and the how there's a good mix of puzzle and platforming.  The controls were very confusing at first, so much so I had to have a picture of it beside me to reference but I eventually got used to it. Really great!",
      "Super impressive! I had no issue with the controls at all. The levels were well designed and the mechanics were really fluid. Only got the centipede stuck a few times, but the quick retry made it a non issue. Great work!",
      "i was so good at the the game that i managed a 33/31 ð\u009f\u0098\u008eidk how but i did lol, but either way this was great! all the puzzles were fun and intuitive! it was really fun! i liked the art and the music and everything in general, the centipede did get stuck a couple times, but i just disjoined and rejoined and that seemed to fix it lol. I left your game to  last in rating because of the huge amount of controls but i got used to it pretty quickly so idk what i was so worried about, all in all amazing entry!",
      "wtf, this is so good. It even works with myofficial Xbox 360 wired controller TM.",
      "Great concept, reminds me of similar snake-like puzzle games. I think a grid based movement system would work a lot better for a game like this, and the controls can be a bit overwhelming at times, but I still had a lot of fun puzzling it out.",
      "I really loved this concept.  The controls did feel a little clunky, but once I got used to it this was a really great game!",
      "I got a score of 27 out of 31 which I'm pretty happy with. This is such a unique type of game and I like the many mechanics to it. The layout of the puzzles are set out really nicely and it was good to discover interesting ways of getting around"
    ],
    "comments_posted": 19,
    "created_at": "2023-04-13 08:43:27",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2013321",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/dev-pirates",
      "member_since": "30 June 2016",
      "posts": "574",
      "topics": "1",
      "followers": "12",
      "following": "13"
    }
  },
  "2016029": {
    "overal_rating": [
      "Score*",
      "4.347",
      "4.140",
      "4.002",
      "4.099",
      "4.140",
      "3.864"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.500",
      "4.286",
      "4.143",
      "4.243",
      "4.286",
      "4.000"
    ],
    "participant": "unburntstudios",
    "game_title": "Frontline Gardening",
    "platforms": [
      "windows",
      "web"
    ],
    "rating_count": 14,
    "comments_received": 11,
    "comments_raw": [
      "I know I was the skeptic when you first mentioned an isometric version of Centipede.  I'm glad you did it anyway.  I will be the first to admit I was wrong.  This was really cool!",
      "Absolutely amazing! Love the art, especially the the little pixel butt! Great sounds as well. Having the last level be endless is such a great idea. Most roguelikes end when you beat the last boss and you don't get to play as much as you'd like to with all the power you've accumulated through your run. This is a really neat solution to that. I had a blast playing! Amazing work!",
      "Wow, really  well done, loving the graphics, the polish was excellent, would've loved a bit more of an oomph on the sound effects department. Overall though really well done.",
      "Wow, another excellent entry from you. One of my top games this round. Love the upgrade system and it had a very nice variety of options too. 3D, 2D and isometric games from you, Iâ\u0080\u0099m too scared to try anything but top down or side 2D. Fantastic job on your game.",
      "Damn this game was good. I loved the isometric view point and all the art was really great as well. I liked the different weapons and all the upgrades you can get. My only issue was up until the nest the game felt a bit easy but its still a really solid game, 5/5.",
      "You pretty much nailed the mechanics of the original, on an isometric grid no less, AND you added rougelike progression as well? I'm so sorry to whoever has to go up against you ð\u009f\u0099\u008f",
      "Fun game with great art and the last part got intense and fun.",
      "Very impressive for 2 weeks, quality art (took a page from NUTT's book with the player lol)Isometric movement took a bit to get used to but overall a great game",
      "Dang this was good.  The isometric view, art, music, upgrades, pixel butt, all of it.  5 stars across the board.  I think you have a very solid chance of placing first this round.",
      "Really liking the art style, especially with the isometric view. I got to wave 27 with 234896 points. The last part was definitely my favourite, love how much there is to destroy and dodge and the environment is really great",
      "........ what the fuck. how did you make all of that in two weeks ?!?!?!??!!? it was so fun and the art was good and the music was great! i lost two health right away so i basically played on hard mode for the rest of the game and managed to reach the end where i survived 4 waves! also i think i got like every single power up and my build just got insane"
    ],
    "comments_posted": 19,
    "created_at": "2023-04-14 13:36:10",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2016029",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/unburntstudios",
      "member_since": "27 February 2021",
      "posts": "223",
      "topics": null,
      "followers": "8",
      "following": "2"
    }
  },
  "2017019": {
    "overal_rating": [
      "Score*",
      "4.500",
      "4.125",
      "4.250",
      "4.313",
      "4.237",
      "4.000"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.500",
      "4.125",
      "4.250",
      "4.313",
      "4.237",
      "4.000"
    ],
    "participant": "simoncb",
    "game_title": "Kittypedes!",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 12,
    "comments_raw": [
      "Man, so CUTE, I can't say this enough! Everything was so well executed on every level,  I wish there was 8 direction shooting instead but there's only so much one can do! Huge points from me!",
      "Seriously, I need a tutorial series from you on creativity.  You always find a way to take the prompt and really stretch it creatively.  And this was no exception!  Never would've thought to gone to kittens.",
      "This was so fun ! I also wished that we could aim with the mouse (or maybe the centipede shouldn't be able to move diagonaly ?) It was such a happy game omg, so good ! And thank you for allowing awful player like myself to not lose our progress when we die x) So well done !",
      "This is incredible! The sound, art and animations, everything looks and feels extremely satisfying.  Great work!",
      "Another banger game from you, everything about this is perfect",
      "Brilliant! Such a wonderful refreshing concept of a gameshow! Captured so well.",
      "There is so much to say about this amazing game! The art is adorable and incredibly colorful. The gameplay is super fun and I love the applause sounds coming from the background when you kill the enemies. Just the whole gameshow vibe with the cash being won and a prize at the end was really cool. I also liked the Duck on wheels cameo as he holds the round cards. Overall Spectacular game.",
      "Love the game show concept, the applause and cash are so satisfying here, really taking\"Did you feel rewarded for playing?\"to a 6/5. I think having the mouse to aim and shoot would have been great, but other than that it was perfect.  Couldn't stop smiling!",
      "Your games always give me so much joy to play and puts a smile on my face. Great art, sound and gameplay. Amazing as always.",
      "really fun! the controls were a bit hard but i got used to it. the art was amazing as usual and music and sound were great! i managed to get s rank first try with 2100$ and got the branded car!",
      "Really fun and engaging game. Loved the cats and boss and the power ups.",
      "Had a lot of fun playing and on my first try I got the S rank, 2500 dollars and walked away with a car. Awesome gameplay and looks great!"
    ],
    "comments_posted": 4,
    "created_at": "2023-04-14 18:22:31",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017019",
    "coolness": 18,
    "participant_info": {
      "profile_url": "https://itch.io/profile/simoncb",
      "member_since": "08 April 2015",
      "posts": "80",
      "topics": "1",
      "followers": "8",
      "following": "8"
    }
  },
  "2017365": {
    "overal_rating": [
      "Score*",
      "2.933",
      "2.733",
      "2.760",
      "2.533",
      "2.867",
      "2.733"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "2.933",
      "2.733",
      "2.760",
      "2.533",
      "2.867",
      "2.733"
    ],
    "participant": "bluegamemc",
    "game_title": "Maxwell",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 11,
    "comments_raw": [
      "Love the cutscenes, story as a whole was nice.",
      "Great cutscenes! Really cool to see some centipede lore. Nice work!",
      "Those cinematics! I really like the story element you've included! We need more stories like this to tell the truth about the mindless murder of innocent cent... I mean.. To just like... For fun or something (<_<)o,o,o,o,o,o,o,o,o,",
      "I love that you included a story element.  Really unique way to take it and you did it so well.",
      "The graphics and cutscenes are awesome. Also very satisfying shooting the centipede in 3D",
      "Pretty solid game. I loved the story and that opening cutscene with the text was very cool. I also liked how you translated centipede into 3d and it worked pretty well.",
      "I really love the intro to your game and how you managed to fit the perfect story into the centipede gameplay. Itâ\u0080\u0099s really cool to see the centipede gameplay in 3D. Great job.",
      "Loved the narrative!",
      "great entry! was pretty fun! the centipede did get stuck a couple times though and i would have to break it out lol, also that ending was great!",
      "Really great game, loved the look and feel and sounds, well I guess everything. Well done.",
      "Really liked the mix of first person shooter with classic centipede mechanics!"
    ],
    "comments_posted": 11,
    "created_at": "2023-04-14 20:40:12",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017365",
    "coolness": 11,
    "participant_info": {
      "profile_url": "https://itch.io/profile/bluegamemc",
      "member_since": "23 January 2022",
      "posts": "154",
      "topics": "7",
      "followers": "1",
      "following": null
    }
  },
  "2012759": {
    "overal_rating": [
      "Score*",
      "3.733",
      "3.533",
      "3.467",
      "3.267",
      "3.440",
      "3.200"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.733",
      "3.533",
      "3.467",
      "3.267",
      "3.440",
      "3.200"
    ],
    "participant": "gamefavorites",
    "game_title": "Mecha Melia",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 10,
    "comments_raw": [
      "Shrooms coming down like a massive avalanche was cool and I loved stuff like the boss fight, felt it was a bit easy/ended quick but this could be easily fixed! Lots of polish too! :)",
      "The shrooms falling was a cool twist.  And the visuals felt like they could definitely be an Atari classic, but in modern times.  Aesthetic was spot on.",
      "I liked the mushrooms becoming missiles idea! It adds to the risk reward feeling! Great idea. I was playing with my brother and it was a shame that once one person died they were out the rest of the time. (unless I missed the respawn)",
      "Really good game! I loved the meteors becoming missiles that you had to doge and the challenge of the game was just hard enough to be fun but not too hard. the music was also really nice and I liked that you can play in Co-op",
      "The mushrooms becoming projectiles is a really cool concept! I really enjoyed the graphics and music as well. Overall, great work!",
      "Great graphics, challenging gameplay, and an overall good game!",
      "The mushrooms becoming projectiles was such a cool idea.  Great job!",
      "Very interesting take with the mushrooms and bullet hell style gameplay. I feel like only having 1hp was a little harsh, and I missed the small vertical movement that the original had. I think this idea would work really well as a singleplayer game, using your mouse to aim and with the ability to jump! Great concept nonetheless",
      "Great game, the look and feel was great and reminded me of some 90s PC games.",
      "really fun version of Centipede! loved how it was sort of a bullet hell when shooting too many mushrooms! also, i didn't have anyone to play with so i just sorta put player two in the corner and switched to them when i died so i had two lives lol"
    ],
    "comments_posted": 16,
    "created_at": "2023-04-11 19:28:04",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2012759",
    "coolness": 16,
    "participant_info": {
      "profile_url": "https://itch.io/profile/gamefavorites",
      "member_since": "07 January 2022",
      "posts": "820",
      "topics": "10",
      "followers": "27",
      "following": "14"
    }
  },
  "2016714": {
    "overal_rating": [
      "Score*",
      "4.347",
      "4.002",
      "3.795",
      "3.795",
      "3.519",
      "3.312"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.500",
      "4.143",
      "3.929",
      "3.929",
      "3.643",
      "3.429"
    ],
    "participant": "nutt3d",
    "game_title": "Mush Rush",
    "platforms": [
      "windows",
      "osx",
      "web"
    ],
    "rating_count": 14,
    "comments_received": 12,
    "comments_raw": [
      "So cool! Loved all the unique characters, wish the enemies had more abilities to make it more of a fair fight, great twist on the centipede idea.",
      "Such brilliant art! Great take and super cool characters!",
      "I had a lot of fun with this.Looks great and its a great spin on the centipede idea.",
      "",
      "Amazing game! I loved the take on centipede and the different characters kept me hooked. the art is also super well done and I especially love all the animations where the character uses their special. Khori was my favorite character to play. Again incredible, top 3 material",
      "Really milked my MINUTES of excitement with those characters, I'd say that labor was well worth it <3",
      "Really fun game. Lilith was my favorite character to play. The art sound and music are all top notch. Really well done!",
      "I streamed your game last night I posted it on itch in the discussion section and on Discord, I absolutely loved your game! My favorite game in this round so far! I said on the stream I wish I could change my pick to who I think will win GDKO cause I now think it's you! I can see you at least in the final round, anyways fantastic entry oh and my daughter is named Lilith! Of course was my first character I choose",
      "this was such a good take on centipede! it felt like some weird alien sport and was really fun! not really anything to criticize about it!",
      "All of the characters are cool and like that they have different specials and being able to unlock a new character is definitely a good reward. I can tell a lot went into making this",
      "Very good entry, each character was fun to play and unique  (Loved the special animations for each character)",
      "This was really cool!  I was getting strong super nintendo minigame vibes.  Art, music, and style were basically perfect as always.  Slightly nitpicky thing is that if you just focused on getting to where you could direct hit the enemy the unlockable character could really easily stun lock them to get an insane score.  They'd get hit and stunned again before they could move."
    ],
    "comments_posted": 19,
    "created_at": "2023-04-14 14:36:21",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2016714",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/nutt3d",
      "member_since": "07 August 2022",
      "posts": "606",
      "topics": null,
      "followers": "51",
      "following": "3"
    }
  },
  "2017124": {
    "overal_rating": [
      "Score*",
      "3.063",
      "2.875",
      "2.625",
      "2.500",
      "2.500",
      "2.712"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.063",
      "2.875",
      "2.625",
      "2.500",
      "2.500",
      "2.712"
    ],
    "participant": "rsdnrs",
    "game_title": "Planet №89.328",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 12,
    "comments_raw": [
      "Not bad! Wish I didn't have to mash the fire button, gave my hands a workout!",
      "Really interesting take on centipede! I would have liked to been able to hold space down to fire instead of mashing it, but other than that, great work!",
      "The visuals were fantastic.  Especially things like the planets turning in the intro.  A lot of attention to detail on things like the tilt of the ship when moving.",
      "I liked the art and that super cool special move! kinda annoying getting trapped by mushrooms but I guess that's part of the experience, you've gotta manage those so they don't get close. Good job :)",
      "Looks great and has a nice opening scene. I really like the inclusion of special weapons. I wish the game was just a little easier, as I was not able to see the ending. Great job.",
      "Pretty nice game. The controls were good and I liked the opening cutscene.",
      "Very interesting choice of intro music HAHA",
      "Your game looks awesome and I like the intro too. I wasn't able to finish but managed to get a fair bit of damage on the head with those special attacks, good entry",
      "This was really cool!  I liked the intro space ship cutscene a lot and it really created a cool world for your game to take place in",
      "I loved the rocket moving between the planets and the game felt like a really good boss fight. Well done.",
      "pretty fun with great art, but i just wish there was more feedback when i got hit because i did not even notice it when i did, and then would look at my health bar and already be dead lol",
      "Interesting idea, and a fun and very challenging result!"
    ],
    "comments_posted": 0,
    "created_at": "2023-04-14 17:39:42",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017124",
    "coolness": 2,
    "participant_info": {
      "profile_url": "https://itch.io/profile/rsdnrs",
      "member_since": "04 October 2021",
      "posts": "91",
      "topics": null,
      "followers": "2",
      "following": "3"
    }
  },
  "2011171": {
    "overal_rating": [
      "Score*",
      "3.750",
      "3.813",
      "3.875",
      "3.813",
      "3.712",
      "3.313"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.750",
      "3.813",
      "3.875",
      "3.813",
      "3.712",
      "3.313"
    ],
    "participant": "puree-adventure",
    "game_title": "Swimming In The Lake",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 14,
    "comments_raw": [
      "Amazing presentation, aesthetics on point as always, one of the most difficult ones I've played so far, loving your use of storytelling.",
      "Amazing presentation! I'm glad you kept the shooting the same as the original centipede! All your games this jam have had an almost ethereal, dream-like quality to them that is equal parts calming relaxation, intriguing mystery, and a dash of unease. You've got a really unique style! Great work!",
      "You have real knack for creating engaging user experiences.I really hope you continue to develop this on your future projects :)",
      "I love the twist you put on it.  Putting it underwater really made it feel fresh and new.  Pair that with your art style?  Really well done.",
      "Probably one of the most interesting takes on centipede, nice work!",
      "Somehow felt bigger, like I was entering into a large world, like something meaningful was being exchanged... Not like a standalone arcade game. Great job in capturing that atmosphere",
      "Super cool game! The art style is very unique and I absolute loved it, plus I enjoy the chill gameplay and music.",
      "",
      "Excellent! Amazing variety in enemies, felt familiar yet new. I love all the small details here like the faithful centipede spawning, the one bullet on the screen limit, the little dots in the grid. Like others mentioned, the controls could be tighter, but other than that I'd say this is flawless. Big fan of your style as always.",
      "I already had a fear of the ocean and now I am forever scared.",
      "The theme to this game is amazing and the art style was consistent and well done.",
      "As others have mentioned the movement was a bit off, other wise very well done! love the aesthetic",
      "Looks like Malek already commented that the controls felt a little slippery.  Seemed like there was some ramp up/down times for movement that maybe weren't needed?  That being said, though, really good use of art, sound, and story to create a very cool version of centipede!  Great job!",
      "i already told you my response to this game but i will say it again, its great! it was kinda scary and really fun! the art, the gameplay, the music all fit together perfectly! i do have one small nitpick though, its just that the controls felt a bit slippery which made it hard to dodge some enemies at times, other than that amazing!"
    ],
    "comments_posted": 7,
    "created_at": "2023-04-14 12:00:21",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2011171",
    "coolness": 9,
    "participant_info": {
      "profile_url": "https://itch.io/profile/puree-adventure",
      "member_since": "10 May 2021",
      "posts": "242",
      "topics": null,
      "followers": "128",
      "following": "37"
    }
  },
  "2017101": {
    "overal_rating": [
      "Score*",
      "3.200",
      "3.313",
      "3.375",
      "3.188",
      "2.875",
      "3.250"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.200",
      "3.313",
      "3.375",
      "3.188",
      "2.875",
      "3.250"
    ],
    "participant": "h4zm4tt",
    "game_title": "THE ARCADE",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 12,
    "comments_raw": [
      "Awesome, loved the horror vibe going on, a shame you couldn't do everything you wanted though what you have is an excellent recreation.",
      "A fellow classic recreator!  And a good job at that!",
      "I was also expecting some kind of pony island reveal at the end x) Great recreation, and juicy, well done !",
      "Darn it! Couldn't beat my own score haha! somehow felt really good to destroy mushrooms. Was hoping it became an entirely different game after you lose lol. Great juice!",
      "Really interesting game. I loved the screen shake and the particles, it really made the game feel super juicy! I also liked the little horror thing when you lose It really surprised me the first time around.",
      "Really great recreation! The particle effects and screen shake are great additions. I'm curious about where the horror elements were going to go. Great work!",
      "I wasn't expecting this to have horror elements in it. A real polished game I enjoy 10/10. I always like screen shake",
      "Aww I was hoping for a Pony Island arcade machine reveal at the end! There are a few bugs here and there, but this is a great attempt at a faithful recreation",
      "nice remake! felt really good to play but i wish that there were 3 lives like in the original and also maybe an option to un-invert the up and down controls but other than that nice, (also idk if this  is right but i think the scoreboard isn't actually real, cause ain't no way jebouin got 1000000 points lol)",
      "Loved the graphics and take on Centipede. Well done.",
      "19545 was my hi-score. It's a good fun game and you nailed the mechanics too",
      "This game really captures the feel of Centipede, while not just being an exact clone. Good job!"
    ],
    "comments_posted": 18,
    "created_at": "2023-04-14 17:45:03",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2017101",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/h4zm4tt",
      "member_since": "21 October 2022",
      "posts": "224",
      "topics": null,
      "followers": "10",
      "following": "4"
    }
  },
  "2004047": {
    "overal_rating": [
      "Score*",
      "4.375",
      "4.000",
      "4.188",
      "3.913",
      "3.625",
      "3.375"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.375",
      "4.000",
      "4.188",
      "3.913",
      "3.625",
      "3.375"
    ],
    "participant": "lio-lim",
    "game_title": "Umbra",
    "platforms": [
      "web"
    ],
    "rating_count": 16,
    "comments_received": 13,
    "comments_raw": [
      "Really fun, felt a bit easy but none the less so so polished and full of juice, I love the mirror effect on everything, mixed with the rain.",
      "This brought me back to the arcade of my youth minus the cigarette smoke.",
      "So juicy ! Also did you make the music ? The music and sounds are so good, they create such a weird retro vibe, I loved it ! I like the old arcade drawing at the side, and the fading of the barrier, it's some nice details !",
      "Really great recreation of the original! Love all the added juice that made it your own! Great work!",
      "Your polish is always top notch.  I'm really going to have to go back to all your entries after GDKO and study your particle effects.  Those were fantastic.",
      "such polish! As expected from you! Wow. Even down to the fading in of the barrier as you get closer. It's the small attention to detail. This could very easily be plopped into an arcade and fit in and do much better next to the original! UHD 4K 320fps centipede! That could make a good YouTube vid aha",
      "Dang what a polished game. The effects are just incredible from the blood splatters of killing the centipedes to that water effect in the background it all adds so much.  I also love the arcade vibe with the sides of the screen being arcade like and the inserting of a coin to start your game. overall incredible!",
      "Congratulations for once again making a game with one of the greatest atmopheres I've ever seen.",
      "reminds me of this one arcade game I played once",
      "i managed only 9403 :L but its really fun! feels juicy and responsive, and looks amazing!",
      "Great recreation of the game. A lot of small but great improvements to the original.",
      "35703 was my hi-score. The game is really good and you managed to recreate all of the mechanics perfectly and made it much better than the original in my opinion",
      "The polish and aesthetics, the reflections, the graphics to the side, the way you introduced new enemies slowly, all of it was so good!  This has top 3 potential."
    ],
    "comments_posted": 17,
    "created_at": "2023-04-13 10:03:37",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2004047",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/lio-lim",
      "member_since": "01 December 2018",
      "posts": "306",
      "topics": null,
      "followers": "345",
      "following": "28"
    }
  },
  "2016288": {
    "overal_rating": [
      "Score*",
      "3.243",
      "3.243",
      "2.981",
      "2.760",
      "2.760",
      "2.898"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "3.357",
      "3.357",
      "3.086",
      "2.857",
      "2.857",
      "3.000"
    ],
    "participant": "ghostbitstudios",
    "game_title": "Wizard vs Mechapead",
    "platforms": [
      "web"
    ],
    "rating_count": 14,
    "comments_received": 12,
    "comments_raw": [
      "This is such a cool idea! I love the seed of this game. Great job for such a short period of time!",
      "3 DAYS ! That's crazy ! Well done !",
      "First off, I'm glad you're feeling better and still submitted!  Considering you were down most of the time, it's still impressive you got this off in 3 days.",
      "This was a really good game! the art is really nice and I love the mechanic of using manna. I also liked the mushrooms being the currency and buying upgrades in-between each round was cool.",
      "Turn based games always seem like a daunting task for me, for only 3 days this is really impressive! Glad you managed to submit despite being sick. Hope you feel better! Nice work!",
      "This was great for three days. I really liked the turn based take on the game. The upgrades were great but I felt a little OP after a few of them. I would have loved to see where you would have taken this concept if you had more time.",
      "This game left me wanting more, which is a good thing! I bought the monkey and I was very happy about it.",
      "glad you were able to submit and as everyone else said this was amazing for 3 days! i liked the mechanics and The shop and would have loved to see a more complete version if you had more time :)",
      "I think you did well for just 3 days and I like the idea of using the mushroom as a shield and the shop for upgrades",
      "Very well done for submitting despite the sickness, impressive for 3 days. Good job!",
      "A quick turnaround, you went from quitting to making a decently polished and fun game! So proud!",
      "Ok I know you threw this together quick but I still really liked the concept!  I would have really loved to see a more fleshed out version of this.  Turn-based centipede is something I thought a lot about doing so it was great to see it!"
    ],
    "comments_posted": 3,
    "created_at": "2023-04-14 16:13:13",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2016288",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/ghostbitstudios",
      "member_since": "30 June 2019",
      "posts": "721",
      "topics": "13",
      "followers": "44",
      "following": "48"
    }
  },
  "2014984": {
    "overal_rating": [
      "Score*",
      "4.400",
      "4.333",
      "4.200",
      "4.107",
      "4.000",
      "3.600"
    ],
    "overal_raw_rating": [
      "Raw Score",
      "4.400",
      "4.333",
      "4.200",
      "4.107",
      "4.000",
      "3.600"
    ],
    "participant": "malek-elsady",
    "game_title": "centi-puzzler",
    "platforms": [
      "web"
    ],
    "rating_count": 15,
    "comments_received": 10,
    "comments_raw": [
      "Okay this was one of my faves! Such simple yet effective puzzles mechanics! Only some small things like keeping the character locked to the grid and moving automatically to the next puzzle would be good, but really, this was such a great game! Probably my highest ranked, great job!",
      "Really good game, puzzles were creative and you have a really good sense of humor! Well done.",
      "Geez, dude.  You keep getting better and better the farther along we get in GDKO.  This is so well thought out.  Some great puzzle mechanics.  Good tutorial levels to teach the mechanics.  Challenge but fair puzzles.  You really nailed this one.",
      "Jesus this was a great game. Just the idea of using centipedes mechanics and Turing them into a puzzle game is really creative and cool. and the game itself is very fun and challenging. I playtested  the game and even knowing some of the puzzles it was still really fun to work through them all. On top of that, the amazing and funny story along with the ending cutscene both were great additions. 5/5s all around",
      "Awesome puzzle game with a really fun intro and ending! Went for as long as I could without hints and was delighted that the hints were basically puzzles themselves! When I couldn't figure out 18 I realized you could click the hint twice and get some extra help, that was just wonderful for me! Great work!",
      "What an excellent puzzle twist on the Centepede movement mechanic! I would have liked the bullets and mushrooms to move faster, and I wanted to see more puzzles that made use of the fact that you can't shoot through mushrooms, but this is very well designed overall. Atori would be proud <3",
      "Loved all the puzzles, very fun.",
      "Ok this to me feels like some top 3 stuff!  Granted, I still have a lot more to play, but this was some really great stuff.  Your art and sound really came through as well.",
      "I like the puzzles you have come up with, especially with all of the different ways the mushrooms interact and the teleport was awesome. I got through all of the puzzles and I used the hints on two of them, I think it was 14 and one more after this. Great game!",
      ""
    ],
    "comments_posted": 19,
    "created_at": "2023-04-13 15:57:52",
    "game_url": "https://itch.io/jam/gdko2023-round-4/rate/2014984",
    "coolness": 19,
    "participant_info": {
      "profile_url": "https://itch.io/profile/malek-elsady",
      "member_since": "01 July 2020",
      "posts": "1,039",
      "topics": "14",
      "followers": "47",
      "following": "53"
    }
  }
}